/* automatically generated by rust-bindgen */

#[allow(non_snake_case, non_camel_case_types, non_upper_case_globals)]
pub mod root {
    #[repr(C)]
    #[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
    pub struct __BindgenBitfieldUnit<Storage, Align>
    where
        Storage: AsRef<[u8]> + AsMut<[u8]>,
    {
        storage: Storage,
        align: [Align; 0],
    }
    impl<Storage, Align> __BindgenBitfieldUnit<Storage, Align>
    where
        Storage: AsRef<[u8]> + AsMut<[u8]>,
    {
        #[inline]
        pub fn new(storage: Storage) -> Self {
            Self { storage, align: [] }
        }
        #[inline]
        pub fn get_bit(&self, index: usize) -> bool {
            debug_assert!(index / 8 < self.storage.as_ref().len());
            let byte_index = index / 8;
            let byte = self.storage.as_ref()[byte_index];
            let bit_index = if cfg!(target_endian = "big") {
                7 - (index % 8)
            } else {
                index % 8
            };
            let mask = 1 << bit_index;
            byte & mask == mask
        }
        #[inline]
        pub fn set_bit(&mut self, index: usize, val: bool) {
            debug_assert!(index / 8 < self.storage.as_ref().len());
            let byte_index = index / 8;
            let byte = &mut self.storage.as_mut()[byte_index];
            let bit_index = if cfg!(target_endian = "big") {
                7 - (index % 8)

            pub type list_const_reverse_iterator =
                self::std::reverse_iterator<root::std::__cxx11::list_const_iterator>;
            pub type list_reverse_iterator =
                self::std::reverse_iterator<root::std::__cxx11::list_iterator>;
            pub type list_size_type = usize;
            pub type list_difference_type = isize;
            pub type list_allocator_type<_Alloc> = _Alloc;
            pub type list__Node = self::std::_List_node;
            impl Default for list {
                fn default() -> Self {
                    unsafe { zeroed() }
                }
            }
            impl ::std::fmt::Debug for list {
                fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
                    write!(f, "list {{  }}")
                }
            }
            impl PartialEq for list {
                fn eq(&self, other: &list) -> bool {
                    self._base == other._base
                }
            }
        }
        extern "C" {
            pub fn __throw_bad_exception();
        }
        extern "C" {
            pub fn __throw_bad_alloc();
        }
        extern "C" {
            pub fn __throw_bad_cast();
        }
        extern "C" {
            pub fn __throw_bad_typeid();
        }
        extern "C" {
            pub fn __throw_logic_error(arg1: *const c_char);
        }
        extern "C" {
            pub fn __throw_domain_error(arg1: *const c_char);
        }
        extern "C" {
            pub fn __throw_invalid_argument(arg1: *const c_char);
        }
        extern "C" {
            pub fn __throw_length_error(arg1: *const c_char);
        }
        extern "C" {
            pub fn __throw_out_of_range(arg1: *const c_char);
        }
        extern "C" {
            pub fn __throw_out_of_range_fmt(arg1: *const c_char, ...);
        }
        extern "C" {
            pub fn __throw_runtime_error(arg1: *const c_char);
        }
        extern "C" {
            pub fn __throw_range_error(arg1: *const c_char);
        }
        extern "C" {
            pub fn __throw_overflow_error(arg1: *const c_char);
        }
        extern "C" {
            pub fn __throw_underflow_error(arg1: *const c_char);
        }
        extern "C" {
            pub fn __throw_ios_failure(arg1: *const c_char);
        }
        extern "C" {
            pub fn __throw_system_error(arg1: c_int);
        }
        extern "C" {
            pub fn __throw_future_error(arg1: c_int);
        }
        extern "C" {
            pub fn __throw_bad_function_call();
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __true_type {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout___true_type() {
            assert_eq!(
                size_of::<__true_type>(),
                1usize,
                concat!("Size of: ", stringify!(__true_type))
            );
            assert_eq!(
                align_of::<__true_type>(),
                1usize,
                concat!("Alignment of ", stringify!(__true_type))
            );
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __false_type {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout___false_type() {
            assert_eq!(
                size_of::<__false_type>(),
                1usize,
                concat!("Size of: ", stringify!(__false_type))
            );
            assert_eq!(
                align_of::<__false_type>(),
                1usize,
                concat!("Alignment of ", stringify!(__false_type))
            );
        }
        pub type __truth_type___type = self::std::__false_type;
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __traitor {
            pub _address: u8,
        }
        pub const __traitor___value: self::std::__traitor__bindgen_ty_1 = 0;
        pub type __traitor__bindgen_ty_1 = i32;
        pub type __traitor___type = u8;
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __are_same {
            pub _address: u8,
        }
        pub const __are_same___value: self::std::__are_same__bindgen_ty_1 = 0;
        pub type __are_same__bindgen_ty_1 = i32;
        pub type __are_same___type = self::std::__false_type;
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __is_void {
            pub _address: u8,
        }
        pub const __is_void___value: self::std::__is_void__bindgen_ty_1 = 0;
        pub type __is_void__bindgen_ty_1 = i32;
        pub type __is_void___type = self::std::__false_type;
        #[test]
        fn __bindgen_test_layout___is_void_open0_void_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::__is_void>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::__is_void)
                )
            );
            assert_eq!(
                align_of::<root::std::__is_void>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::__is_void)
                )
            );
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __is_integer {
            pub _address: u8,
        }
        pub const __is_integer___value: self::std::__is_integer__bindgen_ty_1 = 0;
        pub type __is_integer__bindgen_ty_1 = i32;
        pub type __is_integer___type = self::std::__false_type;
        #[test]
        fn __bindgen_test_layout___is_integer_open0_bool__close0_instantiation() {
            assert_eq!(
                size_of::<root::std::__is_integer>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::__is_integer)
                )
            );
            assert_eq!(
                align_of::<root::std::__is_integer>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::__is_integer)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout___is_integer_open0_char_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::__is_integer>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::__is_integer)
                )
            );
            assert_eq!(
                align_of::<root::std::__is_integer>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::__is_integer)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout___is_integer_open0_signed_char_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::__is_integer>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::__is_integer)
                )
            );
            assert_eq!(
                align_of::<root::std::__is_integer>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::__is_integer)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout___is_integer_open0_unsigned_char_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::__is_integer>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::__is_integer)
                )
            );
            assert_eq!(
                align_of::<root::std::__is_integer>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::__is_integer)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout___is_integer_open0_wchar_t_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::__is_integer>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::__is_integer)
                )
            );
            assert_eq!(
                align_of::<root::std::__is_integer>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::__is_integer)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout___is_integer_open0_char16_t_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::__is_integer>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::__is_integer)
                )
            );
            assert_eq!(
                align_of::<root::std::__is_integer>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::__is_integer)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout___is_integer_open0_char32_t_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::__is_integer>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::__is_integer)
                )
            );
            assert_eq!(
                align_of::<root::std::__is_integer>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::__is_integer)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout___is_integer_open0_short_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::__is_integer>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::__is_integer)
                )
            );
            assert_eq!(
                align_of::<root::std::__is_integer>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::__is_integer)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout___is_integer_open0_unsigned_short_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::__is_integer>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::__is_integer)
                )
            );
            assert_eq!(
                align_of::<root::std::__is_integer>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::__is_integer)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout___is_integer_open0_int_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::__is_integer>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::__is_integer)
                )
            );
            assert_eq!(
                align_of::<root::std::__is_integer>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::__is_integer)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout___is_integer_open0_unsigned_int_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::__is_integer>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::__is_integer)
                )
            );
            assert_eq!(
                align_of::<root::std::__is_integer>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::__is_integer)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout___is_integer_open0_long_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::__is_integer>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::__is_integer)
                )
            );
            assert_eq!(
                align_of::<root::std::__is_integer>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::__is_integer)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout___is_integer_open0_unsigned_long_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::__is_integer>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::__is_integer)
                )
            );
            assert_eq!(
                align_of::<root::std::__is_integer>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::__is_integer)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout___is_integer_open0_long_long_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::__is_integer>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::__is_integer)
                )
            );
            assert_eq!(
                align_of::<root::std::__is_integer>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::__is_integer)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout___is_integer_open0_unsigned_long_long_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::__is_integer>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::__is_integer)
                )
            );
            assert_eq!(
                align_of::<root::std::__is_integer>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::__is_integer)
                )
            );
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __is_floating {
            pub _address: u8,
        }
        pub const __is_floating___value: self::std::__is_floating__bindgen_ty_1 = 0;
        pub type __is_floating__bindgen_ty_1 = i32;
        pub type __is_floating___type = self::std::__false_type;
        #[test]
        fn __bindgen_test_layout___is_floating_open0_float_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::__is_floating>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::__is_floating)
                )
            );
            assert_eq!(
                align_of::<root::std::__is_floating>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::__is_floating)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout___is_floating_open0_double_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::__is_floating>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::__is_floating)
                )
            );
            assert_eq!(
                align_of::<root::std::__is_floating>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::__is_floating)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout___is_floating_open0_long_double_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::__is_floating>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::__is_floating)
                )
            );
            assert_eq!(
                align_of::<root::std::__is_floating>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::__is_floating)
                )
            );
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __is_pointer {
            pub _address: u8,
        }
        pub const __is_pointer___value: self::std::__is_pointer__bindgen_ty_1 = 0;
        pub type __is_pointer__bindgen_ty_1 = i32;
        pub type __is_pointer___type = self::std::__false_type;
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __is_arithmetic {
            pub _address: u8,
        }
        impl Default for __is_arithmetic {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __is_scalar {
            pub _address: u8,
        }
        impl Default for __is_scalar {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __is_char {
            pub _address: u8,
        }
        pub const __is_char___value: self::std::__is_char__bindgen_ty_1 = 0;
        pub type __is_char__bindgen_ty_1 = i32;
        pub type __is_char___type = self::std::__false_type;
        #[test]
        fn __bindgen_test_layout___is_char_open0_char_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::__is_char>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::__is_char)
                )
            );
            assert_eq!(
                align_of::<root::std::__is_char>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::__is_char)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout___is_char_open0_wchar_t_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::__is_char>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::__is_char)
                )
            );
            assert_eq!(
                align_of::<root::std::__is_char>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::__is_char)
                )
            );
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __is_byte {
            pub _address: u8,
        }
        pub const __is_byte___value: self::std::__is_byte__bindgen_ty_1 = 0;
        pub type __is_byte__bindgen_ty_1 = i32;
        pub type __is_byte___type = self::std::__false_type;
        #[test]
        fn __bindgen_test_layout___is_byte_open0_char_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::__is_byte>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::__is_byte)
                )
            );
            assert_eq!(
                align_of::<root::std::__is_byte>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::__is_byte)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout___is_byte_open0_signed_char_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::__is_byte>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::__is_byte)
                )
            );
            assert_eq!(
                align_of::<root::std::__is_byte>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::__is_byte)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout___is_byte_open0_unsigned_char_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::__is_byte>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::__is_byte)
                )
            );
            assert_eq!(
                align_of::<root::std::__is_byte>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::__is_byte)
                )
            );
        }
        pub type byte = u8;
        #[test]
        fn __bindgen_test_layout___is_byte_open0_byte_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::__is_byte>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::__is_byte)
                )
            );
            assert_eq!(
                align_of::<root::std::__is_byte>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::__is_byte)
                )
            );
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __is_move_iterator {
            pub _address: u8,
        }
        pub const __is_move_iterator___value: self::std::__is_move_iterator__bindgen_ty_1 = 0;
        pub type __is_move_iterator__bindgen_ty_1 = i32;
        pub type __is_move_iterator___type = self::std::__false_type;
        pub type integral_constant_value_type<_Tp> = _Tp;
        pub type integral_constant_type = u8;
        extern "C" {
            pub static value: _Tp;
        }
        pub type true_type = u8;
        pub type false_type = u8;
        pub type __bool_constant = u8;
        pub type bool_constant = u8;
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __or_ {
            pub _address: u8,
        }
        #[test]
        fn __bindgen_test_layout___or__open0_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::__or_>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::__or_)
                )
            );
            assert_eq!(
                align_of::<root::std::__or_>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::__or_)
                )
            );
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __and_ {
            pub _address: u8,
        }
        #[test]
        fn __bindgen_test_layout___and__open0_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::__and_>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::__and_)
                )
            );
            assert_eq!(
                align_of::<root::std::__and_>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::__and_)
                )
            );
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __not_ {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct conjunction {
            pub _address: u8,
        }
        impl Default for conjunction {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct disjunction {
            pub _address: u8,
        }
        impl Default for disjunction {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct negation {
            pub _address: u8,
        }
        impl Default for negation {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __success_type {
            pub _address: u8,
        }
        pub type __success_type_type<_Tp> = _Tp;
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __failure_type {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout___failure_type() {
            assert_eq!(
                size_of::<__failure_type>(),
                1usize,
                concat!("Size of: ", stringify!(__failure_type))
            );
            assert_eq!(
                align_of::<__failure_type>(),
                1usize,
                concat!("Alignment of ", stringify!(__failure_type))
            );
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __is_void_helper {
            pub _base: self::std::false_type,
        }
        #[test]
        fn __bindgen_test_layout___is_void_helper_open0_void_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::__is_void_helper>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::__is_void_helper)
                )
            );
            assert_eq!(
                align_of::<root::std::__is_void_helper>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::__is_void_helper)
                )
            );
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct is_void {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __is_integral_helper {
            pub _base: self::std::false_type,
        }
        #[test]
        fn __bindgen_test_layout___is_integral_helper_open0_bool__close0_instantiation() {
            assert_eq!(
                size_of::<root::std::__is_integral_helper>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::__is_integral_helper)
                )
            );
            assert_eq!(
                align_of::<root::std::__is_integral_helper>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::__is_integral_helper)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout___is_integral_helper_open0_char_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::__is_integral_helper>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::__is_integral_helper)
                )
            );
            assert_eq!(
                align_of::<root::std::__is_integral_helper>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::__is_integral_helper)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout___is_integral_helper_open0_signed_char_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::__is_integral_helper>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::__is_integral_helper)
                )
            );
            assert_eq!(
                align_of::<root::std::__is_integral_helper>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::__is_integral_helper)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout___is_integral_helper_open0_unsigned_char_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::__is_integral_helper>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::__is_integral_helper)
                )
            );
            assert_eq!(
                align_of::<root::std::__is_integral_helper>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::__is_integral_helper)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout___is_integral_helper_open0_wchar_t_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::__is_integral_helper>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::__is_integral_helper)
                )
            );
            assert_eq!(
                align_of::<root::std::__is_integral_helper>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::__is_integral_helper)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout___is_integral_helper_open0_char16_t_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::__is_integral_helper>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::__is_integral_helper)
                )
            );
            assert_eq!(
                align_of::<root::std::__is_integral_helper>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::__is_integral_helper)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout___is_integral_helper_open0_char32_t_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::__is_integral_helper>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::__is_integral_helper)
                )
            );
            assert_eq!(
                align_of::<root::std::__is_integral_helper>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::__is_integral_helper)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout___is_integral_helper_open0_short_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::__is_integral_helper>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::__is_integral_helper)
                )
            );
            assert_eq!(
                align_of::<root::std::__is_integral_helper>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::__is_integral_helper)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout___is_integral_helper_open0_unsigned_short_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::__is_integral_helper>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::__is_integral_helper)
                )
            );
            assert_eq!(
                align_of::<root::std::__is_integral_helper>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::__is_integral_helper)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout___is_integral_helper_open0_int_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::__is_integral_helper>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::__is_integral_helper)
                )
            );
            assert_eq!(
                align_of::<root::std::__is_integral_helper>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::__is_integral_helper)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout___is_integral_helper_open0_unsigned_int_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::__is_integral_helper>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::__is_integral_helper)
                )
            );
            assert_eq!(
                align_of::<root::std::__is_integral_helper>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::__is_integral_helper)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout___is_integral_helper_open0_long_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::__is_integral_helper>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::__is_integral_helper)
                )
            );
            assert_eq!(
                align_of::<root::std::__is_integral_helper>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::__is_integral_helper)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout___is_integral_helper_open0_unsigned_long_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::__is_integral_helper>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::__is_integral_helper)
                )
            );
            assert_eq!(
                align_of::<root::std::__is_integral_helper>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::__is_integral_helper)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout___is_integral_helper_open0_long_long_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::__is_integral_helper>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::__is_integral_helper)
                )
            );
            assert_eq!(
                align_of::<root::std::__is_integral_helper>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::__is_integral_helper)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout___is_integral_helper_open0_unsigned_long_long_close0_instantiation(
        ) {
            assert_eq!(
                size_of::<root::std::__is_integral_helper>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::__is_integral_helper)
                )
            );
            assert_eq!(
                align_of::<root::std::__is_integral_helper>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::__is_integral_helper)
                )
            );
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct is_integral {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __is_floating_point_helper {
            pub _base: self::std::false_type,
        }
        #[test]
        fn __bindgen_test_layout___is_floating_point_helper_open0_float_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::__is_floating_point_helper>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::__is_floating_point_helper)
                )
            );
            assert_eq!(
                align_of::<root::std::__is_floating_point_helper>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::__is_floating_point_helper)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout___is_floating_point_helper_open0_double_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::__is_floating_point_helper>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::__is_floating_point_helper)
                )
            );
            assert_eq!(
                align_of::<root::std::__is_floating_point_helper>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::__is_floating_point_helper)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout___is_floating_point_helper_open0_long_double_close0_instantiation()
        {
            assert_eq!(
                size_of::<root::std::__is_floating_point_helper>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::__is_floating_point_helper)
                )
            );
            assert_eq!(
                align_of::<root::std::__is_floating_point_helper>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::__is_floating_point_helper)
                )
            );
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct is_floating_point {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct is_array {
            pub _base: self::std::false_type,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __is_pointer_helper {
            pub _base: self::std::false_type,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct is_pointer {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct is_lvalue_reference {
            pub _base: self::std::false_type,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct is_rvalue_reference {
            pub _base: self::std::false_type,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __is_member_object_pointer_helper {
            pub _base: self::std::false_type,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct is_member_object_pointer {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __is_member_function_pointer_helper {
            pub _base: self::std::false_type,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct is_member_function_pointer {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct is_enum {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct is_union {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct is_class {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct is_function {
            pub _base: self::std::false_type,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __is_null_pointer_helper {
            pub _base: self::std::false_type,
        }
        #[test]
        fn __bindgen_test_layout___is_null_pointer_helper_open0_nullptr_t_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::__is_null_pointer_helper>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::__is_null_pointer_helper)
                )
            );
            assert_eq!(
                align_of::<root::std::__is_null_pointer_helper>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::__is_null_pointer_helper)
                )
            );
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct is_null_pointer {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __is_nullptr_t {
            pub _address: u8,
        }
        impl Default for __is_nullptr_t {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct is_reference {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct is_arithmetic {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct is_fundamental {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct is_object {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct is_scalar {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct is_compound {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __is_member_pointer_helper {
            pub _base: self::std::false_type,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct is_member_pointer {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __is_referenceable {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct is_const {
            pub _base: self::std::false_type,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct is_volatile {
            pub _base: self::std::false_type,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct is_trivial {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct is_trivially_copyable {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct is_standard_layout {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct is_pod {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct is_literal_type {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct is_empty {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct is_polymorphic {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct is_final {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct is_abstract {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct is_signed {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct is_unsigned {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __is_array_known_bounds {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __is_array_unknown_bounds {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __do_is_destructible_impl {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout___do_is_destructible_impl() {
            assert_eq!(
                size_of::<__do_is_destructible_impl>(),
                1usize,
                concat!("Size of: ", stringify!(__do_is_destructible_impl))
            );
            assert_eq!(
                align_of::<__do_is_destructible_impl>(),
                1usize,
                concat!("Alignment of ", stringify!(__do_is_destructible_impl))
            );
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __is_destructible_impl {
            pub _address: u8,
        }
        pub type __is_destructible_impl_type<_Tp> = _Tp;
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct is_destructible {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __do_is_nt_destructible_impl {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout___do_is_nt_destructible_impl() {
            assert_eq!(
                size_of::<__do_is_nt_destructible_impl>(),
                1usize,
                concat!("Size of: ", stringify!(__do_is_nt_destructible_impl))
            );
            assert_eq!(
                align_of::<__do_is_nt_destructible_impl>(),
                1usize,
                concat!("Alignment of ", stringify!(__do_is_nt_destructible_impl))
            );
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __is_nt_destructible_impl {
            pub _address: u8,
        }
        pub type __is_nt_destructible_impl_type<_Tp> = _Tp;
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct is_nothrow_destructible {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __do_is_default_constructible_impl {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout___do_is_default_constructible_impl() {
            assert_eq!(
                size_of::<__do_is_default_constructible_impl>(),
                1usize,
                concat!("Size of: ", stringify!(__do_is_default_constructible_impl))
            );
            assert_eq!(
                align_of::<__do_is_default_constructible_impl>(),
                1usize,
                concat!(
                    "Alignment of ",
                    stringify!(__do_is_default_constructible_impl)
                )
            );
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __is_default_constructible_impl {
            pub _address: u8,
        }
        pub type __is_default_constructible_impl_type<_Tp> = _Tp;
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __is_default_constructible_atom {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct is_default_constructible {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct is_constructible {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct is_copy_constructible {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct is_move_constructible {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __is_nt_default_constructible_atom {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct is_nothrow_default_constructible {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __is_nt_constructible_impl {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct is_nothrow_constructible {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct is_nothrow_copy_constructible {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct is_nothrow_move_constructible {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct is_assignable {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct is_copy_assignable {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct is_move_assignable {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __is_nt_assignable_impl {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct is_nothrow_assignable {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct is_nothrow_copy_assignable {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct is_nothrow_move_assignable {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct is_trivially_constructible {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct is_trivially_default_constructible {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __do_is_implicitly_default_constructible_impl {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout___do_is_implicitly_default_constructible_impl() {
            assert_eq!(
                size_of::<__do_is_implicitly_default_constructible_impl>(),
                1usize,
                concat!(
                    "Size of: ",
                    stringify!(__do_is_implicitly_default_constructible_impl)
                )
            );
            assert_eq!(
                align_of::<__do_is_implicitly_default_constructible_impl>(),
                1usize,
                concat!(
                    "Alignment of ",
                    stringify!(__do_is_implicitly_default_constructible_impl)
                )
            );
        }
        extern "C" {
            #[link_name = "\u{1}__test"]
            pub fn __do_is_implicitly_default_constructible_impl___test() -> self::std::false_type;
        }
        impl __do_is_implicitly_default_constructible_impl {
            #[inline]
            pub unsafe fn __test() -> self::std::false_type {
                __do_is_implicitly_default_constructible_impl___test()
            }
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __is_implicitly_default_constructible_impl {
            pub _address: u8,
        }
        pub type __is_implicitly_default_constructible_impl_type<_Tp> = _Tp;
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __is_implicitly_default_constructible_safe {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __is_implicitly_default_constructible {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct is_trivially_copy_constructible {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct is_trivially_move_constructible {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct is_trivially_assignable {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct is_trivially_copy_assignable {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct is_trivially_move_assignable {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct is_trivially_destructible {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct has_virtual_destructor {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct alignment_of {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct rank {
            pub _base: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct is_same {
            pub _base: self::std::false_type,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct is_base_of {
            pub _address: u8,
        }
        pub type __is_convertible_helper_type = self::std::is_void;
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct is_convertible {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct remove_const {
            pub _address: u8,
        }
        pub type remove_const_type<_Tp> = _Tp;
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct remove_volatile {
            pub _address: u8,
        }
        pub type remove_volatile_type<_Tp> = _Tp;
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct remove_cv {
            pub _address: u8,
        }
        pub type remove_cv_type = self::std::remove_const;
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct add_const {
            pub _address: u8,
        }
        pub type add_const_type<_Tp> = _Tp;
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct add_volatile {
            pub _address: u8,
        }
        pub type add_volatile_type<_Tp> = _Tp;
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct add_cv {
            pub _address: u8,
        }
        pub type add_cv_type = self::std::add_const;
        pub type remove_const_t = self::std::remove_const;
        pub type remove_volatile_t = self::std::remove_volatile;
        pub type remove_cv_t = self::std::remove_cv;
        pub type add_const_t = self::std::add_const;
        pub type add_volatile_t = self::std::add_volatile;
        pub type add_cv_t = self::std::add_cv;
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct remove_reference {
            pub _address: u8,
        }
        pub type remove_reference_type<_Tp> = _Tp;
        pub type __add_lvalue_reference_helper_type<_Tp> = _Tp;
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct add_lvalue_reference {
            pub _address: u8,
        }
        pub type __add_rvalue_reference_helper_type<_Tp> = _Tp;
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct add_rvalue_reference {
            pub _address: u8,
        }
        pub type remove_reference_t = self::std::remove_reference;
        pub type add_lvalue_reference_t = self::std::add_lvalue_reference;
        pub type add_rvalue_reference_t = self::std::add_rvalue_reference;
        pub type __match_cv_qualifiers___match = u8;
        pub type __match_cv_qualifiers___type = self::std::__match_cv_qualifiers___match;
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __make_unsigned {
            pub _address: u8,
        }
        pub type __make_unsigned___type<_Tp> = _Tp;
        #[test]
        fn __bindgen_test_layout___make_unsigned_open0_char_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::__make_unsigned>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::__make_unsigned)
                )
            );
            assert_eq!(
                align_of::<root::std::__make_unsigned>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::__make_unsigned)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout___make_unsigned_open0_signed_char_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::__make_unsigned>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::__make_unsigned)
                )
            );
            assert_eq!(
                align_of::<root::std::__make_unsigned>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::__make_unsigned)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout___make_unsigned_open0_short_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::__make_unsigned>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::__make_unsigned)
                )
            );
            assert_eq!(
                align_of::<root::std::__make_unsigned>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::__make_unsigned)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout___make_unsigned_open0_int_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::__make_unsigned>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::__make_unsigned)
                )
            );
            assert_eq!(
                align_of::<root::std::__make_unsigned>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::__make_unsigned)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout___make_unsigned_open0_long_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::__make_unsigned>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::__make_unsigned)
                )
            );
            assert_eq!(
                align_of::<root::std::__make_unsigned>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::__make_unsigned)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout___make_unsigned_open0_long_long_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::__make_unsigned>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::__make_unsigned)
                )
            );
            assert_eq!(
                align_of::<root::std::__make_unsigned>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::__make_unsigned)
                )
            );
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct make_unsigned {
            pub _address: u8,
        }
        pub type make_unsigned_type = u8;
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __make_signed {
            pub _address: u8,
        }
        pub type __make_signed___type<_Tp> = _Tp;
        #[test]
        fn __bindgen_test_layout___make_signed_open0_char_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::__make_signed>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::__make_signed)
                )
            );
            assert_eq!(
                align_of::<root::std::__make_signed>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::__make_signed)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout___make_signed_open0_unsigned_char_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::__make_signed>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::__make_signed)
                )
            );
            assert_eq!(
                align_of::<root::std::__make_signed>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::__make_signed)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout___make_signed_open0_unsigned_short_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::__make_signed>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::__make_signed)
                )
            );
            assert_eq!(
                align_of::<root::std::__make_signed>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::__make_signed)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout___make_signed_open0_unsigned_int_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::__make_signed>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::__make_signed)
                )
            );
            assert_eq!(
                align_of::<root::std::__make_signed>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::__make_signed)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout___make_signed_open0_unsigned_long_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::__make_signed>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::__make_signed)
                )
            );
            assert_eq!(
                align_of::<root::std::__make_signed>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::__make_signed)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout___make_signed_open0_unsigned_long_long_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::__make_signed>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::__make_signed)
                )
            );
            assert_eq!(
                align_of::<root::std::__make_signed>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::__make_signed)
                )
            );
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct make_signed {
            pub _address: u8,
        }
        pub type make_signed_type = u8;
        pub type make_signed_t = self::std::make_signed;
        pub type make_unsigned_t = self::std::make_unsigned;
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct remove_extent {
            pub _address: u8,
        }
        pub type remove_extent_type<_Tp> = _Tp;
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct remove_all_extents {
            pub _address: u8,
        }
        pub type remove_all_extents_type<_Tp> = _Tp;
        pub type remove_extent_t = self::std::remove_extent;
        pub type remove_all_extents_t = self::std::remove_all_extents;
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __remove_pointer_helper {
            pub _address: u8,
        }
        pub type __remove_pointer_helper_type<_Tp> = _Tp;
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct remove_pointer {
            pub _address: u8,
        }
        impl Default for remove_pointer {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        pub type __add_pointer_helper_type<_Tp> = _Tp;
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct add_pointer {
            pub _address: u8,
        }
        pub type remove_pointer_t = self::std::remove_pointer;
        pub type add_pointer_t = self::std::add_pointer;
        #[repr(C)]
        #[derive(Copy, Clone)]
        pub union __aligned_storage_msa___type {
            pub __data: *mut c_uchar,
            pub __align: self::std::__aligned_storage_msa___type__bindgen_ty_1,
            _bindgen_union_align: u64,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __aligned_storage_msa___type__bindgen_ty_1 {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout___aligned_storage_msa___type() {
            assert_eq!(
                size_of::<__aligned_storage_msa___type>(),
                8usize,
                concat!("Size of: ", stringify!(__aligned_storage_msa___type))
            );
            assert_eq!(
                align_of::<__aligned_storage_msa___type>(),
                8usize,
                concat!("Alignment of ", stringify!(__aligned_storage_msa___type))
            );
        }
        impl Default for __aligned_storage_msa___type {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        impl ::std::fmt::Debug for __aligned_storage_msa___type {
            fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
                write!(f, "__aligned_storage_msa___type {{ union }}")
            }
        }
        #[repr(C)]
        #[derive(Copy, Clone)]
        pub union aligned_storage_type {
            pub __data: *mut c_uchar,
            pub __align: self::std::aligned_storage_type__bindgen_ty_1,
            _bindgen_union_align: u64,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct aligned_storage_type__bindgen_ty_1 {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout_aligned_storage_type() {
            assert_eq!(
                size_of::<aligned_storage_type>(),
                8usize,
                concat!("Size of: ", stringify!(aligned_storage_type))
            );
            assert_eq!(
                align_of::<aligned_storage_type>(),
                8usize,
                concat!("Alignment of ", stringify!(aligned_storage_type))
            );
        }
        impl Default for aligned_storage_type {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        impl ::std::fmt::Debug for aligned_storage_type {
            fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
                write!(f, "aligned_storage_type {{ union }}")
            }
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __strictest_alignment {
            pub _address: u8,
        }
        pub type aligned_union___strictest = self::std::__strictest_alignment;
        pub type aligned_union_type = u8;
        extern "C" {
            pub static alignment_value: usize;
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct decay {
            pub _address: u8,
        }
        pub type decay___remove_type = self::std::remove_reference;
        pub type decay_type = u8;
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct reference_wrapper {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __strip_reference_wrapper {
            pub _address: u8,
        }
        pub type __strip_reference_wrapper___type<_Tp> = _Tp;
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __decay_and_strip {
            pub _address: u8,
        }
        pub type __decay_and_strip___type = self::std::__strip_reference_wrapper;
        pub type _Require = u8;
        pub type conditional_type<_Iftrue> = _Iftrue;
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct common_type {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __do_common_type_impl {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout___do_common_type_impl() {
            assert_eq!(
                size_of::<__do_common_type_impl>(),
                1usize,
                concat!("Size of: ", stringify!(__do_common_type_impl))
            );
            assert_eq!(
                align_of::<__do_common_type_impl>(),
                1usize,
                concat!("Alignment of ", stringify!(__do_common_type_impl))
            );
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __common_type_impl {
            pub _address: u8,
        }
        pub type __common_type_impl_type<_Tp> = _Tp;
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __do_member_type_wrapper {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout___do_member_type_wrapper() {
            assert_eq!(
                size_of::<__do_member_type_wrapper>(),
                1usize,
                concat!("Size of: ", stringify!(__do_member_type_wrapper))
            );
            assert_eq!(
                align_of::<__do_member_type_wrapper>(),
                1usize,
                concat!("Alignment of ", stringify!(__do_member_type_wrapper))
            );
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __member_type_wrapper {
            pub _address: u8,
        }
        pub type __member_type_wrapper_type<_Tp> = _Tp;
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __expanded_common_type_wrapper {
            pub _address: u8,
        }
        pub type __expanded_common_type_wrapper_type = self::std::common_type;
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct underlying_type {
            pub _address: u8,
        }
        pub type underlying_type_type<_Tp> = _Tp;
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __declval_protector {
            pub _address: u8,
        }
        #[test]
        fn __bindgen_test_layout___make_unsigned_open0_wchar_t_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::__make_unsigned>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::__make_unsigned)
                )
            );
            assert_eq!(
                align_of::<root::std::__make_unsigned>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::__make_unsigned)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout___make_signed_open0_wchar_t_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::__make_signed>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::__make_signed)
                )
            );
            assert_eq!(
                align_of::<root::std::__make_signed>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::__make_signed)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout___make_unsigned_open0_char16_t_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::__make_unsigned>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::__make_unsigned)
                )
            );
            assert_eq!(
                align_of::<root::std::__make_unsigned>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::__make_unsigned)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout___make_signed_open0_char16_t_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::__make_signed>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::__make_signed)
                )
            );
            assert_eq!(
                align_of::<root::std::__make_signed>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::__make_signed)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout___make_unsigned_open0_char32_t_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::__make_unsigned>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::__make_unsigned)
                )
            );
            assert_eq!(
                align_of::<root::std::__make_unsigned>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::__make_unsigned)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout___make_signed_open0_char32_t_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::__make_signed>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::__make_signed)
                )
            );
            assert_eq!(
                align_of::<root::std::__make_signed>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::__make_signed)
                )
            );
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct result_of {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __invoke_memfun_ref {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout___invoke_memfun_ref() {
            assert_eq!(
                size_of::<__invoke_memfun_ref>(),
                1usize,
                concat!("Size of: ", stringify!(__invoke_memfun_ref))
            );
            assert_eq!(
                align_of::<__invoke_memfun_ref>(),
                1usize,
                concat!("Alignment of ", stringify!(__invoke_memfun_ref))
            );
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __invoke_memfun_deref {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout___invoke_memfun_deref() {
            assert_eq!(
                size_of::<__invoke_memfun_deref>(),
                1usize,
                concat!("Size of: ", stringify!(__invoke_memfun_deref))
            );
            assert_eq!(
                align_of::<__invoke_memfun_deref>(),
                1usize,
                concat!("Alignment of ", stringify!(__invoke_memfun_deref))
            );
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __invoke_memobj_ref {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout___invoke_memobj_ref() {
            assert_eq!(
                size_of::<__invoke_memobj_ref>(),
                1usize,
                concat!("Size of: ", stringify!(__invoke_memobj_ref))
            );
            assert_eq!(
                align_of::<__invoke_memobj_ref>(),
                1usize,
                concat!("Alignment of ", stringify!(__invoke_memobj_ref))
            );
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __invoke_memobj_deref {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout___invoke_memobj_deref() {
            assert_eq!(
                size_of::<__invoke_memobj_deref>(),
                1usize,
                concat!("Size of: ", stringify!(__invoke_memobj_deref))
            );
            assert_eq!(
                align_of::<__invoke_memobj_deref>(),
                1usize,
                concat!("Alignment of ", stringify!(__invoke_memobj_deref))
            );
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __invoke_other {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout___invoke_other() {
            assert_eq!(
                size_of::<__invoke_other>(),
                1usize,
                concat!("Size of: ", stringify!(__invoke_other))
            );
            assert_eq!(
                align_of::<__invoke_other>(),
                1usize,
                concat!("Alignment of ", stringify!(__invoke_other))
            );
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __result_of_success {
            pub _address: u8,
        }
        pub type __result_of_success___invoke_type<_Tag> = _Tag;
        impl Default for __result_of_success {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __result_of_memfun_ref_impl {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout___result_of_memfun_ref_impl() {
            assert_eq!(
                size_of::<__result_of_memfun_ref_impl>(),
                1usize,
                concat!("Size of: ", stringify!(__result_of_memfun_ref_impl))
            );
            assert_eq!(
                align_of::<__result_of_memfun_ref_impl>(),
                1usize,
                concat!("Alignment of ", stringify!(__result_of_memfun_ref_impl))
            );
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __result_of_memfun_ref {
            pub _address: u8,
        }
        pub type __result_of_memfun_ref_type<_MemPtr> = _MemPtr;
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __result_of_memfun_deref_impl {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout___result_of_memfun_deref_impl() {
            assert_eq!(
                size_of::<__result_of_memfun_deref_impl>(),
                1usize,
                concat!("Size of: ", stringify!(__result_of_memfun_deref_impl))
            );
            assert_eq!(
                align_of::<__result_of_memfun_deref_impl>(),
                1usize,
                concat!("Alignment of ", stringify!(__result_of_memfun_deref_impl))
            );
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __result_of_memfun_deref {
            pub _address: u8,
        }
        pub type __result_of_memfun_deref_type<_MemPtr> = _MemPtr;
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __result_of_memobj_ref_impl {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout___result_of_memobj_ref_impl() {
            assert_eq!(
                size_of::<__result_of_memobj_ref_impl>(),
                1usize,
                concat!("Size of: ", stringify!(__result_of_memobj_ref_impl))
            );
            assert_eq!(
                align_of::<__result_of_memobj_ref_impl>(),
                1usize,
                concat!("Alignment of ", stringify!(__result_of_memobj_ref_impl))
            );
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __result_of_memobj_ref {
            pub _address: u8,
        }
        pub type __result_of_memobj_ref_type<_MemPtr> = _MemPtr;
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __result_of_memobj_deref_impl {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout___result_of_memobj_deref_impl() {
            assert_eq!(
                size_of::<__result_of_memobj_deref_impl>(),
                1usize,
                concat!("Size of: ", stringify!(__result_of_memobj_deref_impl))
            );
            assert_eq!(
                align_of::<__result_of_memobj_deref_impl>(),
                1usize,
                concat!("Alignment of ", stringify!(__result_of_memobj_deref_impl))
            );
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __result_of_memobj_deref {
            pub _address: u8,
        }
        pub type __result_of_memobj_deref_type<_MemPtr> = _MemPtr;
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __result_of_memobj {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __result_of_memfun {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __inv_unwrap {
            pub _address: u8,
        }
        pub type __inv_unwrap_type<_Tp> = _Tp;
        pub type __result_of_impl_type = self::std::__failure_type;
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __result_of_other_impl {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout___result_of_other_impl() {
            assert_eq!(
                size_of::<__result_of_other_impl>(),
                1usize,
                concat!("Size of: ", stringify!(__result_of_other_impl))
            );
            assert_eq!(
                align_of::<__result_of_other_impl>(),
                1usize,
                concat!("Alignment of ", stringify!(__result_of_other_impl))
            );
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __invoke_result {
            pub _address: u8,
        }
        pub type aligned_storage_t = u8;
        pub type aligned_union_t = u8;
        pub type decay_t = self::std::decay;
        pub type enable_if_t = u8;
        pub type conditional_t = u8;
        pub type common_type_t = self::std::common_type;
        pub type underlying_type_t = self::std::underlying_type;
        pub type result_of_t = self::std::result_of;
        pub type __enable_if_t = u8;
        pub type __void_t = c_void;
        pub type void_t = c_void;
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __detector {
            pub _address: u8,
        }
        pub type __detector_value_t = self::std::false_type;
        pub type __detector_type<_Default> = _Default;
        pub type __detected_or = self::std::__detector;
        pub type __detected_or_t = self::std::__detected_or;
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __is_tuple_like_impl {
            pub _base: self::std::false_type,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __is_tuple_like {
            pub _address: u8,
        }
        pub mod __swappable_details {

            #[repr(C)]
            #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
            pub struct __do_is_swappable_impl {
                pub _address: u8,
            }
            #[test]
            fn bindgen_test_layout___do_is_swappable_impl() {
                assert_eq!(
                    size_of::<__do_is_swappable_impl>(),
                    1usize,
                    concat!("Size of: ", stringify!(__do_is_swappable_impl))
                );
                assert_eq!(
                    align_of::<__do_is_swappable_impl>(),
                    1usize,
                    concat!("Alignment of ", stringify!(__do_is_swappable_impl))
                );
            }
            #[repr(C)]
            #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
            pub struct __do_is_nothrow_swappable_impl {
                pub _address: u8,
            }
            #[test]
            fn bindgen_test_layout___do_is_nothrow_swappable_impl() {
                assert_eq!(
                    size_of::<__do_is_nothrow_swappable_impl>(),
                    1usize,
                    concat!("Size of: ", stringify!(__do_is_nothrow_swappable_impl))
                );
                assert_eq!(
                    align_of::<__do_is_nothrow_swappable_impl>(),
                    1usize,
                    concat!("Alignment of ", stringify!(__do_is_nothrow_swappable_impl))
                );
            }
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __is_swappable_impl {
            pub _address: u8,
        }
        pub type __is_swappable_impl_type<_Tp> = _Tp;
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __is_nothrow_swappable_impl {
            pub _address: u8,
        }
        pub type __is_nothrow_swappable_impl_type<_Tp> = _Tp;
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __is_swappable {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __is_nothrow_swappable {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct is_swappable {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct is_nothrow_swappable {
            pub _address: u8,
        }
        pub mod __swappable_with_details {

            #[repr(C)]
            #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
            pub struct __do_is_swappable_with_impl {
                pub _address: u8,
            }
            #[test]
            fn bindgen_test_layout___do_is_swappable_with_impl() {
                assert_eq!(
                    size_of::<__do_is_swappable_with_impl>(),
                    1usize,
                    concat!("Size of: ", stringify!(__do_is_swappable_with_impl))
                );
                assert_eq!(
                    align_of::<__do_is_swappable_with_impl>(),
                    1usize,
                    concat!("Alignment of ", stringify!(__do_is_swappable_with_impl))
                );
            }
            #[repr(C)]
            #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
            pub struct __do_is_nothrow_swappable_with_impl {
                pub _address: u8,
            }
            #[test]
            fn bindgen_test_layout___do_is_nothrow_swappable_with_impl() {
                assert_eq!(
                    size_of::<__do_is_nothrow_swappable_with_impl>(),
                    1usize,
                    concat!("Size of: ", stringify!(__do_is_nothrow_swappable_with_impl))
                );
                assert_eq!(
                    align_of::<__do_is_nothrow_swappable_with_impl>(),
                    1usize,
                    concat!(
                        "Alignment of ",
                        stringify!(__do_is_nothrow_swappable_with_impl)
                    )
                );
            }
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __is_swappable_with_impl {
            pub _address: u8,
        }
        pub type __is_swappable_with_impl_type<_Tp> = _Tp;
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __is_nothrow_swappable_with_impl {
            pub _address: u8,
        }
        pub type __is_nothrow_swappable_with_impl_type<_Tp> = _Tp;
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct is_swappable_with {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct is_nothrow_swappable_with {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __is_invocable_impl {
            pub _base: self::std::false_type,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __is_invocable {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __call_is_nothrow {
            pub _address: u8,
        }
        pub type __call_is_nothrow_ = self::std::__call_is_nothrow;
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __is_nothrow_invocable {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __nonesuch {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout___nonesuch() {
            assert_eq!(
                size_of::<__nonesuch>(),
                1usize,
                concat!("Size of: ", stringify!(__nonesuch))
            );
            assert_eq!(
                align_of::<__nonesuch>(),
                1usize,
                concat!("Alignment of ", stringify!(__nonesuch))
            );
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct invoke_result {
            pub _address: u8,
        }
        impl Default for invoke_result {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        pub type invoke_result_t = self::std::invoke_result;
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct is_invocable {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct is_invocable_r {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct is_nothrow_invocable {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __is_nt_invocable_impl {
            pub _base: self::std::false_type,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct is_nothrow_invocable_r {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct has_unique_object_representations {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct is_aggregate {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __move_if_noexcept_cond {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct piecewise_construct_t {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout_piecewise_construct_t() {
            assert_eq!(
                size_of::<piecewise_construct_t>(),
                1usize,
                concat!("Size of: ", stringify!(piecewise_construct_t))
            );
            assert_eq!(
                align_of::<piecewise_construct_t>(),
                1usize,
                concat!("Alignment of ", stringify!(piecewise_construct_t))
            );
        }
        extern "C" {
            pub static piecewise_construct: self::std::piecewise_construct_t;
        }
        #[repr(C)]
        #[derive(Debug, Default, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __nonesuch_no_braces {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout___nonesuch_no_braces() {
            assert_eq!(
                size_of::<__nonesuch_no_braces>(),
                1usize,
                concat!("Size of: ", stringify!(__nonesuch_no_braces))
            );
            assert_eq!(
                align_of::<__nonesuch_no_braces>(),
                1usize,
                concat!("Alignment of ", stringify!(__nonesuch_no_braces))
            );
        }
        #[repr(C)]
        #[derive(Debug, Default, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __pair_base {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct pair<_T1, _T2> {
            pub first: _T1,
            pub second: _T2,
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_T1>>,
            pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<_T2>>,
        }
        pub type pair_first_type<_T1> = _T1;
        pub type pair_second_type<_T2> = _T2;
        pub type pair__PCCP = u8;
        pub type pair__PCCFP = u8;
        impl<_T1, _T2> Default for pair<_T1, _T2> {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct input_iterator_tag {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout_input_iterator_tag() {
            assert_eq!(
                size_of::<input_iterator_tag>(),
                1usize,
                concat!("Size of: ", stringify!(input_iterator_tag))
            );
            assert_eq!(
                align_of::<input_iterator_tag>(),
                1usize,
                concat!("Alignment of ", stringify!(input_iterator_tag))
            );
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct output_iterator_tag {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout_output_iterator_tag() {
            assert_eq!(
                size_of::<output_iterator_tag>(),
                1usize,
                concat!("Size of: ", stringify!(output_iterator_tag))
            );
            assert_eq!(
                align_of::<output_iterator_tag>(),
                1usize,
                concat!("Alignment of ", stringify!(output_iterator_tag))
            );
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct forward_iterator_tag {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout_forward_iterator_tag() {
            assert_eq!(
                size_of::<forward_iterator_tag>(),
                1usize,
                concat!("Size of: ", stringify!(forward_iterator_tag))
            );
            assert_eq!(
                align_of::<forward_iterator_tag>(),
                1usize,
                concat!("Alignment of ", stringify!(forward_iterator_tag))
            );
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct bidirectional_iterator_tag {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout_bidirectional_iterator_tag() {
            assert_eq!(
                size_of::<bidirectional_iterator_tag>(),
                1usize,
                concat!("Size of: ", stringify!(bidirectional_iterator_tag))
            );
            assert_eq!(
                align_of::<bidirectional_iterator_tag>(),
                1usize,
                concat!("Alignment of ", stringify!(bidirectional_iterator_tag))
            );
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct random_access_iterator_tag {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout_random_access_iterator_tag() {
            assert_eq!(
                size_of::<random_access_iterator_tag>(),
                1usize,
                concat!("Size of: ", stringify!(random_access_iterator_tag))
            );
            assert_eq!(
                align_of::<random_access_iterator_tag>(),
                1usize,
                concat!("Alignment of ", stringify!(random_access_iterator_tag))
            );
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct iterator {
            pub _address: u8,
        }
        pub type iterator_iterator_category<_Category> = _Category;
        pub type iterator_value_type<_Tp> = _Tp;
        pub type iterator_difference_type<_Distance> = _Distance;
        pub type iterator_pointer<_Pointer> = _Pointer;
        pub type iterator_reference<_Reference> = _Reference;
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __iterator_traits {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct iterator_traits {
            pub _address: u8,
        }
        pub type _RequireInputIter = u8;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __undefined {
            _unused: [u8; 0],
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __get_first_arg {
            pub _address: u8,
        }
        pub type __get_first_arg_type = self::std::__undefined;
        pub type __get_first_arg_t = self::std::__get_first_arg;
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __replace_first_arg {
            pub _address: u8,
        }
        pub type __replace_first_arg_t = self::std::__replace_first_arg;
        pub type __make_not_void = u8;
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct pointer_traits {
            pub _address: u8,
        }
        pub type pointer_traits___element_type = [u8; 0usize];
        pub type pointer_traits___difference_type = [u8; 0usize];
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct pointer_traits___rebind {
            pub _address: u8,
        }
        impl Default for pointer_traits___rebind {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        pub type pointer_traits_pointer<_Ptr> = _Ptr;
        pub type pointer_traits_element_type = self::std::__detected_or_t;
        pub type pointer_traits_difference_type = self::std::__detected_or_t;
        pub type pointer_traits_rebind = self::std::pointer_traits___rebind;
        pub type __ptr_rebind = self::std::pointer_traits;
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct reverse_iterator<_Iterator> {
            pub current: _Iterator,
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Iterator>>,
        }
        pub type reverse_iterator___traits_type = self::std::iterator_traits;
        pub type reverse_iterator_iterator_type<_Iterator> = _Iterator;
        pub type reverse_iterator_difference_type = self::std::reverse_iterator___traits_type;
        pub type reverse_iterator_pointer = self::std::reverse_iterator___traits_type;
        pub type reverse_iterator_reference = self::std::reverse_iterator___traits_type;
        impl<_Iterator> Default for reverse_iterator<_Iterator> {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct back_insert_iterator<_Container> {
            pub container: *mut _Container,
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Container>>,
        }
        pub type back_insert_iterator_container_type<_Container> = _Container;
        impl<_Container> Default for back_insert_iterator<_Container> {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct front_insert_iterator<_Container> {
            pub container: *mut _Container,
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Container>>,
        }
        pub type front_insert_iterator_container_type<_Container> = _Container;
        impl<_Container> Default for front_insert_iterator<_Container> {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        #[repr(C)]
        pub struct insert_iterator<_Container> {
            pub container: *mut _Container,
            pub iter: [u8; 0usize],
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Container>>,
        }
        pub type insert_iterator_container_type<_Container> = _Container;
        impl<_Container> Default for insert_iterator<_Container> {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        impl<_Container> ::std::fmt::Debug for insert_iterator<_Container> {
            fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
                write!(f, "insert_iterator {{ container: {:?} }}", self.container)
            }
        }
        impl<_Container> PartialEq for insert_iterator<_Container>
        where
            _Container: PartialEq,
        {
            fn eq(&self, other: &insert_iterator<_Container>) -> bool {
                self.container == other.container && self.iter == other.iter
            }
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct move_iterator<_Iterator> {
            pub _M_current: _Iterator,
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Iterator>>,
        }
        pub type move_iterator___traits_type = self::std::iterator_traits;
        pub type move_iterator___base_ref = self::std::move_iterator___traits_type;
        pub type move_iterator_iterator_type<_Iterator> = _Iterator;
        pub type move_iterator_iterator_category = self::std::move_iterator___traits_type;
        pub type move_iterator_value_type = self::std::move_iterator___traits_type;
        pub type move_iterator_difference_type = self::std::move_iterator___traits_type;
        pub type move_iterator_pointer<_Iterator> = _Iterator;
        pub type move_iterator_reference = u8;
        impl<_Iterator> Default for move_iterator<_Iterator> {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        pub type __iter_key_t = self::std::remove_const_t;
        pub type __iter_val_t = self::std::iterator_traits;
        pub type __iter_to_alloc_t =
            self::std::pair<root::std::add_const_t, self::std::__iter_val_t>;
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __lc_rai {
            pub _address: u8,
        }
        #[test]
        fn __bindgen_test_layout___lc_rai_open0_random_access_iterator_tag_random_access_iterator_tag_close0_instantiation(
        ) {
            assert_eq!(
                size_of::<root::std::__lc_rai>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::__lc_rai)
                )
            );
            assert_eq!(
                align_of::<root::std::__lc_rai>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::__lc_rai)
                )
            );
        }
        pub type streamoff = c_long;
        pub type streamsize = isize;
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct fpos<_StateT> {
            pub _M_off: self::std::streamoff,
            pub _M_state: _StateT,
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_StateT>>,
        }
        impl<_StateT> Default for fpos<_StateT> {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        pub type streampos = self::std::fpos<root::mbstate_t>;
        pub type wstreampos = self::std::fpos<root::mbstate_t>;
        pub type u16streampos = self::std::fpos<root::mbstate_t>;
        pub type u32streampos = self::std::fpos<root::mbstate_t>;
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct char_traits {
            pub _address: u8,
        }
        impl Default for char_traits {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        #[test]
        fn __bindgen_test_layout_char_traits_open0_char_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::char_traits>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::char_traits)
                )
            );
            assert_eq!(
                align_of::<root::std::char_traits>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::char_traits)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_char_traits_open0_wchar_t_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::char_traits>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::char_traits)
                )
            );
            assert_eq!(
                align_of::<root::std::char_traits>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::char_traits)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_char_traits_open0_char16_t_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::char_traits>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::char_traits)
                )
            );
            assert_eq!(
                align_of::<root::std::char_traits>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::char_traits)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_char_traits_open0_char32_t_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::char_traits>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::char_traits)
                )
            );
            assert_eq!(
                align_of::<root::std::char_traits>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::char_traits)
                )
            );
        }
        #[repr(C)]
        pub struct exception__bindgen_vtable(c_void);
        #[repr(C)]
        #[derive(Debug, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct exception {
            pub vtable_: *const exception__bindgen_vtable,
        }
        #[test]
        fn bindgen_test_layout_exception() {
            assert_eq!(
                size_of::<exception>(),
                8usize,
                concat!("Size of: ", stringify!(exception))
            );
            assert_eq!(
                align_of::<exception>(),
                8usize,
                concat!("Alignment of ", stringify!(exception))
            );
        }
        impl Default for exception {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        extern "C" {
            #[link_name = "\u{1}exception_destructor"]
            pub fn exception_exception_destructor(this: *mut self::std::exception);
        }
        extern "C" {
            #[link_name = "\u{1}what"]
            pub fn exception_what(this: *mut c_void) -> *const c_char;
        }
        #[repr(C)]
        #[derive(Debug, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct bad_exception {
            pub _base: self::std::exception,
        }
        #[test]
        fn bindgen_test_layout_bad_exception() {
            assert_eq!(
                size_of::<bad_exception>(),
                8usize,
                concat!("Size of: ", stringify!(bad_exception))
            );
            assert_eq!(
                align_of::<bad_exception>(),
                8usize,
                concat!("Alignment of ", stringify!(bad_exception))
            );
        }
        impl Default for bad_exception {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        extern "C" {
            #[link_name = "\u{1}bad_exception_destructor"]
            pub fn bad_exception_bad_exception_destructor(this: *mut self::std::bad_exception);
        }
        extern "C" {
            #[link_name = "\u{1}what"]
            pub fn bad_exception_what(this: *mut c_void) -> *const c_char;
        }
        pub type terminate_handler = ::std::option::Option<unsafe extern "C" fn()>;
        pub type unexpected_handler = ::std::option::Option<unsafe extern "C" fn()>;
        extern "C" {
            pub fn set_terminate(
                arg1: self::std::terminate_handler,
            ) -> self::std::terminate_handler;
        }
        extern "C" {
            pub fn get_terminate() -> self::std::terminate_handler;
        }
        extern "C" {
            pub fn terminate();
        }
        extern "C" {
            pub fn set_unexpected(
                arg1: self::std::unexpected_handler,
            ) -> self::std::unexpected_handler;
        }
        extern "C" {
            pub fn get_unexpected() -> self::std::unexpected_handler;
        }
        extern "C" {
            pub fn unexpected();
        }
        extern "C" {
            pub fn uncaught_exception() -> bool;
        }
        extern "C" {
            pub fn uncaught_exceptions() -> c_int;
        }
        extern "C" {
            pub fn _Hash_bytes(__ptr: *const c_void, __len: usize, __seed: usize) -> usize;
        }
        extern "C" {
            pub fn _Fnv_hash_bytes(__ptr: *const c_void, __len: usize, __seed: usize) -> usize;
        }
        #[repr(C)]
        pub struct type_info__bindgen_vtable(c_void);
        #[repr(C)]
        #[derive(Debug, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct type_info {
            pub vtable_: *const type_info__bindgen_vtable,
            pub __name: *const c_char,
        }
        #[test]
        fn bindgen_test_layout_type_info() {
            assert_eq!(
                size_of::<type_info>(),
                16usize,
                concat!("Size of: ", stringify!(type_info))
            );
            assert_eq!(
                align_of::<type_info>(),
                8usize,
                concat!("Alignment of ", stringify!(type_info))
            );
            assert_eq!(
                unsafe { &(*(::std::ptr::null::<type_info>())).__name as *const _ as usize },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(type_info),
                    "::",
                    stringify!(__name)
                )
            );
        }
        impl Default for type_info {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        extern "C" {
            #[link_name = "\u{1}type_info_destructor"]
            pub fn type_info_type_info_destructor(this: *mut self::std::type_info);
        }
        extern "C" {
            #[link_name = "\u{1}__is_pointer_p"]
            pub fn type_info___is_pointer_p(this: *mut c_void) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}__is_function_p"]
            pub fn type_info___is_function_p(this: *mut c_void) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}__do_catch"]
            pub fn type_info___do_catch(
                this: *mut c_void,
                __thr_type: *const self::std::type_info,
                __thr_obj: *mut *mut c_void,
                __outer: c_uint,
            ) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}__do_upcast"]
            pub fn type_info___do_upcast(
                this: *mut c_void,
                __target: *const self::__cxxabiv1::__class_type_info,
                __obj_ptr: *mut *mut c_void,
            ) -> bool;
        }
        #[repr(C)]
        #[derive(Debug, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct bad_cast {
            pub _base: self::std::exception,
        }
        #[test]
        fn bindgen_test_layout_bad_cast() {
            assert_eq!(
                size_of::<bad_cast>(),
                8usize,
                concat!("Size of: ", stringify!(bad_cast))
            );
            assert_eq!(
                align_of::<bad_cast>(),
                8usize,
                concat!("Alignment of ", stringify!(bad_cast))
            );
        }
        impl Default for bad_cast {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        extern "C" {
            #[link_name = "\u{1}bad_cast_destructor"]
            pub fn bad_cast_bad_cast_destructor(this: *mut self::std::bad_cast);
        }
        extern "C" {
            #[link_name = "\u{1}what"]
            pub fn bad_cast_what(this: *mut c_void) -> *const c_char;
        }
        #[repr(C)]
        #[derive(Debug, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct bad_typeid {
            pub _base: self::std::exception,
        }
        #[test]
        fn bindgen_test_layout_bad_typeid() {
            assert_eq!(
                size_of::<bad_typeid>(),
                8usize,
                concat!("Size of: ", stringify!(bad_typeid))
            );
            assert_eq!(
                align_of::<bad_typeid>(),
                8usize,
                concat!("Alignment of ", stringify!(bad_typeid))
            );
        }
        impl Default for bad_typeid {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        extern "C" {
            #[link_name = "\u{1}bad_typeid_destructor"]
            pub fn bad_typeid_bad_typeid_destructor(this: *mut self::std::bad_typeid);
        }
        extern "C" {
            #[link_name = "\u{1}what"]
            pub fn bad_typeid_what(this: *mut c_void) -> *const c_char;
        }
        pub mod __exception_ptr {

            #[repr(C)]
            #[derive(Debug, Hash, PartialOrd, Ord, PartialEq, Eq)]
            pub struct exception_ptr {
                pub _M_exception_object: *mut c_void,
            }
            #[test]
            fn bindgen_test_layout_exception_ptr() {
                assert_eq!(
                    size_of::<exception_ptr>(),
                    8usize,
                    concat!("Size of: ", stringify!(exception_ptr))
                );
                assert_eq!(
                    align_of::<exception_ptr>(),
                    8usize,
                    concat!("Alignment of ", stringify!(exception_ptr))
                );
                assert_eq!(
                    unsafe {
                        &(*(::std::ptr::null::<exception_ptr>()))._M_exception_object as *const _
                            as usize
                    },
                    0usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(exception_ptr),
                        "::",
                        stringify!(_M_exception_object)
                    )
                );
            }
            extern "C" {
                #[link_name = "\u{1}swap"]
                pub fn exception_ptr_swap(
                    this: *mut self::std::__exception_ptr::exception_ptr,
                    arg1: *mut self::std::__exception_ptr::exception_ptr,
                );
            }
            extern "C" {
                #[link_name = "\u{1}__cxa_exception_type"]
                pub fn exception_ptr___cxa_exception_type(
                    this: *const self::std::__exception_ptr::exception_ptr,
                ) -> *const self::std::type_info;
            }
            extern "C" {
                #[link_name = "\u{1}exception_ptr"]
                pub fn exception_ptr_exception_ptr(
                    this: *mut self::std::__exception_ptr::exception_ptr,
                );
            }
            extern "C" {
                #[link_name = "\u{1}exception_ptr"]
                pub fn exception_ptr_exception_ptr1(
                    this: *mut self::std::__exception_ptr::exception_ptr,
                    arg1: *const self::std::__exception_ptr::exception_ptr,
                );
            }
            extern "C" {
                #[link_name = "\u{1}exception_ptr_destructor"]
                pub fn exception_ptr_exception_ptr_destructor(
                    this: *mut self::std::__exception_ptr::exception_ptr,
                );
            }
            impl Default for exception_ptr {
                fn default() -> Self {
                    unsafe { zeroed() }
                }
            }
            impl exception_ptr {
                #[inline]
                pub unsafe fn swap(
                    &mut self,
                    arg1: *mut self::std::__exception_ptr::exception_ptr,
                ) {
                    exception_ptr_swap(self, arg1)
                }
                #[inline]
                pub unsafe fn __cxa_exception_type(&self) -> *const self::std::type_info {
                    exception_ptr___cxa_exception_type(self)
                }
                #[inline]
                pub unsafe fn new() -> Self {
                    let mut __bindgen_tmp = uninitialized();
                    exception_ptr_exception_ptr(&mut __bindgen_tmp);
                    __bindgen_tmp
                }
                #[inline]
                pub unsafe fn new1(arg1: *const self::std::__exception_ptr::exception_ptr) -> Self {
                    let mut __bindgen_tmp = uninitialized();
                    exception_ptr_exception_ptr1(&mut __bindgen_tmp, arg1);
                    __bindgen_tmp
                }
                #[inline]
                pub unsafe fn destruct(&mut self) {
                    exception_ptr_exception_ptr_destructor(self)
                }
            }
        }
        extern "C" {
            pub fn current_exception() -> self::std::__exception_ptr::exception_ptr;
        }
        extern "C" {
            pub fn rethrow_exception(arg1: self::std::__exception_ptr::exception_ptr);
        }
        #[repr(C)]
        pub struct nested_exception__bindgen_vtable(c_void);
        #[repr(C)]
        #[derive(Debug, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct nested_exception {
            pub vtable_: *const nested_exception__bindgen_vtable,
            pub _M_ptr: self::std::__exception_ptr::exception_ptr,
        }
        #[test]
        fn bindgen_test_layout_nested_exception() {
            assert_eq!(
                size_of::<nested_exception>(),
                16usize,
                concat!("Size of: ", stringify!(nested_exception))
            );
            assert_eq!(
                align_of::<nested_exception>(),
                8usize,
                concat!("Alignment of ", stringify!(nested_exception))
            );
            assert_eq!(
                unsafe { &(*(::std::ptr::null::<nested_exception>()))._M_ptr as *const _ as usize },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(nested_exception),
                    "::",
                    stringify!(_M_ptr)
                )
            );
        }
        impl Default for nested_exception {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        extern "C" {
            #[link_name = "\u{1}nested_exception_destructor"]
            pub fn nested_exception_nested_exception_destructor(
                this: *mut self::std::nested_exception,
            );
        }
        #[repr(C)]
        #[derive(Debug, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct _Nested_exception<_Except> {
            pub _base: _Except,
            pub _base_1: self::std::nested_exception,
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Except>>,
        }
        impl<_Except> Default for _Nested_exception<_Except> {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        pub type __rethrow_if_nested_cond = u8;
        #[repr(C)]
        #[derive(Debug, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct bad_alloc {
            pub _base: self::std::exception,
        }
        #[test]
        fn bindgen_test_layout_bad_alloc() {
            assert_eq!(
                size_of::<bad_alloc>(),
                8usize,
                concat!("Size of: ", stringify!(bad_alloc))
            );
            assert_eq!(
                align_of::<bad_alloc>(),
                8usize,
                concat!("Alignment of ", stringify!(bad_alloc))
            );
        }
        impl Default for bad_alloc {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        extern "C" {
            #[link_name = "\u{1}bad_alloc_destructor"]
            pub fn bad_alloc_bad_alloc_destructor(this: *mut self::std::bad_alloc);
        }
        extern "C" {
            #[link_name = "\u{1}what"]
            pub fn bad_alloc_what(this: *mut c_void) -> *const c_char;
        }
        #[repr(C)]
        #[derive(Debug, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct bad_array_new_length {
            pub _base: self::std::bad_alloc,
        }
        #[test]
        fn bindgen_test_layout_bad_array_new_length() {
            assert_eq!(
                size_of::<bad_array_new_length>(),
                8usize,
                concat!("Size of: ", stringify!(bad_array_new_length))
            );
            assert_eq!(
                align_of::<bad_array_new_length>(),
                8usize,
                concat!("Alignment of ", stringify!(bad_array_new_length))
            );
        }
        impl Default for bad_array_new_length {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        extern "C" {
            #[link_name = "\u{1}bad_array_new_length_destructor"]
            pub fn bad_array_new_length_bad_array_new_length_destructor(
                this: *mut self::std::bad_array_new_length,
            );
        }
        extern "C" {
            #[link_name = "\u{1}what"]
            pub fn bad_array_new_length_what(this: *mut c_void) -> *const c_char;
        }
        pub type align_val_t = u64;
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct nothrow_t {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout_nothrow_t() {
            assert_eq!(
                size_of::<nothrow_t>(),
                1usize,
                concat!("Size of: ", stringify!(nothrow_t))
            );
            assert_eq!(
                align_of::<nothrow_t>(),
                1usize,
                concat!("Alignment of ", stringify!(nothrow_t))
            );
        }
        extern "C" {
            pub static nothrow: self::std::nothrow_t;
        }
        pub type new_handler = ::std::option::Option<unsafe extern "C" fn()>;
        extern "C" {
            pub fn set_new_handler(arg1: self::std::new_handler) -> self::std::new_handler;
        }
        extern "C" {
            pub fn get_new_handler() -> self::std::new_handler;
        }
        pub type __allocator_base = self::__gnu_cxx::new_allocator;
        #[test]
        fn __bindgen_test_layout_allocator_open0_void_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::allocator>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::allocator)
                )
            );
            assert_eq!(
                align_of::<root::std::allocator>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::allocator)
                )
            );
        }
        #[repr(C)]
        #[derive(Debug, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct allocator {
            pub _address: u8,
        }
        pub type allocator_size_type = usize;
        pub type allocator_difference_type = isize;
        pub type allocator_pointer<_Tp> = *mut _Tp;
        pub type allocator_const_pointer<_Tp> = *const _Tp;
        pub type allocator_reference<_Tp> = *mut _Tp;
        pub type allocator_const_reference<_Tp> = *const _Tp;
        pub type allocator_value_type<_Tp> = _Tp;
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct allocator_rebind {
            pub _address: u8,
        }
        pub type allocator_rebind_other = self::std::allocator;
        pub type allocator_propagate_on_container_move_assignment = self::std::true_type;
        pub type allocator_is_always_equal = self::std::true_type;
        impl Default for allocator {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        #[test]
        fn __bindgen_test_layout_allocator_open0_char_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::allocator>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::allocator)
                )
            );
            assert_eq!(
                align_of::<root::std::allocator>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::allocator)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_allocator_open0_wchar_t_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::allocator>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::allocator)
                )
            );
            assert_eq!(
                align_of::<root::std::allocator>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::allocator)
                )
            );
        }
        pub type __c_locale = self::__locale_t;
        pub type ios = self::std::basic_ios<c_char>;
        pub type streambuf = self::std::basic_streambuf<c_char>;
        pub type istream = self::std::basic_istream<c_char>;
        pub type ostream = self::std::basic_ostream<c_char>;
        pub type iostream = self::std::basic_iostream<c_char>;
        pub type stringbuf = self::std::__cxx11::basic_stringbuf<c_char>;
        pub type istringstream = self::std::__cxx11::basic_istringstream<c_char>;
        pub type ostringstream = self::std::__cxx11::basic_ostringstream<c_char>;
        pub type stringstream = self::std::__cxx11::basic_stringstream<c_char>;
        pub type filebuf = self::std::basic_filebuf<c_char>;
        pub type ifstream = self::std::basic_ifstream<c_char>;
        pub type ofstream = self::std::basic_ofstream<c_char>;
        pub type fstream = self::std::basic_fstream<c_char>;
        pub type wios = self::std::basic_ios<u32>;
        pub type wstreambuf = self::std::basic_streambuf<u32>;
        pub type wistream = self::std::basic_istream<u32>;
        pub type wostream = self::std::basic_ostream<u32>;
        pub type wiostream = self::std::basic_iostream<u32>;
        pub type wstringbuf = self::std::__cxx11::basic_stringbuf<u32>;
        pub type wistringstream = self::std::__cxx11::basic_istringstream<u32>;
        pub type wostringstream = self::std::__cxx11::basic_ostringstream<u32>;
        pub type wstringstream = self::std::__cxx11::basic_stringstream<u32>;
        pub type wfilebuf = self::std::basic_filebuf<u32>;
        pub type wifstream = self::std::basic_ifstream<u32>;
        pub type wofstream = self::std::basic_ofstream<u32>;
        pub type wfstream = self::std::basic_fstream<u32>;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct time_base {
            _unused: [u8; 0],
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct time_put {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct time_put_byname {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct money_base {
            _unused: [u8; 0],
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct messages_base {
            _unused: [u8; 0],
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct unary_function {
            pub _address: u8,
        }
        pub type unary_function_argument_type<_Arg> = _Arg;
        pub type unary_function_result_type<_Result> = _Result;
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct binary_function {
            pub _address: u8,
        }
        pub type binary_function_first_argument_type<_Arg1> = _Arg1;
        pub type binary_function_second_argument_type<_Arg2> = _Arg2;
        pub type binary_function_result_type<_Result> = _Result;
        #[repr(C)]
        #[derive(Debug, Copy, Clone)]
        pub struct __is_transparent {
            _unused: [u8; 0],
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct plus {
            pub _address: u8,
        }
        impl Default for plus {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct minus {
            pub _address: u8,
        }
        impl Default for minus {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct multiplies {
            pub _address: u8,
        }
        impl Default for multiplies {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct divides {
            pub _address: u8,
        }
        impl Default for divides {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct modulus {
            pub _address: u8,
        }
        impl Default for modulus {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct negate {
            pub _address: u8,
        }
        impl Default for negate {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        #[test]
        fn __bindgen_test_layout_plus_open0_void_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::plus>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::plus)
                )
            );
            assert_eq!(
                align_of::<root::std::plus>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::plus)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_minus_open0_void_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::minus>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::minus)
                )
            );
            assert_eq!(
                align_of::<root::std::minus>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::minus)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_multiplies_open0_void_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::multiplies>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::multiplies)
                )
            );
            assert_eq!(
                align_of::<root::std::multiplies>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::multiplies)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_divides_open0_void_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::divides>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::divides)
                )
            );
            assert_eq!(
                align_of::<root::std::divides>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::divides)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_modulus_open0_void_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::modulus>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::modulus)
                )
            );
            assert_eq!(
                align_of::<root::std::modulus>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::modulus)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_negate_open0_void_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::negate>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::negate)
                )
            );
            assert_eq!(
                align_of::<root::std::negate>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::negate)
                )
            );
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct equal_to {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct not_equal_to {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct greater {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct less {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct greater_equal {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct less_equal {
            pub _address: u8,
        }
        #[test]
        fn __bindgen_test_layout_equal_to_open0_void_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::equal_to>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::equal_to)
                )
            );
            assert_eq!(
                align_of::<root::std::equal_to>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::equal_to)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_not_equal_to_open0_void_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::not_equal_to>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::not_equal_to)
                )
            );
            assert_eq!(
                align_of::<root::std::not_equal_to>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::not_equal_to)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_greater_open0_void_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::greater>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::greater)
                )
            );
            assert_eq!(
                align_of::<root::std::greater>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::greater)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_less_open0_void_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::less>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::less)
                )
            );
            assert_eq!(
                align_of::<root::std::less>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::less)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_greater_equal_open0_void_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::greater_equal>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::greater_equal)
                )
            );
            assert_eq!(
                align_of::<root::std::greater_equal>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::greater_equal)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_less_equal_open0_void_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::less_equal>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::less_equal)
                )
            );
            assert_eq!(
                align_of::<root::std::less_equal>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::less_equal)
                )
            );
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct logical_and {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct logical_or {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct logical_not {
            pub _address: u8,
        }
        #[test]
        fn __bindgen_test_layout_logical_and_open0_void_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::logical_and>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::logical_and)
                )
            );
            assert_eq!(
                align_of::<root::std::logical_and>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::logical_and)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_logical_or_open0_void_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::logical_or>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::logical_or)
                )
            );
            assert_eq!(
                align_of::<root::std::logical_or>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::logical_or)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_logical_not_open0_void_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::logical_not>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::logical_not)
                )
            );
            assert_eq!(
                align_of::<root::std::logical_not>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::logical_not)
                )
            );
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct bit_and {
            pub _address: u8,
        }
        impl Default for bit_and {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct bit_or {
            pub _address: u8,
        }
        impl Default for bit_or {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct bit_xor {
            pub _address: u8,
        }
        impl Default for bit_xor {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct bit_not {
            pub _address: u8,
        }
        impl Default for bit_not {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        #[test]
        fn __bindgen_test_layout_bit_and_open0_void_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::bit_and>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::bit_and)
                )
            );
            assert_eq!(
                align_of::<root::std::bit_and>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::bit_and)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_bit_or_open0_void_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::bit_or>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::bit_or)
                )
            );
            assert_eq!(
                align_of::<root::std::bit_or>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::bit_or)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_bit_xor_open0_void_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::bit_xor>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::bit_xor)
                )
            );
            assert_eq!(
                align_of::<root::std::bit_xor>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::bit_xor)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_bit_not_open0_void_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::bit_not>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::bit_not)
                )
            );
            assert_eq!(
                align_of::<root::std::bit_not>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::bit_not)
                )
            );
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct unary_negate<_Predicate> {
            pub _M_pred: _Predicate,
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Predicate>>,
        }
        impl<_Predicate> Default for unary_negate<_Predicate> {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct binary_negate<_Predicate> {
            pub _M_pred: _Predicate,
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Predicate>>,
        }
        impl<_Predicate> Default for binary_negate<_Predicate> {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct pointer_to_unary_function<_Arg, _Result> {
            pub _M_ptr: ::std::option::Option<unsafe extern "C" fn(arg1: _Arg) -> _Result>,
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Arg>>,
            pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Result>>,
        }
        impl<_Arg, _Result> Default for pointer_to_unary_function<_Arg, _Result> {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct pointer_to_binary_function<_Arg1, _Arg2, _Result> {
            pub _M_ptr:
                ::std::option::Option<unsafe extern "C" fn(arg1: _Arg1, arg2: _Arg2) -> _Result>,
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Arg1>>,
            pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Arg2>>,
            pub _phantom_2: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Result>>,
        }
        impl<_Arg1, _Arg2, _Result> Default for pointer_to_binary_function<_Arg1, _Arg2, _Result> {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct _Identity {
            pub _address: u8,
        }
        impl Default for _Identity {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct _Select1st {
            pub _address: u8,
        }
        impl Default for _Select1st {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct _Select2nd {
            pub _address: u8,
        }
        impl Default for _Select2nd {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct mem_fun_t<_Ret> {
            pub _M_f: ::std::option::Option<unsafe extern "C" fn() -> _Ret>,
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Ret>>,
        }
        impl<_Ret> Default for mem_fun_t<_Ret> {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct const_mem_fun_t<_Ret> {
            pub _M_f: ::std::option::Option<unsafe extern "C" fn() -> _Ret>,
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Ret>>,
        }
        impl<_Ret> Default for const_mem_fun_t<_Ret> {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct mem_fun_ref_t<_Ret> {
            pub _M_f: ::std::option::Option<unsafe extern "C" fn() -> _Ret>,
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Ret>>,
        }
        impl<_Ret> Default for mem_fun_ref_t<_Ret> {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct const_mem_fun_ref_t<_Ret> {
            pub _M_f: ::std::option::Option<unsafe extern "C" fn() -> _Ret>,
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Ret>>,
        }
        impl<_Ret> Default for const_mem_fun_ref_t<_Ret> {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct mem_fun1_t<_Ret, _Arg> {
            pub _M_f: ::std::option::Option<unsafe extern "C" fn(arg1: _Arg) -> _Ret>,
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Ret>>,
            pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Arg>>,
        }
        impl<_Ret, _Arg> Default for mem_fun1_t<_Ret, _Arg> {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct const_mem_fun1_t<_Ret, _Arg> {
            pub _M_f: ::std::option::Option<unsafe extern "C" fn(arg1: _Arg) -> _Ret>,
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Ret>>,
            pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Arg>>,
        }
        impl<_Ret, _Arg> Default for const_mem_fun1_t<_Ret, _Arg> {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct mem_fun1_ref_t<_Ret, _Arg> {
            pub _M_f: ::std::option::Option<unsafe extern "C" fn(arg1: _Arg) -> _Ret>,
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Ret>>,
            pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Arg>>,
        }
        impl<_Ret, _Arg> Default for mem_fun1_ref_t<_Ret, _Arg> {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct const_mem_fun1_ref_t<_Ret, _Arg> {
            pub _M_f: ::std::option::Option<unsafe extern "C" fn(arg1: _Arg) -> _Ret>,
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Ret>>,
            pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Arg>>,
        }
        impl<_Ret, _Arg> Default for const_mem_fun1_ref_t<_Ret, _Arg> {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        #[repr(C)]
        pub struct binder1st<_Operation> {
            pub op: _Operation,
            pub value: [u8; 0usize],
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Operation>>,
        }
        impl<_Operation> Default for binder1st<_Operation> {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        impl<_Operation> ::std::fmt::Debug for binder1st<_Operation> {
            fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
                write!(f, "binder1st {{ op: Non-debuggable generic }}")
            }
        }
        impl<_Operation> PartialEq for binder1st<_Operation>
        where
            _Operation: PartialEq,
        {
            fn eq(&self, other: &binder1st<_Operation>) -> bool {
                self.op == other.op && self.value == other.value
            }
        }
        #[repr(C)]
        pub struct binder2nd<_Operation> {
            pub op: _Operation,
            pub value: [u8; 0usize],
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Operation>>,
        }
        impl<_Operation> Default for binder2nd<_Operation> {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        impl<_Operation> ::std::fmt::Debug for binder2nd<_Operation> {
            fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
                write!(f, "binder2nd {{ op: Non-debuggable generic }}")
            }
        }
        impl<_Operation> PartialEq for binder2nd<_Operation>
        where
            _Operation: PartialEq,
        {
            fn eq(&self, other: &binder2nd<_Operation>) -> bool {
                self.op == other.op && self.value == other.value
            }
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct initializer_list<_E> {
            pub _M_array: self::std::initializer_list_iterator<_E>,
            pub _M_len: self::std::initializer_list_size_type,
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_E>>,
        }
        pub type initializer_list_value_type<_E> = _E;
        pub type initializer_list_reference<_E> = *const _E;
        pub type initializer_list_const_reference<_E> = *const _E;
        pub type initializer_list_size_type = usize;
        pub type initializer_list_iterator<_E> = *const _E;
        pub type initializer_list_const_iterator<_E> = *const _E;
        impl<_E> Default for initializer_list<_E> {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct valarray {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __allocator_traits_base {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __allocator_traits_base___rebind {
            pub _address: u8,
        }
        impl Default for __allocator_traits_base___rebind {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        pub type __allocator_traits_base___pointer = [u8; 0usize];
        pub type __allocator_traits_base___c_pointer = [u8; 0usize];
        pub type __allocator_traits_base___v_pointer = [u8; 0usize];
        pub type __allocator_traits_base___cv_pointer = [u8; 0usize];
        pub type __allocator_traits_base___pocca = [u8; 0usize];
        pub type __allocator_traits_base___pocma = [u8; 0usize];
        pub type __allocator_traits_base___pocs = [u8; 0usize];
        pub type __allocator_traits_base___equal = [u8; 0usize];
        #[test]
        fn bindgen_test_layout___allocator_traits_base() {
            assert_eq!(
                size_of::<__allocator_traits_base>(),
                1usize,
                concat!("Size of: ", stringify!(__allocator_traits_base))
            );
            assert_eq!(
                align_of::<__allocator_traits_base>(),
                1usize,
                concat!("Alignment of ", stringify!(__allocator_traits_base))
            );
        }
        pub type __alloc_rebind = self::std::__allocator_traits_base;
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct allocator_traits {
            pub _address: u8,
        }
        pub type allocator_traits_allocator_type<_Alloc> = _Alloc;
        pub type allocator_traits_value_type = [u8; 0usize];
        pub type allocator_traits_pointer = self::std::__detected_or_t;
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct allocator_traits__Ptr {
            pub _address: u8,
        }
        pub type allocator_traits__Ptr_type = [u8; 0usize];
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct allocator_traits__Diff {
            pub _address: u8,
        }
        pub type allocator_traits__Diff_type = self::std::pointer_traits;
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct allocator_traits__Size {
            pub _address: u8,
        }
        impl Default for allocator_traits__Size {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        pub type allocator_traits_const_pointer = [u8; 0usize];
        pub type allocator_traits_void_pointer = self::std::allocator_traits__Ptr;
        pub type allocator_traits_const_void_pointer = self::std::allocator_traits__Ptr;
        pub type allocator_traits_difference_type = [u8; 0usize];
        pub type allocator_traits_size_type = [u8; 0usize];
        pub type allocator_traits_propagate_on_container_copy_assignment =
            self::std::__detected_or_t;
        pub type allocator_traits_propagate_on_container_move_assignment =
            self::std::__detected_or_t;
        pub type allocator_traits_propagate_on_container_swap = self::std::__detected_or_t;
        pub type allocator_traits_is_always_equal = self::std::__detected_or_t;
        pub type allocator_traits_rebind_alloc = self::std::__alloc_rebind;
        pub type allocator_traits_rebind_traits = self::std::allocator_traits;
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct allocator_traits___construct_helper {
            pub _address: u8,
        }
        pub type allocator_traits___construct_helper_type<_Alloc> = _Alloc;
        pub type allocator_traits___has_construct = self::std::allocator_traits___construct_helper;
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __is_copy_insertable_impl {
            pub _address: u8,
        }
        pub type __is_copy_insertable_impl__Traits = self::std::allocator_traits;
        pub type __is_copy_insertable_impl_type<_Alloc> = _Alloc;
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __is_copy_insertable {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __is_allocator {
            pub _base: self::std::false_type,
        }
        pub type _RequireAllocator = u8;
        pub const float_round_style_round_indeterminate: self::std::float_round_style = -1;
        pub const float_round_style_round_toward_zero: self::std::float_round_style = 0;
        pub const float_round_style_round_to_nearest: self::std::float_round_style = 1;
        pub const float_round_style_round_toward_infinity: self::std::float_round_style = 2;
        pub const float_round_style_round_toward_neg_infinity: self::std::float_round_style = 3;
        pub type float_round_style = i32;
        pub const float_denorm_style_denorm_indeterminate: self::std::float_denorm_style = -1;
        pub const float_denorm_style_denorm_absent: self::std::float_denorm_style = 0;
        pub const float_denorm_style_denorm_present: self::std::float_denorm_style = 1;
        pub type float_denorm_style = i32;
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __numeric_limits_base {
            pub _address: u8,
        }
        pub const __numeric_limits_base_is_specialized: bool = false;
        pub const __numeric_limits_base_digits: c_int = 0;
        pub const __numeric_limits_base_digits10: c_int = 0;
        pub const __numeric_limits_base_max_digits10: c_int = 0;
        pub const __numeric_limits_base_is_signed: bool = false;
        pub const __numeric_limits_base_is_integer: bool = false;
        pub const __numeric_limits_base_is_exact: bool = false;
        pub const __numeric_limits_base_radix: c_int = 0;
        pub const __numeric_limits_base_min_exponent: c_int = 0;
        pub const __numeric_limits_base_min_exponent10: c_int = 0;
        pub const __numeric_limits_base_max_exponent: c_int = 0;
        pub const __numeric_limits_base_max_exponent10: c_int = 0;
        pub const __numeric_limits_base_has_infinity: bool = false;
        pub const __numeric_limits_base_has_quiet_NaN: bool = false;
        pub const __numeric_limits_base_has_signaling_NaN: bool = false;
        extern "C" {
            #[link_name = "\u{1}has_denorm"]
            pub static __numeric_limits_base_has_denorm: self::std::float_denorm_style;
        }
        pub const __numeric_limits_base_has_denorm_loss: bool = false;
        pub const __numeric_limits_base_is_iec559: bool = false;
        pub const __numeric_limits_base_is_bounded: bool = false;
        pub const __numeric_limits_base_is_modulo: bool = false;
        pub const __numeric_limits_base_traps: bool = false;
        pub const __numeric_limits_base_tinyness_before: bool = false;
        extern "C" {
            #[link_name = "\u{1}round_style"]
            pub static __numeric_limits_base_round_style: self::std::float_round_style;
        }
        #[test]
        fn bindgen_test_layout___numeric_limits_base() {
            assert_eq!(
                size_of::<__numeric_limits_base>(),
                1usize,
                concat!("Size of: ", stringify!(__numeric_limits_base))
            );
            assert_eq!(
                align_of::<__numeric_limits_base>(),
                1usize,
                concat!("Alignment of ", stringify!(__numeric_limits_base))
            );
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct numeric_limits {
            pub _address: u8,
        }
        #[test]
        fn __bindgen_test_layout_numeric_limits_open0_bool__close0_instantiation() {
            assert_eq!(
                size_of::<root::std::numeric_limits>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::numeric_limits)
                )
            );
            assert_eq!(
                align_of::<root::std::numeric_limits>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::numeric_limits)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_numeric_limits_open0_char_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::numeric_limits>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::numeric_limits)
                )
            );
            assert_eq!(
                align_of::<root::std::numeric_limits>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::numeric_limits)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_numeric_limits_open0_signed_char_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::numeric_limits>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::numeric_limits)
                )
            );
            assert_eq!(
                align_of::<root::std::numeric_limits>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::numeric_limits)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_numeric_limits_open0_unsigned_char_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::numeric_limits>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::numeric_limits)
                )
            );
            assert_eq!(
                align_of::<root::std::numeric_limits>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::numeric_limits)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_numeric_limits_open0_wchar_t_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::numeric_limits>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::numeric_limits)
                )
            );
            assert_eq!(
                align_of::<root::std::numeric_limits>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::numeric_limits)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_numeric_limits_open0_char16_t_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::numeric_limits>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::numeric_limits)
                )
            );
            assert_eq!(
                align_of::<root::std::numeric_limits>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::numeric_limits)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_numeric_limits_open0_char32_t_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::numeric_limits>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::numeric_limits)
                )
            );
            assert_eq!(
                align_of::<root::std::numeric_limits>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::numeric_limits)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_numeric_limits_open0_short_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::numeric_limits>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::numeric_limits)
                )
            );
            assert_eq!(
                align_of::<root::std::numeric_limits>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::numeric_limits)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_numeric_limits_open0_unsigned_short_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::numeric_limits>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::numeric_limits)
                )
            );
            assert_eq!(
                align_of::<root::std::numeric_limits>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::numeric_limits)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_numeric_limits_open0_int_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::numeric_limits>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::numeric_limits)
                )
            );
            assert_eq!(
                align_of::<root::std::numeric_limits>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::numeric_limits)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_numeric_limits_open0_unsigned_int_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::numeric_limits>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::numeric_limits)
                )
            );
            assert_eq!(
                align_of::<root::std::numeric_limits>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::numeric_limits)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_numeric_limits_open0_long_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::numeric_limits>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::numeric_limits)
                )
            );
            assert_eq!(
                align_of::<root::std::numeric_limits>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::numeric_limits)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_numeric_limits_open0_unsigned_long_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::numeric_limits>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::numeric_limits)
                )
            );
            assert_eq!(
                align_of::<root::std::numeric_limits>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::numeric_limits)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_numeric_limits_open0_long_long_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::numeric_limits>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::numeric_limits)
                )
            );
            assert_eq!(
                align_of::<root::std::numeric_limits>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::numeric_limits)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_numeric_limits_open0_unsigned_long_long_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::numeric_limits>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::numeric_limits)
                )
            );
            assert_eq!(
                align_of::<root::std::numeric_limits>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::numeric_limits)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_numeric_limits_open0_float_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::numeric_limits>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::numeric_limits)
                )
            );
            assert_eq!(
                align_of::<root::std::numeric_limits>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::numeric_limits)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_numeric_limits_open0_double_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::numeric_limits>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::numeric_limits)
                )
            );
            assert_eq!(
                align_of::<root::std::numeric_limits>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::numeric_limits)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_numeric_limits_open0_long_double_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::numeric_limits>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::numeric_limits)
                )
            );
            assert_eq!(
                align_of::<root::std::numeric_limits>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::numeric_limits)
                )
            );
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __hash_base {
            pub _address: u8,
        }
        pub type __hash_base_result_type<_Result> = _Result;
        pub type __hash_base_argument_type<_Arg> = _Arg;
        #[repr(C)]
        #[derive(Debug, Default, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __poison_hash {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct hash {
            pub _address: u8,
        }
        #[test]
        fn __bindgen_test_layout_hash_open0_bool__close0_instantiation() {
            assert_eq!(
                size_of::<root::std::hash>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::hash)
                )
            );
            assert_eq!(
                align_of::<root::std::hash>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::hash)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_hash_open0_char_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::hash>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::hash)
                )
            );
            assert_eq!(
                align_of::<root::std::hash>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::hash)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_hash_open0_signed_char_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::hash>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::hash)
                )
            );
            assert_eq!(
                align_of::<root::std::hash>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::hash)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_hash_open0_unsigned_char_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::hash>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::hash)
                )
            );
            assert_eq!(
                align_of::<root::std::hash>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::hash)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_hash_open0_wchar_t_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::hash>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::hash)
                )
            );
            assert_eq!(
                align_of::<root::std::hash>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::hash)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_hash_open0_char16_t_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::hash>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::hash)
                )
            );
            assert_eq!(
                align_of::<root::std::hash>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::hash)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_hash_open0_char32_t_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::hash>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::hash)
                )
            );
            assert_eq!(
                align_of::<root::std::hash>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::hash)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_hash_open0_short_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::hash>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::hash)
                )
            );
            assert_eq!(
                align_of::<root::std::hash>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::hash)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_hash_open0_int_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::hash>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::hash)
                )
            );
            assert_eq!(
                align_of::<root::std::hash>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::hash)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_hash_open0_long_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::hash>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::hash)
                )
            );
            assert_eq!(
                align_of::<root::std::hash>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::hash)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_hash_open0_long_long_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::hash>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::hash)
                )
            );
            assert_eq!(
                align_of::<root::std::hash>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::hash)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_hash_open0_unsigned_short_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::hash>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::hash)
                )
            );
            assert_eq!(
                align_of::<root::std::hash>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::hash)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_hash_open0_unsigned_int_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::hash>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::hash)
                )
            );
            assert_eq!(
                align_of::<root::std::hash>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::hash)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_hash_open0_unsigned_long_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::hash>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::hash)
                )
            );
            assert_eq!(
                align_of::<root::std::hash>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::hash)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_hash_open0_unsigned_long_long_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::hash>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::hash)
                )
            );
            assert_eq!(
                align_of::<root::std::hash>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::hash)
                )
            );
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct _Hash_impl {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout__Hash_impl() {
            assert_eq!(
                size_of::<_Hash_impl>(),
                1usize,
                concat!("Size of: ", stringify!(_Hash_impl))
            );
            assert_eq!(
                align_of::<_Hash_impl>(),
                1usize,
                concat!("Alignment of ", stringify!(_Hash_impl))
            );
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct _Fnv_hash_impl {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout__Fnv_hash_impl() {
            assert_eq!(
                size_of::<_Fnv_hash_impl>(),
                1usize,
                concat!("Size of: ", stringify!(_Fnv_hash_impl))
            );
            assert_eq!(
                align_of::<_Fnv_hash_impl>(),
                1usize,
                concat!("Alignment of ", stringify!(_Fnv_hash_impl))
            );
        }
        #[test]
        fn __bindgen_test_layout_hash_open0_float_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::hash>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::hash)
                )
            );
            assert_eq!(
                align_of::<root::std::hash>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::hash)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_hash_open0_double_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::hash>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::hash)
                )
            );
            assert_eq!(
                align_of::<root::std::hash>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::hash)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_hash_open0_long_double_close0_instantiation() {
            assert_eq!(
                size_of::<root::std::hash>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::hash)
                )
            );
            assert_eq!(
                align_of::<root::std::hash>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::hash)
                )
            );
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __is_fast_hash {
            pub _base: self::std::true_type,
        }
        #[test]
        fn __bindgen_test_layout___is_fast_hash_open0_hash_open1_long_double_close1_close0_instantiation(
        ) {
            assert_eq!(
                size_of::<root::std::__is_fast_hash>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::__is_fast_hash)
                )
            );
            assert_eq!(
                align_of::<root::std::__is_fast_hash>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::__is_fast_hash)
                )
            );
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct basic_string_view<_CharT> {
            pub _M_len: usize,
            pub _M_str: *const _CharT,
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_CharT>>,
        }
        pub type basic_string_view_traits_type<_Traits> = _Traits;
        pub type basic_string_view_value_type<_CharT> = _CharT;
        pub type basic_string_view_pointer<_CharT> = *const _CharT;
        pub type basic_string_view_const_pointer<_CharT> = *const _CharT;
        pub type basic_string_view_reference<_CharT> = *const _CharT;
        pub type basic_string_view_const_reference<_CharT> = *const _CharT;
        pub type basic_string_view_const_iterator<_CharT> = *const _CharT;
        pub type basic_string_view_iterator<_CharT> =
            self::std::basic_string_view_const_iterator<_CharT>;
        pub type basic_string_view_const_reverse_iterator<_CharT> =
            self::std::reverse_iterator<root::std::basic_string_view_const_iterator<_CharT>>;
        pub type basic_string_view_reverse_iterator<_CharT> =
            self::std::basic_string_view_const_reverse_iterator<_CharT>;
        pub type basic_string_view_size_type = usize;
        pub type basic_string_view_difference_type = isize;
        impl<_CharT> Default for basic_string_view<_CharT> {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        pub mod __detail {

            pub type __idt = self::std::common_type_t;
            #[repr(C)]
            #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
            pub struct _List_node_base {
                pub _M_next: *mut self::std::__detail::_List_node_base,
                pub _M_prev: *mut self::std::__detail::_List_node_base,
            }
            #[test]
            fn bindgen_test_layout__List_node_base() {
                assert_eq!(
                    size_of::<_List_node_base>(),
                    16usize,
                    concat!("Size of: ", stringify!(_List_node_base))
                );
                assert_eq!(
                    align_of::<_List_node_base>(),
                    8usize,
                    concat!("Alignment of ", stringify!(_List_node_base))
                );
                assert_eq!(
                    unsafe {
                        &(*(::std::ptr::null::<_List_node_base>()))._M_next as *const _ as usize
                    },
                    0usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(_List_node_base),
                        "::",
                        stringify!(_M_next)
                    )
                );
                assert_eq!(
                    unsafe {
                        &(*(::std::ptr::null::<_List_node_base>()))._M_prev as *const _ as usize
                    },
                    8usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(_List_node_base),
                        "::",
                        stringify!(_M_prev)
                    )
                );
            }
            extern "C" {
                #[link_name = "\u{1}swap"]
                pub fn _List_node_base_swap(
                    __x: *mut self::std::__detail::_List_node_base,
                    __y: *mut self::std::__detail::_List_node_base,
                );
            }
            extern "C" {
                #[link_name = "\u{1}_M_transfer"]
                pub fn _List_node_base__M_transfer(
                    this: *mut self::std::__detail::_List_node_base,
                    __first: *mut self::std::__detail::_List_node_base,
                    __last: *mut self::std::__detail::_List_node_base,
                );
            }
            extern "C" {
                #[link_name = "\u{1}_M_reverse"]
                pub fn _List_node_base__M_reverse(this: *mut self::std::__detail::_List_node_base);
            }
            extern "C" {
                #[link_name = "\u{1}_M_hook"]
                pub fn _List_node_base__M_hook(
                    this: *mut self::std::__detail::_List_node_base,
                    __position: *mut self::std::__detail::_List_node_base,
                );
            }
            extern "C" {
                #[link_name = "\u{1}_M_unhook"]
                pub fn _List_node_base__M_unhook(this: *mut self::std::__detail::_List_node_base);
            }
            impl Default for _List_node_base {
                fn default() -> Self {
                    unsafe { zeroed() }
                }
            }
            impl _List_node_base {
                #[inline]
                pub unsafe fn swap(
                    __x: *mut self::std::__detail::_List_node_base,
                    __y: *mut self::std::__detail::_List_node_base,
                ) {
                    _List_node_base_swap(__x, __y)
                }
                #[inline]
                pub unsafe fn _M_transfer(
                    &mut self,
                    __first: *mut self::std::__detail::_List_node_base,
                    __last: *mut self::std::__detail::_List_node_base,
                ) {
                    _List_node_base__M_transfer(self, __first, __last)
                }
                #[inline]
                pub unsafe fn _M_reverse(&mut self) {
                    _List_node_base__M_reverse(self)
                }
                #[inline]
                pub unsafe fn _M_hook(
                    &mut self,
                    __position: *mut self::std::__detail::_List_node_base,
                ) {
                    _List_node_base__M_hook(self, __position)
                }
                #[inline]
                pub unsafe fn _M_unhook(&mut self) {
                    _List_node_base__M_unhook(self)
                }
            }
            #[repr(C)]
            #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
            pub struct _List_node_header {
                pub _base: self::std::__detail::_List_node_base,
                pub _M_size: usize,
            }
            #[test]
            fn bindgen_test_layout__List_node_header() {
                assert_eq!(
                    size_of::<_List_node_header>(),
                    24usize,
                    concat!("Size of: ", stringify!(_List_node_header))
                );
                assert_eq!(
                    align_of::<_List_node_header>(),
                    8usize,
                    concat!("Alignment of ", stringify!(_List_node_header))
                );
                assert_eq!(
                    unsafe {
                        &(*(::std::ptr::null::<_List_node_header>()))._M_size as *const _ as usize
                    },
                    16usize,
                    concat!(
                        "Offset of field: ",
                        stringify!(_List_node_header),
                        "::",
                        stringify!(_M_size)
                    )
                );
            }
            impl Default for _List_node_header {
                fn default() -> Self {
                    unsafe { zeroed() }
                }
            }
            #[repr(C)]
            #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
            pub struct __floating_point_constant {
                pub _address: u8,
            }
            #[repr(C)]
            #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
            pub struct __numeric_constants {
                pub _address: u8,
            }
        }
        pub type string_view = self::std::basic_string_view<c_char>;
        pub type wstring_view = self::std::basic_string_view<u32>;
        pub type u16string_view = self::std::basic_string_view<u16>;
        pub type u32string_view = self::std::basic_string_view<u32>;
        #[test]
        fn __bindgen_test_layout_hash_open0_basic_string_view_open1_char_char_traits_open2_char_close2_close1_close0_instantiation(
        ) {
            assert_eq!(
                size_of::<root::std::hash>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::hash)
                )
            );
            assert_eq!(
                align_of::<root::std::hash>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::hash)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout___is_fast_hash_open0_hash_open1_basic_string_view_open2_char_char_traits_open3_char_close3_close2_close1_close0_instantiation(
        ) {
            assert_eq!(
                size_of::<root::std::__is_fast_hash>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::__is_fast_hash)
                )
            );
            assert_eq!(
                align_of::<root::std::__is_fast_hash>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::__is_fast_hash)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_hash_open0_basic_string_view_open1_wchar_t_char_traits_open2_wchar_t_close2_close1_close0_instantiation(
        ) {
            assert_eq!(
                size_of::<root::std::hash>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::hash)
                )
            );
            assert_eq!(
                align_of::<root::std::hash>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::hash)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout___is_fast_hash_open0_hash_open1_basic_string_view_open2_wchar_t_char_traits_open3_wchar_t_close3_close2_close1_close0_instantiation(
        ) {
            assert_eq!(
                size_of::<root::std::__is_fast_hash>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::__is_fast_hash)
                )
            );
            assert_eq!(
                align_of::<root::std::__is_fast_hash>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::__is_fast_hash)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_hash_open0_basic_string_view_open1_char16_t_char_traits_open2_char16_t_close2_close1_close0_instantiation(
        ) {
            assert_eq!(
                size_of::<root::std::hash>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::hash)
                )
            );
            assert_eq!(
                align_of::<root::std::hash>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::hash)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout___is_fast_hash_open0_hash_open1_basic_string_view_open2_char16_t_char_traits_open3_char16_t_close3_close2_close1_close0_instantiation(
        ) {
            assert_eq!(
                size_of::<root::std::__is_fast_hash>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::__is_fast_hash)
                )
            );
            assert_eq!(
                align_of::<root::std::__is_fast_hash>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::__is_fast_hash)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_hash_open0_basic_string_view_open1_char32_t_char_traits_open2_char32_t_close2_close1_close0_instantiation(
        ) {
            assert_eq!(
                size_of::<root::std::hash>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::hash)
                )
            );
            assert_eq!(
                align_of::<root::std::hash>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::hash)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout___is_fast_hash_open0_hash_open1_basic_string_view_open2_char32_t_char_traits_open3_char32_t_close3_close2_close1_close0_instantiation(
        ) {
            assert_eq!(
                size_of::<root::std::__is_fast_hash>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::__is_fast_hash)
                )
            );
            assert_eq!(
                align_of::<root::std::__is_fast_hash>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::__is_fast_hash)
                )
            );
        }
        pub mod literals {}
        extern "C" {
            pub fn getline(
                __in: *mut self::std::basic_istream<c_char>,
                __str: *mut self::std::__cxx11::basic_string<c_char>,
                __delim: c_char,
            ) -> *mut self::std::basic_istream<c_char>;
        }
        #[test]
        fn __bindgen_test_layout_hash_open0_basic_string_open1_char_char_traits_open2_char_close2_allocator_open2_char_close2_close1_close0_instantiation(
        ) {
            assert_eq!(
                size_of::<root::std::hash>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::hash)
                )
            );
            assert_eq!(
                align_of::<root::std::hash>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::hash)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout___is_fast_hash_open0_hash_open1_basic_string_open2_char_char_traits_open3_char_close3_allocator_open3_char_close3_close2_close1_close0_instantiation(
        ) {
            assert_eq!(
                size_of::<root::std::__is_fast_hash>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::__is_fast_hash)
                )
            );
            assert_eq!(
                align_of::<root::std::__is_fast_hash>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::__is_fast_hash)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_hash_open0_basic_string_open1_wchar_t_char_traits_open2_wchar_t_close2_allocator_open2_wchar_t_close2_close1_close0_instantiation(
        ) {
            assert_eq!(
                size_of::<root::std::hash>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::hash)
                )
            );
            assert_eq!(
                align_of::<root::std::hash>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::hash)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout___is_fast_hash_open0_hash_open1_basic_string_open2_wchar_t_char_traits_open3_wchar_t_close3_allocator_open3_wchar_t_close3_close2_close1_close0_instantiation(
        ) {
            assert_eq!(
                size_of::<root::std::__is_fast_hash>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::__is_fast_hash)
                )
            );
            assert_eq!(
                align_of::<root::std::__is_fast_hash>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::__is_fast_hash)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_hash_open0_basic_string_open1_char16_t_char_traits_open2_char16_t_close2_allocator_open2_char16_t_close2_close1_close0_instantiation(
        ) {
            assert_eq!(
                size_of::<root::std::hash>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::hash)
                )
            );
            assert_eq!(
                align_of::<root::std::hash>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::hash)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout___is_fast_hash_open0_hash_open1_basic_string_open2_char16_t_char_traits_open3_char16_t_close3_allocator_open3_char16_t_close3_close2_close1_close0_instantiation(
        ) {
            assert_eq!(
                size_of::<root::std::__is_fast_hash>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::__is_fast_hash)
                )
            );
            assert_eq!(
                align_of::<root::std::__is_fast_hash>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::__is_fast_hash)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout_hash_open0_basic_string_open1_char32_t_char_traits_open2_char32_t_close2_allocator_open2_char32_t_close2_close1_close0_instantiation(
        ) {
            assert_eq!(
                size_of::<root::std::hash>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::hash)
                )
            );
            assert_eq!(
                align_of::<root::std::hash>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::hash)
                )
            );
        }
        #[test]
        fn __bindgen_test_layout___is_fast_hash_open0_hash_open1_basic_string_open2_char32_t_char_traits_open3_char32_t_close3_allocator_open3_char32_t_close3_close2_close1_close0_instantiation(
        ) {
            assert_eq!(
                size_of::<root::std::__is_fast_hash>(),
                1usize,
                concat!(
                    "Size of template specialization: ",
                    stringify!(root::std::__is_fast_hash)
                )
            );
            assert_eq!(
                align_of::<root::std::__is_fast_hash>(),
                1usize,
                concat!(
                    "Alignment of template specialization: ",
                    stringify!(root::std::__is_fast_hash)
                )
            );
        }
        extern "C" {
            pub static npos: self::std::__cxx11::basic_string_size_type;
        }

        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct tuple_size {
            pub _address: u8,
        }
        pub type __enable_if_has_tuple_size<_Tp> = _Tp;
        pub type __tuple_element_t = u8;
        pub type tuple_element_t = u8;
        pub type _Build_index_tuple__IdxTuple = u8;
        pub type _Build_index_tuple___type = u8;
        pub type integer_sequence_value_type<_Tp> = _Tp;
        pub type make_integer_sequence = u8;
        pub type index_sequence = u8;
        pub type make_index_sequence = self::std::make_integer_sequence;
        pub type index_sequence_for = self::std::make_index_sequence;
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct in_place_t {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout_in_place_t() {
            assert_eq!(
                size_of::<in_place_t>(),
                1usize,
                concat!("Size of: ", stringify!(in_place_t))
            );
            assert_eq!(
                align_of::<in_place_t>(),
                1usize,
                concat!("Alignment of ", stringify!(in_place_t))
            );
        }
        extern "C" {
            pub static in_place: self::std::in_place_t;
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct in_place_type_t {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __is_in_place_type_impl {
            pub _base: self::std::false_type,
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __is_in_place_type {
            pub _base: self::std::__is_in_place_type_impl,
        }
        impl Default for __is_in_place_type {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        #[repr(C)]
        pub struct _Vector_base {
            pub _M_impl: self::std::_Vector_base__Vector_impl,
        }
        pub type _Vector_base__Tp_alloc_type = [u8; 0usize];
        pub type _Vector_base_pointer = [u8; 0usize];
        #[repr(C)]
        pub struct _Vector_base__Vector_impl {
            pub _M_start: self::std::_Vector_base_pointer,
            pub _M_finish: self::std::_Vector_base_pointer,
            pub _M_end_of_storage: self::std::_Vector_base_pointer,
        }
        impl Default for _Vector_base__Vector_impl {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        impl ::std::fmt::Debug for _Vector_base__Vector_impl {
            fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
                write!(f, "_Vector_base__Vector_impl {{  }}")
            }
        }
        impl PartialEq for _Vector_base__Vector_impl {
            fn eq(&self, other: &_Vector_base__Vector_impl) -> bool {
                self._M_start == other._M_start
                    && self._M_finish == other._M_finish
                    && self._M_end_of_storage == other._M_end_of_storage
            }
        }
        pub type _Vector_base_allocator_type<_Alloc> = _Alloc;
        impl Default for _Vector_base {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        impl ::std::fmt::Debug for _Vector_base {
            fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
                write!(f, "_Vector_base {{ _M_impl: {:?} }}", self._M_impl)
            }
        }
        impl PartialEq for _Vector_base {
            fn eq(&self, other: &_Vector_base) -> bool {
                self._M_impl == other._M_impl
            }
        }
        #[repr(C)]
        pub struct vector {
            pub _base: self::std::_Vector_base,
        }
        pub type vector__Base = self::std::_Vector_base;
        pub type vector__Tp_alloc_type = self::std::vector__Base;
        pub type vector__Alloc_traits = self::__gnu_cxx::__alloc_traits;
        pub type vector_value_type<_Tp> = _Tp;
        pub type vector_pointer = self::std::vector__Base;
        pub type vector_const_pointer = self::std::vector__Alloc_traits;
        pub type vector_reference = self::std::vector__Alloc_traits;
        pub type vector_const_reference = self::std::vector__Alloc_traits;
        pub type vector_iterator = self::__gnu_cxx::__normal_iterator<root::std::vector_pointer>;
        pub type vector_const_iterator =
            self::__gnu_cxx::__normal_iterator<root::std::vector_const_pointer>;
        pub type vector_const_reverse_iterator =
            self::std::reverse_iterator<root::std::vector_const_iterator>;
        pub type vector_reverse_iterator = self::std::reverse_iterator<root::std::vector_iterator>;
        pub type vector_size_type = usize;
        pub type vector_difference_type = isize;
        pub type vector_allocator_type<_Alloc> = _Alloc;
        #[repr(C)]
        #[derive(Debug, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct vector__Temporary_value {
            pub _M_this: *mut self::std::vector,
            pub __buf: u8,
        }
        impl Default for vector__Temporary_value {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        impl Default for vector {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        impl ::std::fmt::Debug for vector {
            fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
                write!(f, "vector {{  }}")
            }
        }
        impl PartialEq for vector {
            fn eq(&self, other: &vector) -> bool {
                self._base == other._base
            }
        }
        pub type _Bit_type = c_ulong;
        pub const std__S_word_bit: self::std::_bindgen_ty_1 = 64;
        pub type _bindgen_ty_1 = u32;
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct _Bit_reference {
            pub _M_p: *mut self::std::_Bit_type,
            pub _M_mask: self::std::_Bit_type,
        }
        #[test]
        fn bindgen_test_layout__Bit_reference() {
            assert_eq!(
                size_of::<_Bit_reference>(),
                16usize,
                concat!("Size of: ", stringify!(_Bit_reference))
            );
            assert_eq!(
                align_of::<_Bit_reference>(),
                8usize,
                concat!("Alignment of ", stringify!(_Bit_reference))
            );
            assert_eq!(
                unsafe { &(*(::std::ptr::null::<_Bit_reference>()))._M_p as *const _ as usize },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(_Bit_reference),
                    "::",
                    stringify!(_M_p)
                )
            );
            assert_eq!(
                unsafe { &(*(::std::ptr::null::<_Bit_reference>()))._M_mask as *const _ as usize },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(_Bit_reference),
                    "::",
                    stringify!(_M_mask)
                )
            );
        }
        impl Default for _Bit_reference {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct _Bit_iterator_base {
            pub _M_p: *mut self::std::_Bit_type,
            pub _M_offset: c_uint,
        }
        #[test]
        fn bindgen_test_layout__Bit_iterator_base() {
            assert_eq!(
                size_of::<_Bit_iterator_base>(),
                16usize,
                concat!("Size of: ", stringify!(_Bit_iterator_base))
            );
            assert_eq!(
                align_of::<_Bit_iterator_base>(),
                8usize,
                concat!("Alignment of ", stringify!(_Bit_iterator_base))
            );
            assert_eq!(
                unsafe { &(*(::std::ptr::null::<_Bit_iterator_base>()))._M_p as *const _ as usize },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(_Bit_iterator_base),
                    "::",
                    stringify!(_M_p)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::std::ptr::null::<_Bit_iterator_base>()))._M_offset as *const _ as usize
                },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(_Bit_iterator_base),
                    "::",
                    stringify!(_M_offset)
                )
            );
        }
        impl Default for _Bit_iterator_base {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct _Bit_iterator {
            pub _base: self::std::_Bit_iterator_base,
        }
        pub type _Bit_iterator_reference = self::std::_Bit_reference;
        pub type _Bit_iterator_pointer = *mut self::std::_Bit_reference;
        pub type _Bit_iterator_iterator = self::std::_Bit_iterator;
        #[test]
        fn bindgen_test_layout__Bit_iterator() {
            assert_eq!(
                size_of::<_Bit_iterator>(),
                16usize,
                concat!("Size of: ", stringify!(_Bit_iterator))
            );
            assert_eq!(
                align_of::<_Bit_iterator>(),
                8usize,
                concat!("Alignment of ", stringify!(_Bit_iterator))
            );
        }
        impl Default for _Bit_iterator {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct _Bit_const_iterator {
            pub _base: self::std::_Bit_iterator_base,
        }
        pub type _Bit_const_iterator_reference = bool;
        pub type _Bit_const_iterator_const_reference = bool;
        pub type _Bit_const_iterator_pointer = *const bool;
        pub type _Bit_const_iterator_const_iterator = self::std::_Bit_const_iterator;
        #[test]
        fn bindgen_test_layout__Bit_const_iterator() {
            assert_eq!(
                size_of::<_Bit_const_iterator>(),
                16usize,
                concat!("Size of: ", stringify!(_Bit_const_iterator))
            );
            assert_eq!(
                align_of::<_Bit_const_iterator>(),
                8usize,
                concat!("Alignment of ", stringify!(_Bit_const_iterator))
            );
        }
        impl Default for _Bit_const_iterator {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        #[repr(C)]
        pub struct _Bvector_base {
            pub _M_impl: self::std::_Bvector_base__Bvector_impl,
        }
        pub type _Bvector_base__Bit_alloc_type = [u8; 0usize];
        pub type _Bvector_base__Bit_alloc_traits = self::__gnu_cxx::__alloc_traits;
        pub type _Bvector_base__Bit_pointer = [u8; 0usize];
        #[repr(C)]
        pub struct _Bvector_base__Bvector_impl_data {
            pub _M_start: self::std::_Bit_iterator,
            pub _M_finish: self::std::_Bit_iterator,
            pub _M_end_of_storage: self::std::_Bvector_base__Bit_pointer,
        }
        impl Default for _Bvector_base__Bvector_impl_data {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        impl ::std::fmt::Debug for _Bvector_base__Bvector_impl_data {
            fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
                write!(
                    f,
                    "_Bvector_base__Bvector_impl_data {{ _M_start: {:?}, _M_finish: {:?} }}",
                    self._M_start, self._M_finish
                )
            }
        }
        impl PartialEq for _Bvector_base__Bvector_impl_data {
            fn eq(&self, other: &_Bvector_base__Bvector_impl_data) -> bool {
                self._M_start == other._M_start
                    && self._M_finish == other._M_finish
                    && self._M_end_of_storage == other._M_end_of_storage
            }
        }
        #[repr(C)]
        pub struct _Bvector_base__Bvector_impl {
            pub _base_1: self::std::_Bvector_base__Bvector_impl_data,
        }
        impl Default for _Bvector_base__Bvector_impl {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        impl ::std::fmt::Debug for _Bvector_base__Bvector_impl {
            fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
                write!(f, "_Bvector_base__Bvector_impl {{  }}")
            }
        }
        impl PartialEq for _Bvector_base__Bvector_impl {
            fn eq(&self, other: &_Bvector_base__Bvector_impl) -> bool {
                self._base_1 == other._base_1
            }
        }
        pub type _Bvector_base_allocator_type<_Alloc> = _Alloc;
        impl Default for _Bvector_base {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        impl ::std::fmt::Debug for _Bvector_base {
            fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
                write!(f, "_Bvector_base {{ _M_impl: {:?} }}", self._M_impl)
            }
        }
        impl PartialEq for _Bvector_base {
            fn eq(&self, other: &_Bvector_base) -> bool {
                self._M_impl == other._M_impl
            }
        }
        #[repr(C)]
        pub struct __cow_string {
            pub __bindgen_anon_1: self::std::__cow_string__bindgen_ty_1,
        }
        #[repr(C)]
        #[derive(Copy, Clone)]
        pub union __cow_string__bindgen_ty_1 {
            pub _M_p: *const c_char,
            pub _M_bytes: [c_char; 8usize],
            _bindgen_union_align: u64,
        }
        #[test]
        fn bindgen_test_layout___cow_string__bindgen_ty_1() {
            assert_eq!(
                size_of::<__cow_string__bindgen_ty_1>(),
                8usize,
                concat!("Size of: ", stringify!(__cow_string__bindgen_ty_1))
            );
            assert_eq!(
                align_of::<__cow_string__bindgen_ty_1>(),
                8usize,
                concat!("Alignment of ", stringify!(__cow_string__bindgen_ty_1))
            );
            assert_eq!(
                unsafe {
                    &(*(::std::ptr::null::<__cow_string__bindgen_ty_1>()))._M_p as *const _ as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(__cow_string__bindgen_ty_1),
                    "::",
                    stringify!(_M_p)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::std::ptr::null::<__cow_string__bindgen_ty_1>()))._M_bytes as *const _
                        as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(__cow_string__bindgen_ty_1),
                    "::",
                    stringify!(_M_bytes)
                )
            );
        }
        impl Default for __cow_string__bindgen_ty_1 {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        impl ::std::fmt::Debug for __cow_string__bindgen_ty_1 {
            fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
                write!(f, "__cow_string__bindgen_ty_1 {{ union }}")
            }
        }
        #[test]
        fn bindgen_test_layout___cow_string() {
            assert_eq!(
                size_of::<__cow_string>(),
                8usize,
                concat!("Size of: ", stringify!(__cow_string))
            );
            assert_eq!(
                align_of::<__cow_string>(),
                8usize,
                concat!("Alignment of ", stringify!(__cow_string))
            );
        }
        extern "C" {
            #[link_name = "\u{1}__cow_string"]
            pub fn __cow_string___cow_string(this: *mut self::std::__cow_string);
        }
        extern "C" {
            #[link_name = "\u{1}__cow_string"]
            pub fn __cow_string___cow_string1(
                this: *mut self::std::__cow_string,
                arg1: *const self::std::__cxx11::string,
            );
        }
        extern "C" {
            #[link_name = "\u{1}__cow_string"]
            pub fn __cow_string___cow_string2(
                this: *mut self::std::__cow_string,
                arg1: *const c_char,
                arg2: usize,
            );
        }
        extern "C" {
            #[link_name = "\u{1}__cow_string"]
            pub fn __cow_string___cow_string3(
                this: *mut self::std::__cow_string,
                arg1: *const self::std::__cow_string,
            );
        }
        extern "C" {
            #[link_name = "\u{1}__cow_string"]
            pub fn __cow_string___cow_string4(
                this: *mut self::std::__cow_string,
                arg1: *mut self::std::__cow_string,
            );
        }
        extern "C" {
            #[link_name = "\u{1}__cow_string_destructor"]
            pub fn __cow_string___cow_string_destructor(this: *mut self::std::__cow_string);
        }
        impl Default for __cow_string {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        impl ::std::fmt::Debug for __cow_string {
            fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
                write!(
                    f,
                    "__cow_string {{ __bindgen_anon_1: {:?} }}",
                    self.__bindgen_anon_1
                )
            }
        }
        impl __cow_string {
            #[inline]
            pub unsafe fn new() -> Self {
                let mut __bindgen_tmp = uninitialized();
                __cow_string___cow_string(&mut __bindgen_tmp);
                __bindgen_tmp
            }
            #[inline]
            pub unsafe fn new1(arg1: *const self::std::__cxx11::string) -> Self {
                let mut __bindgen_tmp = uninitialized();
                __cow_string___cow_string1(&mut __bindgen_tmp, arg1);
                __bindgen_tmp
            }
            #[inline]
            pub unsafe fn new2(arg1: *const c_char, arg2: usize) -> Self {
                let mut __bindgen_tmp = uninitialized();
                __cow_string___cow_string2(&mut __bindgen_tmp, arg1, arg2);
                __bindgen_tmp
            }
            #[inline]
            pub unsafe fn new3(arg1: *const self::std::__cow_string) -> Self {
                let mut __bindgen_tmp = uninitialized();
                __cow_string___cow_string3(&mut __bindgen_tmp, arg1);
                __bindgen_tmp
            }
            #[inline]
            pub unsafe fn new4(arg1: *mut self::std::__cow_string) -> Self {
                let mut __bindgen_tmp = uninitialized();
                __cow_string___cow_string4(&mut __bindgen_tmp, arg1);
                __bindgen_tmp
            }
            #[inline]
            pub unsafe fn destruct(&mut self) {
                __cow_string___cow_string_destructor(self)
            }
        }
        pub type __sso_string = self::std::__cxx11::basic_string<c_char>;
        #[repr(C)]
        pub struct logic_error {
            pub _base: self::std::exception,
            pub _M_msg: self::std::__cow_string,
        }
        #[test]
        fn bindgen_test_layout_logic_error() {
            assert_eq!(
                size_of::<logic_error>(),
                16usize,
                concat!("Size of: ", stringify!(logic_error))
            );
            assert_eq!(
                align_of::<logic_error>(),
                8usize,
                concat!("Alignment of ", stringify!(logic_error))
            );
            assert_eq!(
                unsafe { &(*(::std::ptr::null::<logic_error>()))._M_msg as *const _ as usize },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(logic_error),
                    "::",
                    stringify!(_M_msg)
                )
            );
        }
        extern "C" {
            #[link_name = "\u{1}logic_error"]
            pub fn logic_error_logic_error(
                this: *mut self::std::logic_error,
                __arg: *const self::std::__cxx11::string,
            );
        }
        extern "C" {
            #[link_name = "\u{1}logic_error"]
            pub fn logic_error_logic_error1(this: *mut self::std::logic_error, arg1: *const c_char);
        }
        extern "C" {
            #[link_name = "\u{1}logic_error"]
            pub fn logic_error_logic_error2(
                this: *mut self::std::logic_error,
                arg1: *const self::std::logic_error,
            );
        }
        impl Default for logic_error {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        impl ::std::fmt::Debug for logic_error {
            fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
                write!(f, "logic_error {{ _M_msg: {:?} }}", self._M_msg)
            }
        }
        impl logic_error {
            #[inline]
            pub unsafe fn new(__arg: *const self::std::__cxx11::string) -> Self {
                let mut __bindgen_tmp = uninitialized();
                logic_error_logic_error(&mut __bindgen_tmp, __arg);
                __bindgen_tmp
            }
            #[inline]
            pub unsafe fn new1(arg1: *const c_char) -> Self {
                let mut __bindgen_tmp = uninitialized();
                logic_error_logic_error1(&mut __bindgen_tmp, arg1);
                __bindgen_tmp
            }
            #[inline]
            pub unsafe fn new2(arg1: *const self::std::logic_error) -> Self {
                let mut __bindgen_tmp = uninitialized();
                logic_error_logic_error2(&mut __bindgen_tmp, arg1);
                __bindgen_tmp
            }
        }
        extern "C" {
            #[link_name = "\u{1}logic_error_destructor"]
            pub fn logic_error_logic_error_destructor(this: *mut self::std::logic_error);
        }
        extern "C" {
            #[link_name = "\u{1}what"]
            pub fn logic_error_what(this: *mut c_void) -> *const c_char;
        }
        #[repr(C)]
        pub struct domain_error {
            pub _base: self::std::logic_error,
        }
        #[test]
        fn bindgen_test_layout_domain_error() {
            assert_eq!(
                size_of::<domain_error>(),
                16usize,
                concat!("Size of: ", stringify!(domain_error))
            );
            assert_eq!(
                align_of::<domain_error>(),
                8usize,
                concat!("Alignment of ", stringify!(domain_error))
            );
        }
        extern "C" {
            #[link_name = "\u{1}domain_error"]
            pub fn domain_error_domain_error(
                this: *mut self::std::domain_error,
                __arg: *const self::std::__cxx11::string,
            );
        }
        extern "C" {
            #[link_name = "\u{1}domain_error"]
            pub fn domain_error_domain_error1(
                this: *mut self::std::domain_error,
                arg1: *const c_char,
            );
        }
        impl Default for domain_error {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        impl ::std::fmt::Debug for domain_error {
            fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
                write!(f, "domain_error {{  }}")
            }
        }
        impl domain_error {
            #[inline]
            pub unsafe fn new(__arg: *const self::std::__cxx11::string) -> Self {
                let mut __bindgen_tmp = uninitialized();
                domain_error_domain_error(&mut __bindgen_tmp, __arg);
                __bindgen_tmp
            }
            #[inline]
            pub unsafe fn new1(arg1: *const c_char) -> Self {
                let mut __bindgen_tmp = uninitialized();
                domain_error_domain_error1(&mut __bindgen_tmp, arg1);
                __bindgen_tmp
            }
        }
        extern "C" {
            #[link_name = "\u{1}domain_error_destructor"]
            pub fn domain_error_domain_error_destructor(this: *mut self::std::domain_error);
        }
        #[repr(C)]
        pub struct invalid_argument {
            pub _base: self::std::logic_error,
        }
        #[test]
        fn bindgen_test_layout_invalid_argument() {
            assert_eq!(
                size_of::<invalid_argument>(),
                16usize,
                concat!("Size of: ", stringify!(invalid_argument))
            );
            assert_eq!(
                align_of::<invalid_argument>(),
                8usize,
                concat!("Alignment of ", stringify!(invalid_argument))
            );
        }
        extern "C" {
            #[link_name = "\u{1}invalid_argument"]
            pub fn invalid_argument_invalid_argument(
                this: *mut self::std::invalid_argument,
                __arg: *const self::std::__cxx11::string,
            );
        }
        extern "C" {
            #[link_name = "\u{1}invalid_argument"]
            pub fn invalid_argument_invalid_argument1(
                this: *mut self::std::invalid_argument,
                arg1: *const c_char,
            );
        }
        impl Default for invalid_argument {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        impl ::std::fmt::Debug for invalid_argument {
            fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
                write!(f, "invalid_argument {{  }}")
            }
        }
        impl invalid_argument {
            #[inline]
            pub unsafe fn new(__arg: *const self::std::__cxx11::string) -> Self {
                let mut __bindgen_tmp = uninitialized();
                invalid_argument_invalid_argument(&mut __bindgen_tmp, __arg);
                __bindgen_tmp
            }
            #[inline]
            pub unsafe fn new1(arg1: *const c_char) -> Self {
                let mut __bindgen_tmp = uninitialized();
                invalid_argument_invalid_argument1(&mut __bindgen_tmp, arg1);
                __bindgen_tmp
            }
        }
        extern "C" {
            #[link_name = "\u{1}invalid_argument_destructor"]
            pub fn invalid_argument_invalid_argument_destructor(
                this: *mut self::std::invalid_argument,
            );
        }
        #[repr(C)]
        pub struct length_error {
            pub _base: self::std::logic_error,
        }
        #[test]
        fn bindgen_test_layout_length_error() {
            assert_eq!(
                size_of::<length_error>(),
                16usize,
                concat!("Size of: ", stringify!(length_error))
            );
            assert_eq!(
                align_of::<length_error>(),
                8usize,
                concat!("Alignment of ", stringify!(length_error))
            );
        }
        extern "C" {
            #[link_name = "\u{1}length_error"]
            pub fn length_error_length_error(
                this: *mut self::std::length_error,
                __arg: *const self::std::__cxx11::string,
            );
        }
        extern "C" {
            #[link_name = "\u{1}length_error"]
            pub fn length_error_length_error1(
                this: *mut self::std::length_error,
                arg1: *const c_char,
            );
        }
        impl Default for length_error {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        impl ::std::fmt::Debug for length_error {
            fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
                write!(f, "length_error {{  }}")
            }
        }
        impl length_error {
            #[inline]
            pub unsafe fn new(__arg: *const self::std::__cxx11::string) -> Self {
                let mut __bindgen_tmp = uninitialized();
                length_error_length_error(&mut __bindgen_tmp, __arg);
                __bindgen_tmp
            }
            #[inline]
            pub unsafe fn new1(arg1: *const c_char) -> Self {
                let mut __bindgen_tmp = uninitialized();
                length_error_length_error1(&mut __bindgen_tmp, arg1);
                __bindgen_tmp
            }
        }
        extern "C" {
            #[link_name = "\u{1}length_error_destructor"]
            pub fn length_error_length_error_destructor(this: *mut self::std::length_error);
        }
        #[repr(C)]
        pub struct out_of_range {
            pub _base: self::std::logic_error,
        }
        #[test]
        fn bindgen_test_layout_out_of_range() {
            assert_eq!(
                size_of::<out_of_range>(),
                16usize,
                concat!("Size of: ", stringify!(out_of_range))
            );
            assert_eq!(
                align_of::<out_of_range>(),
                8usize,
                concat!("Alignment of ", stringify!(out_of_range))
            );
        }
        extern "C" {
            #[link_name = "\u{1}out_of_range"]
            pub fn out_of_range_out_of_range(
                this: *mut self::std::out_of_range,
                __arg: *const self::std::__cxx11::string,
            );
        }
        extern "C" {
            #[link_name = "\u{1}out_of_range"]
            pub fn out_of_range_out_of_range1(
                this: *mut self::std::out_of_range,
                arg1: *const c_char,
            );
        }
        impl Default for out_of_range {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        impl ::std::fmt::Debug for out_of_range {
            fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
                write!(f, "out_of_range {{  }}")
            }
        }
        impl out_of_range {
            #[inline]
            pub unsafe fn new(__arg: *const self::std::__cxx11::string) -> Self {
                let mut __bindgen_tmp = uninitialized();
                out_of_range_out_of_range(&mut __bindgen_tmp, __arg);
                __bindgen_tmp
            }
            #[inline]
            pub unsafe fn new1(arg1: *const c_char) -> Self {
                let mut __bindgen_tmp = uninitialized();
                out_of_range_out_of_range1(&mut __bindgen_tmp, arg1);
                __bindgen_tmp
            }
        }
        extern "C" {
            #[link_name = "\u{1}out_of_range_destructor"]
            pub fn out_of_range_out_of_range_destructor(this: *mut self::std::out_of_range);
        }
        #[repr(C)]
        pub struct runtime_error {
            pub _base: self::std::exception,
            pub _M_msg: self::std::__cow_string,
        }
        #[test]
        fn bindgen_test_layout_runtime_error() {
            assert_eq!(
                size_of::<runtime_error>(),
                16usize,
                concat!("Size of: ", stringify!(runtime_error))
            );
            assert_eq!(
                align_of::<runtime_error>(),
                8usize,
                concat!("Alignment of ", stringify!(runtime_error))
            );
            assert_eq!(
                unsafe { &(*(::std::ptr::null::<runtime_error>()))._M_msg as *const _ as usize },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(runtime_error),
                    "::",
                    stringify!(_M_msg)
                )
            );
        }
        extern "C" {
            #[link_name = "\u{1}runtime_error"]
            pub fn runtime_error_runtime_error(
                this: *mut self::std::runtime_error,
                __arg: *const self::std::__cxx11::string,
            );
        }
        extern "C" {
            #[link_name = "\u{1}runtime_error"]
            pub fn runtime_error_runtime_error1(
                this: *mut self::std::runtime_error,
                arg1: *const c_char,
            );
        }
        extern "C" {
            #[link_name = "\u{1}runtime_error"]
            pub fn runtime_error_runtime_error2(
                this: *mut self::std::runtime_error,
                arg1: *const self::std::runtime_error,
            );
        }
        impl Default for runtime_error {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        impl ::std::fmt::Debug for runtime_error {
            fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
                write!(f, "runtime_error {{ _M_msg: {:?} }}", self._M_msg)
            }
        }
        impl runtime_error {
            #[inline]
            pub unsafe fn new(__arg: *const self::std::__cxx11::string) -> Self {
                let mut __bindgen_tmp = uninitialized();
                runtime_error_runtime_error(&mut __bindgen_tmp, __arg);
                __bindgen_tmp
            }
            #[inline]
            pub unsafe fn new1(arg1: *const c_char) -> Self {
                let mut __bindgen_tmp = uninitialized();
                runtime_error_runtime_error1(&mut __bindgen_tmp, arg1);
                __bindgen_tmp
            }
            #[inline]
            pub unsafe fn new2(arg1: *const self::std::runtime_error) -> Self {
                let mut __bindgen_tmp = uninitialized();
                runtime_error_runtime_error2(&mut __bindgen_tmp, arg1);
                __bindgen_tmp
            }
        }
        extern "C" {
            #[link_name = "\u{1}runtime_error_destructor"]
            pub fn runtime_error_runtime_error_destructor(this: *mut self::std::runtime_error);
        }
        extern "C" {
            #[link_name = "\u{1}what"]
            pub fn runtime_error_what(this: *mut c_void) -> *const c_char;
        }
        #[repr(C)]
        pub struct range_error {
            pub _base: self::std::runtime_error,
        }
        #[test]
        fn bindgen_test_layout_range_error() {
            assert_eq!(
                size_of::<range_error>(),
                16usize,
                concat!("Size of: ", stringify!(range_error))
            );
            assert_eq!(
                align_of::<range_error>(),
                8usize,
                concat!("Alignment of ", stringify!(range_error))
            );
        }
        extern "C" {
            #[link_name = "\u{1}range_error"]
            pub fn range_error_range_error(
                this: *mut self::std::range_error,
                __arg: *const self::std::__cxx11::string,
            );
        }
        extern "C" {
            #[link_name = "\u{1}range_error"]
            pub fn range_error_range_error1(this: *mut self::std::range_error, arg1: *const c_char);
        }
        impl Default for range_error {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        impl ::std::fmt::Debug for range_error {
            fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
                write!(f, "range_error {{  }}")
            }
        }
        impl range_error {
            #[inline]
            pub unsafe fn new(__arg: *const self::std::__cxx11::string) -> Self {
                let mut __bindgen_tmp = uninitialized();
                range_error_range_error(&mut __bindgen_tmp, __arg);
                __bindgen_tmp
            }
            #[inline]
            pub unsafe fn new1(arg1: *const c_char) -> Self {
                let mut __bindgen_tmp = uninitialized();
                range_error_range_error1(&mut __bindgen_tmp, arg1);
                __bindgen_tmp
            }
        }
        extern "C" {
            #[link_name = "\u{1}range_error_destructor"]
            pub fn range_error_range_error_destructor(this: *mut self::std::range_error);
        }
        #[repr(C)]
        pub struct overflow_error {
            pub _base: self::std::runtime_error,
        }
        #[test]
        fn bindgen_test_layout_overflow_error() {
            assert_eq!(
                size_of::<overflow_error>(),
                16usize,
                concat!("Size of: ", stringify!(overflow_error))
            );
            assert_eq!(
                align_of::<overflow_error>(),
                8usize,
                concat!("Alignment of ", stringify!(overflow_error))
            );
        }
        extern "C" {
            #[link_name = "\u{1}overflow_error"]
            pub fn overflow_error_overflow_error(
                this: *mut self::std::overflow_error,
                __arg: *const self::std::__cxx11::string,
            );
        }
        extern "C" {
            #[link_name = "\u{1}overflow_error"]
            pub fn overflow_error_overflow_error1(
                this: *mut self::std::overflow_error,
                arg1: *const c_char,
            );
        }
        impl Default for overflow_error {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        impl ::std::fmt::Debug for overflow_error {
            fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
                write!(f, "overflow_error {{  }}")
            }
        }
        impl overflow_error {
            #[inline]
            pub unsafe fn new(__arg: *const self::std::__cxx11::string) -> Self {
                let mut __bindgen_tmp = uninitialized();
                overflow_error_overflow_error(&mut __bindgen_tmp, __arg);
                __bindgen_tmp
            }
            #[inline]
            pub unsafe fn new1(arg1: *const c_char) -> Self {
                let mut __bindgen_tmp = uninitialized();
                overflow_error_overflow_error1(&mut __bindgen_tmp, arg1);
                __bindgen_tmp
            }
        }
        extern "C" {
            #[link_name = "\u{1}overflow_error_destructor"]
            pub fn overflow_error_overflow_error_destructor(this: *mut self::std::overflow_error);
        }
        #[repr(C)]
        pub struct underflow_error {
            pub _base: self::std::runtime_error,
        }
        #[test]
        fn bindgen_test_layout_underflow_error() {
            assert_eq!(
                size_of::<underflow_error>(),
                16usize,
                concat!("Size of: ", stringify!(underflow_error))
            );
            assert_eq!(
                align_of::<underflow_error>(),
                8usize,
                concat!("Alignment of ", stringify!(underflow_error))
            );
        }
        extern "C" {
            #[link_name = "\u{1}underflow_error"]
            pub fn underflow_error_underflow_error(
                this: *mut self::std::underflow_error,
                __arg: *const self::std::__cxx11::string,
            );
        }
        extern "C" {
            #[link_name = "\u{1}underflow_error"]
            pub fn underflow_error_underflow_error1(
                this: *mut self::std::underflow_error,
                arg1: *const c_char,
            );
        }
        impl Default for underflow_error {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        impl ::std::fmt::Debug for underflow_error {
            fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
                write!(f, "underflow_error {{  }}")
            }
        }
        impl underflow_error {
            #[inline]
            pub unsafe fn new(__arg: *const self::std::__cxx11::string) -> Self {
                let mut __bindgen_tmp = uninitialized();
                underflow_error_underflow_error(&mut __bindgen_tmp, __arg);
                __bindgen_tmp
            }
            #[inline]
            pub unsafe fn new1(arg1: *const c_char) -> Self {
                let mut __bindgen_tmp = uninitialized();
                underflow_error_underflow_error1(&mut __bindgen_tmp, arg1);
                __bindgen_tmp
            }
        }
        extern "C" {
            #[link_name = "\u{1}underflow_error_destructor"]
            pub fn underflow_error_underflow_error_destructor(
                this: *mut self::std::underflow_error,
            );
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct _Enable_default_constructor_tag {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout__Enable_default_constructor_tag() {
            assert_eq!(
                size_of::<_Enable_default_constructor_tag>(),
                1usize,
                concat!("Size of: ", stringify!(_Enable_default_constructor_tag))
            );
            assert_eq!(
                align_of::<_Enable_default_constructor_tag>(),
                1usize,
                concat!("Alignment of ", stringify!(_Enable_default_constructor_tag))
            );
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct nullopt_t {
            pub _address: u8,
        }
        pub const nullopt_t__Construct__Token: self::std::nullopt_t__Construct = 0;
        pub type nullopt_t__Construct = i32;
        #[test]
        fn bindgen_test_layout_nullopt_t() {
            assert_eq!(
                size_of::<nullopt_t>(),
                1usize,
                concat!("Size of: ", stringify!(nullopt_t))
            );
            assert_eq!(
                align_of::<nullopt_t>(),
                1usize,
                concat!("Alignment of ", stringify!(nullopt_t))
            );
        }
        extern "C" {
            pub static nullopt: self::std::nullopt_t;
        }
        #[repr(C)]
        #[derive(Debug, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct bad_optional_access {
            pub _base: self::std::exception,
        }
        #[test]
        fn bindgen_test_layout_bad_optional_access() {
            assert_eq!(
                size_of::<bad_optional_access>(),
                8usize,
                concat!("Size of: ", stringify!(bad_optional_access))
            );
            assert_eq!(
                align_of::<bad_optional_access>(),
                8usize,
                concat!("Alignment of ", stringify!(bad_optional_access))
            );
        }
        impl Default for bad_optional_access {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        extern "C" {
            pub fn __throw_bad_optional_access();
        }
        pub type _Optional_payload__Stored_type = self::std::remove_const_t;
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct _Optional_payload__Empty_byte {
            pub _address: u8,
        }
        #[repr(C)]
        pub union _Optional_payload__bindgen_ty_1 {
            pub _M_empty: self::std::_Optional_payload__Empty_byte,
            pub _M_payload: self::std::_Optional_payload__Stored_type,
            _bindgen_union_align: [u8; 0usize],
        }
        impl Default for _Optional_payload__bindgen_ty_1 {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        impl ::std::fmt::Debug for _Optional_payload__bindgen_ty_1 {
            fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
                write!(f, "_Optional_payload__bindgen_ty_1 {{ union }}")
            }
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct _Optional_base_impl {
            pub _address: u8,
        }
        pub type _Optional_base_impl__Stored_type = self::std::remove_const_t;
        pub type __converts_from_optional = self::std::__or_;
        pub type __assigns_from_optional = self::std::__or_;
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct optional {
            pub _address: u8,
        }
        pub type optional__Base = u8;
        pub type optional_value_type<_Tp> = _Tp;
        pub type __optional_relop_t = self::std::enable_if_t;
        #[repr(C)]
        #[derive(Debug, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct _Node_handle_common {
            pub _M_ptr: self::std::_Node_handle_common__AllocTraits,
            pub _M_alloc: self::std::optional,
        }
        pub type _Node_handle_common__AllocTraits = self::std::allocator_traits;
        pub type _Node_handle_common_allocator_type = self::std::__alloc_rebind;
        impl Default for _Node_handle_common {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        #[repr(C)]
        #[derive(Debug, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct _Node_handle {
            pub _base: self::std::_Node_handle_common,
            pub _M_pkey: self::std::_Node_handle___pointer,
            pub _M_pmapped: self::std::_Node_handle___pointer,
        }
        pub type _Node_handle_key_type<_Key> = _Key;
        pub type _Node_handle_mapped_type = [u8; 0usize];
        pub type _Node_handle__AllocTraits = self::std::allocator_traits;
        pub type _Node_handle___pointer = self::std::__ptr_rebind;
        impl Default for _Node_handle {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct _Node_insert_return<_Iterator, _NodeHandle> {
            pub position: _Iterator,
            pub inserted: bool,
            pub node: _NodeHandle,
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Iterator>>,
            pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<_NodeHandle>>,
        }
        impl<_Iterator, _NodeHandle> Default for _Node_insert_return<_Iterator, _NodeHandle> {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        pub const _Rb_tree_color__S_red: self::std::_Rb_tree_color = 0;
        pub const _Rb_tree_color__S_black: self::std::_Rb_tree_color = 1;
        pub type _Rb_tree_color = u32;
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct _Rb_tree_node_base {
            pub _M_color: self::std::_Rb_tree_color,
            pub _M_parent: self::std::_Rb_tree_node_base__Base_ptr,
            pub _M_left: self::std::_Rb_tree_node_base__Base_ptr,
            pub _M_right: self::std::_Rb_tree_node_base__Base_ptr,
        }
        pub type _Rb_tree_node_base__Base_ptr = *mut self::std::_Rb_tree_node_base;
        pub type _Rb_tree_node_base__Const_Base_ptr = *const self::std::_Rb_tree_node_base;
        #[test]
        fn bindgen_test_layout__Rb_tree_node_base() {
            assert_eq!(
                size_of::<_Rb_tree_node_base>(),
                32usize,
                concat!("Size of: ", stringify!(_Rb_tree_node_base))
            );
            assert_eq!(
                align_of::<_Rb_tree_node_base>(),
                8usize,
                concat!("Alignment of ", stringify!(_Rb_tree_node_base))
            );
            assert_eq!(
                unsafe {
                    &(*(::std::ptr::null::<_Rb_tree_node_base>()))._M_color as *const _ as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(_Rb_tree_node_base),
                    "::",
                    stringify!(_M_color)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::std::ptr::null::<_Rb_tree_node_base>()))._M_parent as *const _ as usize
                },
                8usize,
                concat!(
                    "Offset of field: ",
                    stringify!(_Rb_tree_node_base),
                    "::",
                    stringify!(_M_parent)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::std::ptr::null::<_Rb_tree_node_base>()))._M_left as *const _ as usize
                },
                16usize,
                concat!(
                    "Offset of field: ",
                    stringify!(_Rb_tree_node_base),
                    "::",
                    stringify!(_M_left)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::std::ptr::null::<_Rb_tree_node_base>()))._M_right as *const _ as usize
                },
                24usize,
                concat!(
                    "Offset of field: ",
                    stringify!(_Rb_tree_node_base),
                    "::",
                    stringify!(_M_right)
                )
            );
        }
        impl Default for _Rb_tree_node_base {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct _Rb_tree_key_compare<_Key_compare> {
            pub _M_key_compare: _Key_compare,
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Key_compare>>,
        }
        impl<_Key_compare> Default for _Rb_tree_key_compare<_Key_compare> {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct _Rb_tree_header {
            pub _M_header: self::std::_Rb_tree_node_base,
            pub _M_node_count: usize,
        }
        #[test]
        fn bindgen_test_layout__Rb_tree_header() {
            assert_eq!(
                size_of::<_Rb_tree_header>(),
                40usize,
                concat!("Size of: ", stringify!(_Rb_tree_header))
            );
            assert_eq!(
                align_of::<_Rb_tree_header>(),
                8usize,
                concat!("Alignment of ", stringify!(_Rb_tree_header))
            );
            assert_eq!(
                unsafe {
                    &(*(::std::ptr::null::<_Rb_tree_header>()))._M_header as *const _ as usize
                },
                0usize,
                concat!(
                    "Offset of field: ",
                    stringify!(_Rb_tree_header),
                    "::",
                    stringify!(_M_header)
                )
            );
            assert_eq!(
                unsafe {
                    &(*(::std::ptr::null::<_Rb_tree_header>()))._M_node_count as *const _ as usize
                },
                32usize,
                concat!(
                    "Offset of field: ",
                    stringify!(_Rb_tree_header),
                    "::",
                    stringify!(_M_node_count)
                )
            );
        }
        impl Default for _Rb_tree_header {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct _Rb_tree_node {
            pub _base: self::std::_Rb_tree_node_base,
            pub _M_storage: self::__gnu_cxx::__aligned_membuf,
        }
        pub type _Rb_tree_node__Link_type = *mut self::std::_Rb_tree_node;
        impl Default for _Rb_tree_node {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        extern "C" {
            pub fn _Rb_tree_increment(
                __x: *mut self::std::_Rb_tree_node_base,
            ) -> *mut self::std::_Rb_tree_node_base;
        }
        extern "C" {
            pub fn _Rb_tree_decrement(
                __x: *mut self::std::_Rb_tree_node_base,
            ) -> *mut self::std::_Rb_tree_node_base;
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct _Rb_tree_iterator {
            pub _M_node: self::std::_Rb_tree_iterator__Base_ptr,
        }
        pub type _Rb_tree_iterator_value_type<_Tp> = _Tp;
        pub type _Rb_tree_iterator_reference<_Tp> = *mut _Tp;
        pub type _Rb_tree_iterator_pointer<_Tp> = *mut _Tp;
        pub type _Rb_tree_iterator_iterator_category = self::std::bidirectional_iterator_tag;
        pub type _Rb_tree_iterator_difference_type = isize;
        pub type _Rb_tree_iterator__Self = self::std::_Rb_tree_iterator;
        pub type _Rb_tree_iterator__Base_ptr = self::std::_Rb_tree_node_base__Base_ptr;
        pub type _Rb_tree_iterator__Link_type = *mut self::std::_Rb_tree_node;
        impl Default for _Rb_tree_iterator {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct _Rb_tree_const_iterator {
            pub _M_node: self::std::_Rb_tree_const_iterator__Base_ptr,
        }
        pub type _Rb_tree_const_iterator_value_type<_Tp> = _Tp;
        pub type _Rb_tree_const_iterator_reference<_Tp> = *const _Tp;
        pub type _Rb_tree_const_iterator_pointer<_Tp> = *const _Tp;
        pub type _Rb_tree_const_iterator_iterator = self::std::_Rb_tree_iterator;
        pub type _Rb_tree_const_iterator_iterator_category = self::std::bidirectional_iterator_tag;
        pub type _Rb_tree_const_iterator_difference_type = isize;
        pub type _Rb_tree_const_iterator__Self = self::std::_Rb_tree_const_iterator;
        pub type _Rb_tree_const_iterator__Base_ptr = self::std::_Rb_tree_node_base__Const_Base_ptr;
        pub type _Rb_tree_const_iterator__Link_type = *const self::std::_Rb_tree_node;
        impl Default for _Rb_tree_const_iterator {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        extern "C" {
            pub fn _Rb_tree_insert_and_rebalance(
                __insert_left: bool,
                __x: *mut self::std::_Rb_tree_node_base,
                __p: *mut self::std::_Rb_tree_node_base,
                __header: *mut self::std::_Rb_tree_node_base,
            );
        }
        extern "C" {
            pub fn _Rb_tree_rebalance_for_erase(
                __z: *mut self::std::_Rb_tree_node_base,
                __header: *mut self::std::_Rb_tree_node_base,
            ) -> *mut self::std::_Rb_tree_node_base;
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __has_is_transparent {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct _Rb_tree_merge_helper {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct _Rb_tree {
            pub _M_impl: u8,
        }
        pub type _Rb_tree__Node_allocator = [u8; 0usize];
        pub type _Rb_tree__Alloc_traits = self::__gnu_cxx::__alloc_traits;
        pub type _Rb_tree__Base_ptr = *mut self::std::_Rb_tree_node_base;
        pub type _Rb_tree__Const_Base_ptr = *const self::std::_Rb_tree_node_base;
        pub type _Rb_tree__Link_type = *mut self::std::_Rb_tree_node;
        pub type _Rb_tree__Const_Link_type = *const self::std::_Rb_tree_node;
        #[repr(C)]
        #[derive(Debug, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct _Rb_tree__Reuse_or_alloc_node {
            pub _M_root: self::std::_Rb_tree__Base_ptr,
            pub _M_nodes: self::std::_Rb_tree__Base_ptr,
            pub _M_t: *mut self::std::_Rb_tree,
        }
        impl Default for _Rb_tree__Reuse_or_alloc_node {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct _Rb_tree__Alloc_node {
            pub _M_t: *mut self::std::_Rb_tree,
        }
        impl Default for _Rb_tree__Alloc_node {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        pub type _Rb_tree_key_type<_Key> = _Key;
        pub type _Rb_tree_value_type<_Val> = _Val;
        pub type _Rb_tree_pointer<_Val> = *mut self::std::_Rb_tree_value_type<_Val>;
        pub type _Rb_tree_const_pointer<_Val> = *const self::std::_Rb_tree_value_type<_Val>;
        pub type _Rb_tree_reference<_Val> = *mut self::std::_Rb_tree_value_type<_Val>;
        pub type _Rb_tree_const_reference<_Val> = *const self::std::_Rb_tree_value_type<_Val>;
        pub type _Rb_tree_size_type = usize;
        pub type _Rb_tree_difference_type = isize;
        pub type _Rb_tree_allocator_type<_Alloc> = _Alloc;
        pub type _Rb_tree_reverse_iterator =
            self::std::reverse_iterator<root::std::_Rb_tree_iterator>;
        pub type _Rb_tree_const_reverse_iterator =
            self::std::reverse_iterator<root::std::_Rb_tree_const_iterator>;
        pub type _Rb_tree_node_type = self::std::_Node_handle;
        pub type _Rb_tree_insert_return_type =
            self::std::_Node_insert_return<_Iterator, _NodeHandle>;
        pub type _Rb_tree__Compatible_tree = self::std::_Rb_tree;
        pub type _Rb_tree__Rb_tree_impl__Base_key_compare<_Key_compare> =
            self::std::_Rb_tree_key_compare<_Key_compare>;
        extern "C" {
            pub fn _Rb_tree_black_count(
                __node: *const self::std::_Rb_tree_node_base,
                __root: *const self::std::_Rb_tree_node_base,
            ) -> c_uint;
        }
        pub type __array_traits__Type<_Tp> = *mut _Tp;
        pub type __array_traits__Is_swappable = self::std::__is_swappable;
        pub type __array_traits__Is_nothrow_swappable = self::std::__is_nothrow_swappable;
        pub type array_value_type<_Tp> = _Tp;
        pub type array_pointer<_Tp> = *mut self::std::array_value_type<_Tp>;
        pub type array_const_pointer<_Tp> = *const self::std::array_value_type<_Tp>;
        pub type array_reference<_Tp> = *mut self::std::array_value_type<_Tp>;
        pub type array_const_reference<_Tp> = *const self::std::array_value_type<_Tp>;
        pub type array_iterator<_Tp> = *mut self::std::array_value_type<_Tp>;
        pub type array_const_iterator<_Tp> = *const self::std::array_value_type<_Tp>;
        pub type array_size_type = usize;
        pub type array_difference_type = isize;
        pub type array_reverse_iterator<_Tp> =
            self::std::reverse_iterator<root::std::array_iterator<_Tp>>;
        pub type array_const_reverse_iterator<_Tp> =
            self::std::reverse_iterator<root::std::array_const_iterator<_Tp>>;
        pub type array__AT_Type = u8;
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __erased_type {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout___erased_type() {
            assert_eq!(
                size_of::<__erased_type>(),
                1usize,
                concat!("Size of: ", stringify!(__erased_type))
            );
            assert_eq!(
                align_of::<__erased_type>(),
                1usize,
                concat!("Alignment of ", stringify!(__erased_type))
            );
        }
        pub type __is_erased_or_convertible = self::std::__or_;
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct allocator_arg_t {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout_allocator_arg_t() {
            assert_eq!(
                size_of::<allocator_arg_t>(),
                1usize,
                concat!("Size of: ", stringify!(allocator_arg_t))
            );
            assert_eq!(
                align_of::<allocator_arg_t>(),
                1usize,
                concat!("Alignment of ", stringify!(allocator_arg_t))
            );
        }
        extern "C" {
            pub static allocator_arg: self::std::allocator_arg_t;
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __uses_allocator_helper {
            pub _base: self::std::false_type,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct uses_allocator {
            pub _address: u8,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __uses_alloc_base {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout___uses_alloc_base() {
            assert_eq!(
                size_of::<__uses_alloc_base>(),
                1usize,
                concat!("Size of: ", stringify!(__uses_alloc_base))
            );
            assert_eq!(
                align_of::<__uses_alloc_base>(),
                1usize,
                concat!("Alignment of ", stringify!(__uses_alloc_base))
            );
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __uses_alloc0 {
            pub _M_a: self::std::__uses_alloc0__Sink,
        }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __uses_alloc0__Sink {
            pub _address: u8,
        }
        #[test]
        fn bindgen_test_layout___uses_alloc0__Sink() {
            assert_eq!(
                size_of::<__uses_alloc0__Sink>(),
                1usize,
                concat!("Size of: ", stringify!(__uses_alloc0__Sink))
            );
            assert_eq!(
                align_of::<__uses_alloc0__Sink>(),
                1usize,
                concat!("Alignment of ", stringify!(__uses_alloc0__Sink))
            );
        }
        #[test]
