/* automatically generated by rust-bindgen */

#[allow(non_snake_case, non_camel_case_types, non_upper_case_globals)]
pub mod root {

    pub const __llvm__: u32 = 1;
    pub const __clang__: u32 = 1;
    pub const __clang_major__: u32 = 8;
    pub const __clang_minor__: u32 = 0;
    pub const __clang_patchlevel__: u32 = 0;
    pub const __clang_version__ : & 'static [ u8 ; 165usize ] = b"8.0.0 (https://github.com/llvm-mirror/clang 27ff8dcc77fd7c9f1bcf181b25eaa7d68777fdfe) (https://github.com/llvm-mirror/llvm 718039ebb75d709b91dcc3ca18eddedb283892fd)\0" ;
    pub const __GNUC_MINOR__: u32 = 2;
    pub const __GNUC_PATCHLEVEL__: u32 = 1;
    pub const __GNUC__: u32 = 4;
    pub const __GXX_ABI_VERSION: u32 = 1002;
    pub const __ATOMIC_RELAXED: u32 = 0;
    pub const __ATOMIC_CONSUME: u32 = 1;
    pub const __ATOMIC_ACQUIRE: u32 = 2;
    pub const __ATOMIC_RELEASE: u32 = 3;
    pub const __ATOMIC_ACQ_REL: u32 = 4;
    pub const __ATOMIC_SEQ_CST: u32 = 5;
    pub const __OPENCL_MEMORY_SCOPE_WORK_ITEM: u32 = 0;
    pub const __OPENCL_MEMORY_SCOPE_WORK_GROUP: u32 = 1;
    pub const __OPENCL_MEMORY_SCOPE_DEVICE: u32 = 2;
    pub const __OPENCL_MEMORY_SCOPE_ALL_SVM_DEVICES: u32 = 3;
    pub const __OPENCL_MEMORY_SCOPE_SUB_GROUP: u32 = 4;
    pub const __PRAGMA_REDEFINE_EXTNAME: u32 = 1;

    pub const INT_FAST16_MAX: u64 = 9223372036854775807;
    pub const INT_FAST32_MAX: u64 = 9223372036854775807;
    pub const UINT_FAST8_MAX: u32 = 255;
    pub const UINT_FAST16_MAX: i32 = -1;
    pub const UINT_FAST32_MAX: i32 = -1;
    pub const INTPTR_MIN: i64 = -9223372036854775808;
    pub const INTPTR_MAX: u64 = 9223372036854775807;
    pub const UINTPTR_MAX: i32 = -1;
    pub const PTRDIFF_MIN: i64 = -9223372036854775808;
    pub const PTRDIFF_MAX: u64 = 9223372036854775807;
    pub const SIG_ATOMIC_MIN: i32 = -2147483648;
    pub const SIG_ATOMIC_MAX: u32 = 2147483647;
    pub const SIZE_MAX: i32 = -1;
    pub const WCHAR_MIN: i32 = -2147483648;
    pub const WCHAR_MAX: u32 = 2147483647;
    pub const WINT_MIN: u32 = 0;
    pub const WINT_MAX: u32 = 4294967295;
    pub const _SYS_TYPES_H: u32 = 1;
    pub const __clockid_t_defined: u32 = 1;
    pub const __time_t_defined: u32 = 1;
    pub const __timer_t_defined: u32 = 1;
    pub const __BIT_TYPES_DEFINED__: u32 = 1;
    pub const SF_COUNT_MAX: u64 = 9223372036854775807;
    pub type __gnuc_va_list = __builtin_va_list;
    pub type __u_char = ::std::os::raw::c_uchar;
    pub type __u_short = ::std::os::raw::c_ushort;
    pub type __u_int = ::std::os::raw::c_uint;
    pub type __u_long = ::std::os::raw::c_ulong;
    pub type __int8_t = ::std::os::raw::c_schar;
    pub type __uint8_t = ::std::os::raw::c_uchar;
    pub type __int16_t = ::std::os::raw::c_short;
    pub type __uint16_t = ::std::os::raw::c_ushort;
    pub type __int32_t = ::std::os::raw::c_int;
    pub type __uint32_t = ::std::os::raw::c_uint;
    pub type __int64_t = ::std::os::raw::c_long;
    pub type __uint64_t = ::std::os::raw::c_ulong;
    pub type __int_least8_t = __int8_t;
    pub type __uint_least8_t = __uint8_t;
    pub type __int_least16_t = __int16_t;
    pub type __uint_least16_t = __uint16_t;
    pub type __int_least32_t = __int32_t;
    pub type __uint_least32_t = __uint32_t;
    pub type __int_least64_t = __int64_t;
    pub type __uint_least64_t = __uint64_t;
    pub type __quad_t = ::std::os::raw::c_long;
    pub type __u_quad_t = ::std::os::raw::c_ulong;
    pub type __intmax_t = ::std::os::raw::c_long;
    pub type __uintmax_t = ::std::os::raw::c_ulong;
    pub type __dev_t = ::std::os::raw::c_ulong;
    pub type __uid_t = ::std::os::raw::c_uint;
    pub type __gid_t = ::std::os::raw::c_uint;
    pub type __ino_t = ::std::os::raw::c_ulong;
    pub type __ino64_t = ::std::os::raw::c_ulong;
    pub type __mode_t = ::std::os::raw::c_uint;
    pub type __nlink_t = ::std::os::raw::c_ulong;
    pub type __off_t = ::std::os::raw::c_long;
    pub type __off64_t = ::std::os::raw::c_long;
    pub type __pid_t = ::std::os::raw::c_int;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __fsid_t {
        pub __val: [::std::os::raw::c_int; 2usize],
    }
    #[test]
    fn bindgen_test_layout___fsid_t() {
        assert_eq!(
            ::std::mem::size_of::<__fsid_t>(),
            8usize,
            concat!("Size of: ", stringify!(__fsid_t))
        );
        assert_eq!(
            ::std::mem::align_of::<__fsid_t>(),
            4usize,
            concat!("Alignment of ", stringify!(__fsid_t))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<__fsid_t>())).__val as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__fsid_t),
                "::",
                stringify!(__val)
            )
        );
    }
    pub type __clock_t = ::std::os::raw::c_long;
    pub type __rlim_t = ::std::os::raw::c_ulong;
    pub type __rlim64_t = ::std::os::raw::c_ulong;
    pub type __id_t = ::std::os::raw::c_uint;
    pub type __time_t = ::std::os::raw::c_long;
    pub type __useconds_t = ::std::os::raw::c_uint;
    pub type __suseconds_t = ::std::os::raw::c_long;
    pub type __daddr_t = ::std::os::raw::c_int;
    pub type __key_t = ::std::os::raw::c_int;
    pub type __clockid_t = ::std::os::raw::c_int;
    pub type __timer_t = *mut ::std::os::raw::c_void;
    pub type __blksize_t = ::std::os::raw::c_long;
    pub type __blkcnt_t = ::std::os::raw::c_long;
    pub type __blkcnt64_t = ::std::os::raw::c_long;
    pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
    pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
    pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
    pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
    pub type __fsword_t = ::std::os::raw::c_long;
    pub type __ssize_t = ::std::os::raw::c_long;
    pub type __syscall_slong_t = ::std::os::raw::c_long;
    pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
    pub type __loff_t = __off64_t;
    pub type __caddr_t = *mut ::std::os::raw::c_char;
    pub type __intptr_t = ::std::os::raw::c_long;
    pub type __socklen_t = ::std::os::raw::c_uint;
    pub type __sig_atomic_t = ::std::os::raw::c_int;
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub struct __mbstate_t {
        pub __count: ::std::os::raw::c_int,
        pub __value: __mbstate_t__bindgen_ty_1,
    }
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub union __mbstate_t__bindgen_ty_1 {
        pub __wch: ::std::os::raw::c_uint,
        pub __wchb: [::std::os::raw::c_char; 4usize],
        _bindgen_union_align: u32,
    }
    #[test]
    fn bindgen_test_layout___mbstate_t__bindgen_ty_1() {
        assert_eq!(
            ::std::mem::size_of::<__mbstate_t__bindgen_ty_1>(),
            4usize,
            concat!("Size of: ", stringify!(__mbstate_t__bindgen_ty_1))
        );
        assert_eq!(
            ::std::mem::align_of::<__mbstate_t__bindgen_ty_1>(),
            4usize,
            concat!("Alignment of ", stringify!(__mbstate_t__bindgen_ty_1))
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<__mbstate_t__bindgen_ty_1>())).__wch as *const _ as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__mbstate_t__bindgen_ty_1),
                "::",
                stringify!(__wch)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<__mbstate_t__bindgen_ty_1>())).__wchb as *const _ as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__mbstate_t__bindgen_ty_1),
                "::",
                stringify!(__wchb)
            )
        );
    }
    impl Default for __mbstate_t__bindgen_ty_1 {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    impl ::std::fmt::Debug for __mbstate_t__bindgen_ty_1 {
        fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
            write!(f, "__mbstate_t__bindgen_ty_1 {{ union }}")
        }
    }
    #[test]
    fn bindgen_test_layout___mbstate_t() {
        assert_eq!(
            ::std::mem::size_of::<__mbstate_t>(),
            8usize,
            concat!("Size of: ", stringify!(__mbstate_t))
        );
        assert_eq!(
            ::std::mem::align_of::<__mbstate_t>(),
            4usize,
            concat!("Alignment of ", stringify!(__mbstate_t))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<__mbstate_t>())).__count as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__mbstate_t),
                "::",
                stringify!(__count)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<__mbstate_t>())).__value as *const _ as usize },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(__mbstate_t),
                "::",
                stringify!(__value)
            )
        );
    }
    impl Default for __mbstate_t {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    impl ::std::fmt::Debug for __mbstate_t {
        fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
            write!(
                f,
                "__mbstate_t {{ __count: {:?}, __value: {:?} }}",
                self.__count, self.__value
            )
        }
    }
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub struct _G_fpos_t {
        pub __pos: __off_t,
        pub __state: __mbstate_t,
    }
    #[test]
    fn bindgen_test_layout__G_fpos_t() {
        assert_eq!(
            ::std::mem::size_of::<_G_fpos_t>(),
            16usize,
            concat!("Size of: ", stringify!(_G_fpos_t))
        );
        assert_eq!(
            ::std::mem::align_of::<_G_fpos_t>(),
            8usize,
            concat!("Alignment of ", stringify!(_G_fpos_t))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_G_fpos_t>())).__pos as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(_G_fpos_t),
                "::",
                stringify!(__pos)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_G_fpos_t>())).__state as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(_G_fpos_t),
                "::",
                stringify!(__state)
            )
        );
    }
    impl Default for _G_fpos_t {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    impl ::std::fmt::Debug for _G_fpos_t {
        fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
            write!(
                f,
                "_G_fpos_t {{ __pos: {:?}, __state: {:?} }}",
                self.__pos, self.__state
            )
        }
    }
    pub type __fpos_t = _G_fpos_t;
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub struct _G_fpos64_t {
        pub __pos: __off64_t,
        pub __state: __mbstate_t,
    }
    #[test]
    fn bindgen_test_layout__G_fpos64_t() {
        assert_eq!(
            ::std::mem::size_of::<_G_fpos64_t>(),
            16usize,
            concat!("Size of: ", stringify!(_G_fpos64_t))
        );
        assert_eq!(
            ::std::mem::align_of::<_G_fpos64_t>(),
            8usize,
            concat!("Alignment of ", stringify!(_G_fpos64_t))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_G_fpos64_t>())).__pos as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(_G_fpos64_t),
                "::",
                stringify!(__pos)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_G_fpos64_t>())).__state as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(_G_fpos64_t),
                "::",
                stringify!(__state)
            )
        );
    }
    impl Default for _G_fpos64_t {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    impl ::std::fmt::Debug for _G_fpos64_t {
        fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
            write!(
                f,
                "_G_fpos64_t {{ __pos: {:?}, __state: {:?} }}",
                self.__pos, self.__state
            )
        }
    }
    pub type __fpos64_t = _G_fpos64_t;
    pub type __FILE = _IO_FILE;
    pub type FILE = _IO_FILE;
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct _IO_marker {
        _unused: [u8; 0],
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct _IO_codecvt {
        _unused: [u8; 0],
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct _IO_wide_data {
        _unused: [u8; 0],
    }
    pub type _IO_lock_t = ::std::os::raw::c_void;
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct _IO_FILE {
        pub _flags: ::std::os::raw::c_int,
        pub _IO_read_ptr: *mut ::std::os::raw::c_char,
        pub _IO_read_end: *mut ::std::os::raw::c_char,
        pub _IO_read_base: *mut ::std::os::raw::c_char,
        pub _IO_write_base: *mut ::std::os::raw::c_char,
        pub _IO_write_ptr: *mut ::std::os::raw::c_char,
        pub _IO_write_end: *mut ::std::os::raw::c_char,
        pub _IO_buf_base: *mut ::std::os::raw::c_char,
        pub _IO_buf_end: *mut ::std::os::raw::c_char,
        pub _IO_save_base: *mut ::std::os::raw::c_char,
        pub _IO_backup_base: *mut ::std::os::raw::c_char,
        pub _IO_save_end: *mut ::std::os::raw::c_char,
        pub _markers: *mut _IO_marker,
        pub _chain: *mut _IO_FILE,
        pub _fileno: ::std::os::raw::c_int,
        pub _flags2: ::std::os::raw::c_int,
        pub _old_offset: __off_t,
        pub _cur_column: ::std::os::raw::c_ushort,
        pub _vtable_offset: ::std::os::raw::c_schar,
        pub _shortbuf: [::std::os::raw::c_char; 1usize],
        pub _lock: *mut _IO_lock_t,
        pub _offset: __off64_t,
        pub _codecvt: *mut _IO_codecvt,
        pub _wide_data: *mut _IO_wide_data,
        pub _freeres_list: *mut _IO_FILE,
        pub _freeres_buf: *mut ::std::os::raw::c_void,
        pub __pad5: usize,
        pub _mode: ::std::os::raw::c_int,
        pub _unused2: [::std::os::raw::c_char; 20usize],
    }
    #[test]
    fn bindgen_test_layout__IO_FILE() {
        assert_eq!(
            ::std::mem::size_of::<_IO_FILE>(),
            216usize,
            concat!("Size of: ", stringify!(_IO_FILE))
        );
        assert_eq!(
            ::std::mem::align_of::<_IO_FILE>(),
            8usize,
            concat!("Alignment of ", stringify!(_IO_FILE))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._flags as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_flags)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_read_ptr as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_read_ptr)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_read_end as *const _ as usize },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_read_end)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_read_base as *const _ as usize },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_read_base)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_write_base as *const _ as usize },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_write_base)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_write_ptr as *const _ as usize },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_write_ptr)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_write_end as *const _ as usize },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_write_end)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_buf_base as *const _ as usize },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_buf_base)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_buf_end as *const _ as usize },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_buf_end)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_save_base as *const _ as usize },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_save_base)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_backup_base as *const _ as usize },
            80usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_backup_base)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_save_end as *const _ as usize },
            88usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_save_end)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._markers as *const _ as usize },
            96usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_markers)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._chain as *const _ as usize },
            104usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_chain)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._fileno as *const _ as usize },
            112usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_fileno)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._flags2 as *const _ as usize },
            116usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_flags2)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._old_offset as *const _ as usize },
            120usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_old_offset)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._cur_column as *const _ as usize },
            128usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_cur_column)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._vtable_offset as *const _ as usize },
            130usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_vtable_offset)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._shortbuf as *const _ as usize },
            131usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_shortbuf)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._lock as *const _ as usize },
            136usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_lock)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._offset as *const _ as usize },
            144usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_offset)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._codecvt as *const _ as usize },
            152usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_codecvt)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._wide_data as *const _ as usize },
            160usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_wide_data)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._freeres_list as *const _ as usize },
            168usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_freeres_list)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._freeres_buf as *const _ as usize },
            176usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_freeres_buf)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>())).__pad5 as *const _ as usize },
            184usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(__pad5)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._mode as *const _ as usize },
            192usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_mode)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._unused2 as *const _ as usize },
            196usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_unused2)
            )
        );
    }
    impl Default for _IO_FILE {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    pub type fpos_t = __fpos_t;
    extern "C" {
        pub static mut stdin: *mut FILE;
    }
    extern "C" {
        pub static mut stdout: *mut FILE;
    }
    extern "C" {
        pub static mut stderr: *mut FILE;
    }
    extern "C" {
        pub fn remove(__filename: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn rename(
            __old: *const ::std::os::raw::c_char,
            __new: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn tmpfile() -> *mut FILE;
    }
    extern "C" {
        pub fn tmpnam(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
    }
    extern "C" {
        pub fn fclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn fflush(__stream: *mut FILE) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn fopen(
            __filename: *const ::std::os::raw::c_char,
            __modes: *const ::std::os::raw::c_char,
        ) -> *mut FILE;
    }
    extern "C" {
        pub fn freopen(
            __filename: *const ::std::os::raw::c_char,
            __modes: *const ::std::os::raw::c_char,
            __stream: *mut FILE,
        ) -> *mut FILE;
    }
    extern "C" {
        pub fn setbuf(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char);
    }
    extern "C" {
        pub fn setvbuf(
            __stream: *mut FILE,
            __buf: *mut ::std::os::raw::c_char,
            __modes: ::std::os::raw::c_int,
            __n: usize,
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn fprintf(
            __stream: *mut FILE,
            __format: *const ::std::os::raw::c_char,
            ...
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn printf(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn sprintf(
            __s: *mut ::std::os::raw::c_char,
            __format: *const ::std::os::raw::c_char,
            ...
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn vfprintf(
            __s: *mut FILE,
            __format: *const ::std::os::raw::c_char,
            __arg: *mut __va_list_tag,
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn vprintf(
            __format: *const ::std::os::raw::c_char,
            __arg: *mut __va_list_tag,
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn vsprintf(
            __s: *mut ::std::os::raw::c_char,
            __format: *const ::std::os::raw::c_char,
            __arg: *mut __va_list_tag,
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn snprintf(
            __s: *mut ::std::os::raw::c_char,
            __maxlen: ::std::os::raw::c_ulong,
            __format: *const ::std::os::raw::c_char,
            ...
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn vsnprintf(
            __s: *mut ::std::os::raw::c_char,
            __maxlen: ::std::os::raw::c_ulong,
            __format: *const ::std::os::raw::c_char,
            __arg: *mut __va_list_tag,
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn fscanf(
            __stream: *mut FILE,
            __format: *const ::std::os::raw::c_char,
            ...
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn scanf(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn sscanf(
            __s: *const ::std::os::raw::c_char,
            __format: *const ::std::os::raw::c_char,
            ...
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn vfscanf(
            __s: *mut FILE,
            __format: *const ::std::os::raw::c_char,
            __arg: *mut __va_list_tag,
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn vscanf(
            __format: *const ::std::os::raw::c_char,
            __arg: *mut __va_list_tag,
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn vsscanf(
            __s: *const ::std::os::raw::c_char,
            __format: *const ::std::os::raw::c_char,
            __arg: *mut __va_list_tag,
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn fgetc(__stream: *mut FILE) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn getc(__stream: *mut FILE) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn getchar() -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn fputc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn putc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn putchar(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn fgets(
            __s: *mut ::std::os::raw::c_char,
            __n: ::std::os::raw::c_int,
            __stream: *mut FILE,
        ) -> *mut ::std::os::raw::c_char;
    }
    extern "C" {
        pub fn fputs(
            __s: *const ::std::os::raw::c_char,
            __stream: *mut FILE,
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn puts(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn ungetc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn fread(
            __ptr: *mut ::std::os::raw::c_void,
            __size: ::std::os::raw::c_ulong,
            __n: ::std::os::raw::c_ulong,
            __stream: *mut FILE,
        ) -> ::std::os::raw::c_ulong;
    }
    extern "C" {
        pub fn fwrite(
            __ptr: *const ::std::os::raw::c_void,
            __size: ::std::os::raw::c_ulong,
            __n: ::std::os::raw::c_ulong,
            __s: *mut FILE,
        ) -> ::std::os::raw::c_ulong;
    }
    extern "C" {
        pub fn fseek(
            __stream: *mut FILE,
            __off: ::std::os::raw::c_long,
            __whence: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn ftell(__stream: *mut FILE) -> ::std::os::raw::c_long;
    }
    extern "C" {
        pub fn rewind(__stream: *mut FILE);
    }
    extern "C" {
        pub fn fgetpos(__stream: *mut FILE, __pos: *mut fpos_t) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn fsetpos(__stream: *mut FILE, __pos: *const fpos_t) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn clearerr(__stream: *mut FILE);
    }
    extern "C" {
        pub fn feof(__stream: *mut FILE) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn ferror(__stream: *mut FILE) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn perror(__s: *const ::std::os::raw::c_char);
    }
    extern "C" {
        pub fn __uflow(arg1: *mut FILE) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn __overflow(arg1: *mut FILE, arg2: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
    }
    pub type int_least8_t = __int_least8_t;
    pub type int_least16_t = __int_least16_t;
    pub type int_least32_t = __int_least32_t;
    pub type int_least64_t = __int_least64_t;
    pub type uint_least8_t = __uint_least8_t;
    pub type uint_least16_t = __uint_least16_t;
    pub type uint_least32_t = __uint_least32_t;
    pub type uint_least64_t = __uint_least64_t;
    pub type int_fast8_t = ::std::os::raw::c_schar;
    pub type int_fast16_t = ::std::os::raw::c_long;
    pub type int_fast32_t = ::std::os::raw::c_long;
    pub type int_fast64_t = ::std::os::raw::c_long;
    pub type uint_fast8_t = ::std::os::raw::c_uchar;
    pub type uint_fast16_t = ::std::os::raw::c_ulong;
    pub type uint_fast32_t = ::std::os::raw::c_ulong;
    pub type uint_fast64_t = ::std::os::raw::c_ulong;
    pub type intmax_t = __intmax_t;
    pub type uintmax_t = __uintmax_t;
    pub type ino_t = __ino_t;
    pub type dev_t = __dev_t;
    pub type gid_t = __gid_t;
    pub type mode_t = __mode_t;
    pub type nlink_t = __nlink_t;
    pub type uid_t = __uid_t;
    pub type off_t = __off_t;
    pub type pid_t = __pid_t;
    pub type clockid_t = __clockid_t;
    pub type time_t = __time_t;
    pub type timer_t = __timer_t;
    pub type u_int8_t = ::std::os::raw::c_uchar;
    pub type u_int16_t = ::std::os::raw::c_ushort;
    pub type u_int32_t = ::std::os::raw::c_uint;
    pub type u_int64_t = ::std::os::raw::c_ulong;
    pub type register_t = ::std::os::raw::c_long;
    pub type blkcnt_t = __blkcnt_t;
    pub type fsblkcnt_t = __fsblkcnt_t;
    pub type fsfilcnt_t = __fsfilcnt_t;
    pub const SF_FORMAT_WAV: _bindgen_ty_1 = _bindgen_ty_1::SF_FORMAT_WAV;
    pub const SF_FORMAT_AIFF: _bindgen_ty_1 = _bindgen_ty_1::SF_FORMAT_AIFF;
    pub const SF_FORMAT_AU: _bindgen_ty_1 = _bindgen_ty_1::SF_FORMAT_AU;
    pub const SF_FORMAT_RAW: _bindgen_ty_1 = _bindgen_ty_1::SF_FORMAT_RAW;
    pub const SF_FORMAT_PAF: _bindgen_ty_1 = _bindgen_ty_1::SF_FORMAT_PAF;
    pub const SF_FORMAT_SVX: _bindgen_ty_1 = _bindgen_ty_1::SF_FORMAT_SVX;
    pub const SF_FORMAT_NIST: _bindgen_ty_1 = _bindgen_ty_1::SF_FORMAT_NIST;
    pub const SF_FORMAT_VOC: _bindgen_ty_1 = _bindgen_ty_1::SF_FORMAT_VOC;
    pub const SF_FORMAT_IRCAM: _bindgen_ty_1 = _bindgen_ty_1::SF_FORMAT_IRCAM;
    pub const SF_FORMAT_W64: _bindgen_ty_1 = _bindgen_ty_1::SF_FORMAT_W64;
    pub const SF_FORMAT_MAT4: _bindgen_ty_1 = _bindgen_ty_1::SF_FORMAT_MAT4;
    pub const SF_FORMAT_MAT5: _bindgen_ty_1 = _bindgen_ty_1::SF_FORMAT_MAT5;
    pub const SF_FORMAT_PVF: _bindgen_ty_1 = _bindgen_ty_1::SF_FORMAT_PVF;
    pub const SF_FORMAT_XI: _bindgen_ty_1 = _bindgen_ty_1::SF_FORMAT_XI;
    pub const SF_FORMAT_HTK: _bindgen_ty_1 = _bindgen_ty_1::SF_FORMAT_HTK;
    pub const SF_FORMAT_SDS: _bindgen_ty_1 = _bindgen_ty_1::SF_FORMAT_SDS;
    pub const SF_FORMAT_AVR: _bindgen_ty_1 = _bindgen_ty_1::SF_FORMAT_AVR;
    pub const SF_FORMAT_WAVEX: _bindgen_ty_1 = _bindgen_ty_1::SF_FORMAT_WAVEX;
    pub const SF_FORMAT_SD2: _bindgen_ty_1 = _bindgen_ty_1::SF_FORMAT_SD2;
    pub const SF_FORMAT_FLAC: _bindgen_ty_1 = _bindgen_ty_1::SF_FORMAT_FLAC;
    pub const SF_FORMAT_CAF: _bindgen_ty_1 = _bindgen_ty_1::SF_FORMAT_CAF;
    pub const SF_FORMAT_WVE: _bindgen_ty_1 = _bindgen_ty_1::SF_FORMAT_WVE;
    pub const SF_FORMAT_OGG: _bindgen_ty_1 = _bindgen_ty_1::SF_FORMAT_OGG;
    pub const SF_FORMAT_MPC2K: _bindgen_ty_1 = _bindgen_ty_1::SF_FORMAT_MPC2K;
    pub const SF_FORMAT_RF64: _bindgen_ty_1 = _bindgen_ty_1::SF_FORMAT_RF64;
    pub const SF_FORMAT_PCM_S8: _bindgen_ty_1 = _bindgen_ty_1::SF_FORMAT_PCM_S8;
    pub const SF_FORMAT_PCM_16: _bindgen_ty_1 = _bindgen_ty_1::SF_FORMAT_PCM_16;
    pub const SF_FORMAT_PCM_24: _bindgen_ty_1 = _bindgen_ty_1::SF_FORMAT_PCM_24;
    pub const SF_FORMAT_PCM_32: _bindgen_ty_1 = _bindgen_ty_1::SF_FORMAT_PCM_32;
    pub const SF_FORMAT_PCM_U8: _bindgen_ty_1 = _bindgen_ty_1::SF_FORMAT_PCM_U8;
    pub const SF_FORMAT_FLOAT: _bindgen_ty_1 = _bindgen_ty_1::SF_FORMAT_FLOAT;
    pub const SF_FORMAT_DOUBLE: _bindgen_ty_1 = _bindgen_ty_1::SF_FORMAT_DOUBLE;
    pub const SF_FORMAT_ULAW: _bindgen_ty_1 = _bindgen_ty_1::SF_FORMAT_ULAW;
    pub const SF_FORMAT_ALAW: _bindgen_ty_1 = _bindgen_ty_1::SF_FORMAT_ALAW;
    pub const SF_FORMAT_IMA_ADPCM: _bindgen_ty_1 = _bindgen_ty_1::SF_FORMAT_IMA_ADPCM;
    pub const SF_FORMAT_MS_ADPCM: _bindgen_ty_1 = _bindgen_ty_1::SF_FORMAT_MS_ADPCM;
    pub const SF_FORMAT_GSM610: _bindgen_ty_1 = _bindgen_ty_1::SF_FORMAT_GSM610;
    pub const SF_FORMAT_VOX_ADPCM: _bindgen_ty_1 = _bindgen_ty_1::SF_FORMAT_VOX_ADPCM;
    pub const SF_FORMAT_NMS_ADPCM_16: _bindgen_ty_1 = _bindgen_ty_1::SF_FORMAT_NMS_ADPCM_16;
    pub const SF_FORMAT_NMS_ADPCM_24: _bindgen_ty_1 = _bindgen_ty_1::SF_FORMAT_NMS_ADPCM_24;
    pub const SF_FORMAT_NMS_ADPCM_32: _bindgen_ty_1 = _bindgen_ty_1::SF_FORMAT_NMS_ADPCM_32;
    pub const SF_FORMAT_G721_32: _bindgen_ty_1 = _bindgen_ty_1::SF_FORMAT_G721_32;
    pub const SF_FORMAT_G723_24: _bindgen_ty_1 = _bindgen_ty_1::SF_FORMAT_G723_24;
    pub const SF_FORMAT_G723_40: _bindgen_ty_1 = _bindgen_ty_1::SF_FORMAT_G723_40;
    pub const SF_FORMAT_DWVW_12: _bindgen_ty_1 = _bindgen_ty_1::SF_FORMAT_DWVW_12;
    pub const SF_FORMAT_DWVW_16: _bindgen_ty_1 = _bindgen_ty_1::SF_FORMAT_DWVW_16;
    pub const SF_FORMAT_DWVW_24: _bindgen_ty_1 = _bindgen_ty_1::SF_FORMAT_DWVW_24;
    pub const SF_FORMAT_DWVW_N: _bindgen_ty_1 = _bindgen_ty_1::SF_FORMAT_DWVW_N;
    pub const SF_FORMAT_DPCM_8: _bindgen_ty_1 = _bindgen_ty_1::SF_FORMAT_DPCM_8;
    pub const SF_FORMAT_DPCM_16: _bindgen_ty_1 = _bindgen_ty_1::SF_FORMAT_DPCM_16;
    pub const SF_FORMAT_VORBIS: _bindgen_ty_1 = _bindgen_ty_1::SF_FORMAT_VORBIS;
    pub const SF_FORMAT_ALAC_16: _bindgen_ty_1 = _bindgen_ty_1::SF_FORMAT_ALAC_16;
    pub const SF_FORMAT_ALAC_20: _bindgen_ty_1 = _bindgen_ty_1::SF_FORMAT_ALAC_20;
    pub const SF_FORMAT_ALAC_24: _bindgen_ty_1 = _bindgen_ty_1::SF_FORMAT_ALAC_24;
    pub const SF_FORMAT_ALAC_32: _bindgen_ty_1 = _bindgen_ty_1::SF_FORMAT_ALAC_32;
    pub const SF_ENDIAN_FILE: _bindgen_ty_1 = _bindgen_ty_1::SF_ENDIAN_FILE;
    pub const SF_ENDIAN_LITTLE: _bindgen_ty_1 = _bindgen_ty_1::SF_ENDIAN_LITTLE;
    pub const SF_ENDIAN_BIG: _bindgen_ty_1 = _bindgen_ty_1::SF_ENDIAN_BIG;
    pub const SF_ENDIAN_CPU: _bindgen_ty_1 = _bindgen_ty_1::SF_ENDIAN_CPU;
    pub const SF_FORMAT_SUBMASK: _bindgen_ty_1 = _bindgen_ty_1::SF_FORMAT_SUBMASK;
    pub const SF_FORMAT_TYPEMASK: _bindgen_ty_1 = _bindgen_ty_1::SF_FORMAT_TYPEMASK;
    pub const SF_FORMAT_ENDMASK: _bindgen_ty_1 = _bindgen_ty_1::SF_ENDIAN_CPU;
    #[repr(u32)]
    #[derive(Debug, Copy, Clone, PartialEq, Eq, Hash, PartialOrd, Ord)]
    pub enum _bindgen_ty_1 {
        SF_FORMAT_WAV = 65536,
        SF_FORMAT_AIFF = 131072,
        SF_FORMAT_AU = 196608,
        SF_FORMAT_RAW = 262144,
        SF_FORMAT_PAF = 327680,
        SF_FORMAT_SVX = 393216,
        SF_FORMAT_NIST = 458752,
        SF_FORMAT_VOC = 524288,
        SF_FORMAT_IRCAM = 655360,
        SF_FORMAT_W64 = 720896,
        SF_FORMAT_MAT4 = 786432,
        SF_FORMAT_MAT5 = 851968,
        SF_FORMAT_PVF = 917504,
        SF_FORMAT_XI = 983040,
        SF_FORMAT_HTK = 1048576,
        SF_FORMAT_SDS = 1114112,
        SF_FORMAT_AVR = 1179648,
        SF_FORMAT_WAVEX = 1245184,
        SF_FORMAT_SD2 = 1441792,
        SF_FORMAT_FLAC = 1507328,
        SF_FORMAT_CAF = 1572864,
        SF_FORMAT_WVE = 1638400,
        SF_FORMAT_OGG = 2097152,
        SF_FORMAT_MPC2K = 2162688,
        SF_FORMAT_RF64 = 2228224,
        SF_FORMAT_PCM_S8 = 1,
        SF_FORMAT_PCM_16 = 2,
        SF_FORMAT_PCM_24 = 3,
        SF_FORMAT_PCM_32 = 4,
        SF_FORMAT_PCM_U8 = 5,
        SF_FORMAT_FLOAT = 6,
        SF_FORMAT_DOUBLE = 7,
        SF_FORMAT_ULAW = 16,
        SF_FORMAT_ALAW = 17,
        SF_FORMAT_IMA_ADPCM = 18,
        SF_FORMAT_MS_ADPCM = 19,
        SF_FORMAT_GSM610 = 32,
        SF_FORMAT_VOX_ADPCM = 33,
        SF_FORMAT_NMS_ADPCM_16 = 34,
        SF_FORMAT_NMS_ADPCM_24 = 35,
        SF_FORMAT_NMS_ADPCM_32 = 36,
        SF_FORMAT_G721_32 = 48,
        SF_FORMAT_G723_24 = 49,
        SF_FORMAT_G723_40 = 50,
        SF_FORMAT_DWVW_12 = 64,
        SF_FORMAT_DWVW_16 = 65,
        SF_FORMAT_DWVW_24 = 66,
        SF_FORMAT_DWVW_N = 67,
        SF_FORMAT_DPCM_8 = 80,
        SF_FORMAT_DPCM_16 = 81,
        SF_FORMAT_VORBIS = 96,
        SF_FORMAT_ALAC_16 = 112,
        SF_FORMAT_ALAC_20 = 113,
        SF_FORMAT_ALAC_24 = 114,
        SF_FORMAT_ALAC_32 = 115,
        SF_ENDIAN_FILE = 0,
        SF_ENDIAN_LITTLE = 268435456,
        SF_ENDIAN_BIG = 536870912,
        SF_ENDIAN_CPU = 805306368,
        SF_FORMAT_SUBMASK = 65535,
        SF_FORMAT_TYPEMASK = 268369920,
    }
    pub const SFC_GET_LIB_VERSION: _bindgen_ty_2 = _bindgen_ty_2::SFC_GET_LIB_VERSION;
    pub const SFC_GET_LOG_INFO: _bindgen_ty_2 = _bindgen_ty_2::SFC_GET_LOG_INFO;
    pub const SFC_GET_CURRENT_SF_INFO: _bindgen_ty_2 = _bindgen_ty_2::SFC_GET_CURRENT_SF_INFO;
    pub const SFC_GET_NORM_DOUBLE: _bindgen_ty_2 = _bindgen_ty_2::SFC_GET_NORM_DOUBLE;
    pub const SFC_GET_NORM_FLOAT: _bindgen_ty_2 = _bindgen_ty_2::SFC_GET_NORM_FLOAT;
    pub const SFC_SET_NORM_DOUBLE: _bindgen_ty_2 = _bindgen_ty_2::SFC_SET_NORM_DOUBLE;
    pub const SFC_SET_NORM_FLOAT: _bindgen_ty_2 = _bindgen_ty_2::SFC_SET_NORM_FLOAT;
    pub const SFC_SET_SCALE_FLOAT_INT_READ: _bindgen_ty_2 =
        _bindgen_ty_2::SFC_SET_SCALE_FLOAT_INT_READ;
    pub const SFC_SET_SCALE_INT_FLOAT_WRITE: _bindgen_ty_2 =
        _bindgen_ty_2::SFC_SET_SCALE_INT_FLOAT_WRITE;
    pub const SFC_GET_SIMPLE_FORMAT_COUNT: _bindgen_ty_2 =
        _bindgen_ty_2::SFC_GET_SIMPLE_FORMAT_COUNT;
    pub const SFC_GET_SIMPLE_FORMAT: _bindgen_ty_2 = _bindgen_ty_2::SFC_GET_SIMPLE_FORMAT;
    pub const SFC_GET_FORMAT_INFO: _bindgen_ty_2 = _bindgen_ty_2::SFC_GET_FORMAT_INFO;
    pub const SFC_GET_FORMAT_MAJOR_COUNT: _bindgen_ty_2 = _bindgen_ty_2::SFC_GET_FORMAT_MAJOR_COUNT;
    pub const SFC_GET_FORMAT_MAJOR: _bindgen_ty_2 = _bindgen_ty_2::SFC_GET_FORMAT_MAJOR;
    pub const SFC_GET_FORMAT_SUBTYPE_COUNT: _bindgen_ty_2 =
        _bindgen_ty_2::SFC_GET_FORMAT_SUBTYPE_COUNT;
    pub const SFC_GET_FORMAT_SUBTYPE: _bindgen_ty_2 = _bindgen_ty_2::SFC_GET_FORMAT_SUBTYPE;
    pub const SFC_CALC_SIGNAL_MAX: _bindgen_ty_2 = _bindgen_ty_2::SFC_CALC_SIGNAL_MAX;
    pub const SFC_CALC_NORM_SIGNAL_MAX: _bindgen_ty_2 = _bindgen_ty_2::SFC_CALC_NORM_SIGNAL_MAX;
    pub const SFC_CALC_MAX_ALL_CHANNELS: _bindgen_ty_2 = _bindgen_ty_2::SFC_CALC_MAX_ALL_CHANNELS;
    pub const SFC_CALC_NORM_MAX_ALL_CHANNELS: _bindgen_ty_2 =
        _bindgen_ty_2::SFC_CALC_NORM_MAX_ALL_CHANNELS;
    pub const SFC_GET_SIGNAL_MAX: _bindgen_ty_2 = _bindgen_ty_2::SFC_GET_SIGNAL_MAX;
    pub const SFC_GET_MAX_ALL_CHANNELS: _bindgen_ty_2 = _bindgen_ty_2::SFC_GET_MAX_ALL_CHANNELS;
    pub const SFC_SET_ADD_PEAK_CHUNK: _bindgen_ty_2 = _bindgen_ty_2::SFC_SET_ADD_PEAK_CHUNK;
    pub const SFC_UPDATE_HEADER_NOW: _bindgen_ty_2 = _bindgen_ty_2::SFC_UPDATE_HEADER_NOW;
    pub const SFC_SET_UPDATE_HEADER_AUTO: _bindgen_ty_2 = _bindgen_ty_2::SFC_SET_UPDATE_HEADER_AUTO;
    pub const SFC_FILE_TRUNCATE: _bindgen_ty_2 = _bindgen_ty_2::SFC_FILE_TRUNCATE;
    pub const SFC_SET_RAW_START_OFFSET: _bindgen_ty_2 = _bindgen_ty_2::SFC_SET_RAW_START_OFFSET;
    pub const SFC_SET_DITHER_ON_WRITE: _bindgen_ty_2 = _bindgen_ty_2::SFC_SET_DITHER_ON_WRITE;
    pub const SFC_SET_DITHER_ON_READ: _bindgen_ty_2 = _bindgen_ty_2::SFC_SET_DITHER_ON_READ;
    pub const SFC_GET_DITHER_INFO_COUNT: _bindgen_ty_2 = _bindgen_ty_2::SFC_GET_DITHER_INFO_COUNT;
    pub const SFC_GET_DITHER_INFO: _bindgen_ty_2 = _bindgen_ty_2::SFC_GET_DITHER_INFO;
    pub const SFC_GET_EMBED_FILE_INFO: _bindgen_ty_2 = _bindgen_ty_2::SFC_GET_EMBED_FILE_INFO;
    pub const SFC_SET_CLIPPING: _bindgen_ty_2 = _bindgen_ty_2::SFC_SET_CLIPPING;
    pub const SFC_GET_CLIPPING: _bindgen_ty_2 = _bindgen_ty_2::SFC_GET_CLIPPING;
    pub const SFC_GET_CUE_COUNT: _bindgen_ty_2 = _bindgen_ty_2::SFC_GET_CUE_COUNT;
    pub const SFC_GET_CUE: _bindgen_ty_2 = _bindgen_ty_2::SFC_GET_CUE;
    pub const SFC_SET_CUE: _bindgen_ty_2 = _bindgen_ty_2::SFC_SET_CUE;
    pub const SFC_GET_INSTRUMENT: _bindgen_ty_2 = _bindgen_ty_2::SFC_GET_INSTRUMENT;
    pub const SFC_SET_INSTRUMENT: _bindgen_ty_2 = _bindgen_ty_2::SFC_SET_INSTRUMENT;
    pub const SFC_GET_LOOP_INFO: _bindgen_ty_2 = _bindgen_ty_2::SFC_GET_LOOP_INFO;
    pub const SFC_GET_BROADCAST_INFO: _bindgen_ty_2 = _bindgen_ty_2::SFC_GET_BROADCAST_INFO;
    pub const SFC_SET_BROADCAST_INFO: _bindgen_ty_2 = _bindgen_ty_2::SFC_SET_BROADCAST_INFO;
    pub const SFC_GET_CHANNEL_MAP_INFO: _bindgen_ty_2 = _bindgen_ty_2::SFC_GET_CHANNEL_MAP_INFO;
    pub const SFC_SET_CHANNEL_MAP_INFO: _bindgen_ty_2 = _bindgen_ty_2::SFC_SET_CHANNEL_MAP_INFO;
    pub const SFC_RAW_DATA_NEEDS_ENDSWAP: _bindgen_ty_2 = _bindgen_ty_2::SFC_RAW_DATA_NEEDS_ENDSWAP;
    pub const SFC_WAVEX_SET_AMBISONIC: _bindgen_ty_2 = _bindgen_ty_2::SFC_WAVEX_SET_AMBISONIC;
    pub const SFC_WAVEX_GET_AMBISONIC: _bindgen_ty_2 = _bindgen_ty_2::SFC_WAVEX_GET_AMBISONIC;
    pub const SFC_RF64_AUTO_DOWNGRADE: _bindgen_ty_2 = _bindgen_ty_2::SFC_RF64_AUTO_DOWNGRADE;
    pub const SFC_SET_VBR_ENCODING_QUALITY: _bindgen_ty_2 =
        _bindgen_ty_2::SFC_SET_VBR_ENCODING_QUALITY;
    pub const SFC_SET_COMPRESSION_LEVEL: _bindgen_ty_2 = _bindgen_ty_2::SFC_SET_COMPRESSION_LEVEL;
    pub const SFC_SET_CART_INFO: _bindgen_ty_2 = _bindgen_ty_2::SFC_SET_CART_INFO;
    pub const SFC_GET_CART_INFO: _bindgen_ty_2 = _bindgen_ty_2::SFC_GET_CART_INFO;
    pub const SFC_TEST_IEEE_FLOAT_REPLACE: _bindgen_ty_2 =
        _bindgen_ty_2::SFC_TEST_IEEE_FLOAT_REPLACE;
    pub const SFC_SET_ADD_HEADER_PAD_CHUNK: _bindgen_ty_2 =
        _bindgen_ty_2::SFC_SET_ADD_HEADER_PAD_CHUNK;
    pub const SFC_SET_ADD_DITHER_ON_WRITE: _bindgen_ty_2 =
        _bindgen_ty_2::SFC_SET_ADD_DITHER_ON_WRITE;
    pub const SFC_SET_ADD_DITHER_ON_READ: _bindgen_ty_2 = _bindgen_ty_2::SFC_SET_ADD_DITHER_ON_READ;
    #[repr(u32)]
    #[derive(Debug, Copy, Clone, PartialEq, Eq, Hash, PartialOrd, Ord)]
    pub enum _bindgen_ty_2 {
        SFC_GET_LIB_VERSION = 4096,
        SFC_GET_LOG_INFO = 4097,
        SFC_GET_CURRENT_SF_INFO = 4098,
        SFC_GET_NORM_DOUBLE = 4112,
        SFC_GET_NORM_FLOAT = 4113,
        SFC_SET_NORM_DOUBLE = 4114,
        SFC_SET_NORM_FLOAT = 4115,
        SFC_SET_SCALE_FLOAT_INT_READ = 4116,
        SFC_SET_SCALE_INT_FLOAT_WRITE = 4117,
        SFC_GET_SIMPLE_FORMAT_COUNT = 4128,
        SFC_GET_SIMPLE_FORMAT = 4129,
        SFC_GET_FORMAT_INFO = 4136,
        SFC_GET_FORMAT_MAJOR_COUNT = 4144,
        SFC_GET_FORMAT_MAJOR = 4145,
        SFC_GET_FORMAT_SUBTYPE_COUNT = 4146,
        SFC_GET_FORMAT_SUBTYPE = 4147,
        SFC_CALC_SIGNAL_MAX = 4160,
        SFC_CALC_NORM_SIGNAL_MAX = 4161,
        SFC_CALC_MAX_ALL_CHANNELS = 4162,
        SFC_CALC_NORM_MAX_ALL_CHANNELS = 4163,
        SFC_GET_SIGNAL_MAX = 4164,
        SFC_GET_MAX_ALL_CHANNELS = 4165,
        SFC_SET_ADD_PEAK_CHUNK = 4176,
        SFC_UPDATE_HEADER_NOW = 4192,
        SFC_SET_UPDATE_HEADER_AUTO = 4193,
        SFC_FILE_TRUNCATE = 4224,
        SFC_SET_RAW_START_OFFSET = 4240,
        SFC_SET_DITHER_ON_WRITE = 4256,
        SFC_SET_DITHER_ON_READ = 4257,
        SFC_GET_DITHER_INFO_COUNT = 4258,
        SFC_GET_DITHER_INFO = 4259,
        SFC_GET_EMBED_FILE_INFO = 4272,
        SFC_SET_CLIPPING = 4288,
        SFC_GET_CLIPPING = 4289,
        SFC_GET_CUE_COUNT = 4301,
        SFC_GET_CUE = 4302,
        SFC_SET_CUE = 4303,
        SFC_GET_INSTRUMENT = 4304,
        SFC_SET_INSTRUMENT = 4305,
        SFC_GET_LOOP_INFO = 4320,
        SFC_GET_BROADCAST_INFO = 4336,
        SFC_SET_BROADCAST_INFO = 4337,
        SFC_GET_CHANNEL_MAP_INFO = 4352,
        SFC_SET_CHANNEL_MAP_INFO = 4353,
        SFC_RAW_DATA_NEEDS_ENDSWAP = 4368,
        SFC_WAVEX_SET_AMBISONIC = 4608,
        SFC_WAVEX_GET_AMBISONIC = 4609,
        SFC_RF64_AUTO_DOWNGRADE = 4624,
        SFC_SET_VBR_ENCODING_QUALITY = 4864,
        SFC_SET_COMPRESSION_LEVEL = 4865,
        SFC_SET_CART_INFO = 5120,
        SFC_GET_CART_INFO = 5121,
        SFC_TEST_IEEE_FLOAT_REPLACE = 24577,
        SFC_SET_ADD_HEADER_PAD_CHUNK = 4177,
        SFC_SET_ADD_DITHER_ON_WRITE = 4208,
        SFC_SET_ADD_DITHER_ON_READ = 4209,
    }
    pub const SF_STR_TITLE: _bindgen_ty_3 = _bindgen_ty_3::SF_STR_TITLE;
    pub const SF_STR_COPYRIGHT: _bindgen_ty_3 = _bindgen_ty_3::SF_STR_COPYRIGHT;
    pub const SF_STR_SOFTWARE: _bindgen_ty_3 = _bindgen_ty_3::SF_STR_SOFTWARE;
    pub const SF_STR_ARTIST: _bindgen_ty_3 = _bindgen_ty_3::SF_STR_ARTIST;
    pub const SF_STR_COMMENT: _bindgen_ty_3 = _bindgen_ty_3::SF_STR_COMMENT;
    pub const SF_STR_DATE: _bindgen_ty_3 = _bindgen_ty_3::SF_STR_DATE;
    pub const SF_STR_ALBUM: _bindgen_ty_3 = _bindgen_ty_3::SF_STR_ALBUM;
    pub const SF_STR_LICENSE: _bindgen_ty_3 = _bindgen_ty_3::SF_STR_LICENSE;
    pub const SF_STR_TRACKNUMBER: _bindgen_ty_3 = _bindgen_ty_3::SF_STR_TRACKNUMBER;
    pub const SF_STR_GENRE: _bindgen_ty_3 = _bindgen_ty_3::SF_STR_GENRE;
    #[repr(u32)]
    #[derive(Debug, Copy, Clone, PartialEq, Eq, Hash, PartialOrd, Ord)]
    pub enum _bindgen_ty_3 {
        SF_STR_TITLE = 1,
        SF_STR_COPYRIGHT = 2,
        SF_STR_SOFTWARE = 3,
        SF_STR_ARTIST = 4,
        SF_STR_COMMENT = 5,
        SF_STR_DATE = 6,
        SF_STR_ALBUM = 7,
        SF_STR_LICENSE = 8,
        SF_STR_TRACKNUMBER = 9,
        SF_STR_GENRE = 16,
    }
    pub const SF_FALSE: _bindgen_ty_4 = _bindgen_ty_4::SF_FALSE;
    pub const SF_TRUE: _bindgen_ty_4 = _bindgen_ty_4::SF_TRUE;
    pub const SFM_READ: _bindgen_ty_4 = _bindgen_ty_4::SFM_READ;
    pub const SFM_WRITE: _bindgen_ty_4 = _bindgen_ty_4::SFM_WRITE;
    pub const SFM_RDWR: _bindgen_ty_4 = _bindgen_ty_4::SFM_RDWR;
    pub const SF_AMBISONIC_NONE: _bindgen_ty_4 = _bindgen_ty_4::SF_AMBISONIC_NONE;
    pub const SF_AMBISONIC_B_FORMAT: _bindgen_ty_4 = _bindgen_ty_4::SF_AMBISONIC_B_FORMAT;
    #[repr(u32)]
    #[derive(Debug, Copy, Clone, PartialEq, Eq, Hash, PartialOrd, Ord)]
    pub enum _bindgen_ty_4 {
        SF_FALSE = 0,
        SF_TRUE = 1,
        SFM_READ = 16,
        SFM_WRITE = 32,
        SFM_RDWR = 48,
        SF_AMBISONIC_NONE = 64,
        SF_AMBISONIC_B_FORMAT = 65,
    }
    pub const SF_ERR_NO_ERROR: _bindgen_ty_5 = _bindgen_ty_5::SF_ERR_NO_ERROR;
    pub const SF_ERR_UNRECOGNISED_FORMAT: _bindgen_ty_5 = _bindgen_ty_5::SF_ERR_UNRECOGNISED_FORMAT;
    pub const SF_ERR_SYSTEM: _bindgen_ty_5 = _bindgen_ty_5::SF_ERR_SYSTEM;
    pub const SF_ERR_MALFORMED_FILE: _bindgen_ty_5 = _bindgen_ty_5::SF_ERR_MALFORMED_FILE;
    pub const SF_ERR_UNSUPPORTED_ENCODING: _bindgen_ty_5 =
        _bindgen_ty_5::SF_ERR_UNSUPPORTED_ENCODING;
    #[repr(u32)]
    #[derive(Debug, Copy, Clone, PartialEq, Eq, Hash, PartialOrd, Ord)]
    pub enum _bindgen_ty_5 {
        SF_ERR_NO_ERROR = 0,
        SF_ERR_UNRECOGNISED_FORMAT = 1,
        SF_ERR_SYSTEM = 2,
        SF_ERR_MALFORMED_FILE = 3,
        SF_ERR_UNSUPPORTED_ENCODING = 4,
    }
    pub const SF_CHANNEL_MAP_INVALID: _bindgen_ty_6 = _bindgen_ty_6::SF_CHANNEL_MAP_INVALID;
    pub const SF_CHANNEL_MAP_MONO: _bindgen_ty_6 = _bindgen_ty_6::SF_CHANNEL_MAP_MONO;
    pub const SF_CHANNEL_MAP_LEFT: _bindgen_ty_6 = _bindgen_ty_6::SF_CHANNEL_MAP_LEFT;
    pub const SF_CHANNEL_MAP_RIGHT: _bindgen_ty_6 = _bindgen_ty_6::SF_CHANNEL_MAP_RIGHT;
    pub const SF_CHANNEL_MAP_CENTER: _bindgen_ty_6 = _bindgen_ty_6::SF_CHANNEL_MAP_CENTER;
    pub const SF_CHANNEL_MAP_FRONT_LEFT: _bindgen_ty_6 = _bindgen_ty_6::SF_CHANNEL_MAP_FRONT_LEFT;
    pub const SF_CHANNEL_MAP_FRONT_RIGHT: _bindgen_ty_6 = _bindgen_ty_6::SF_CHANNEL_MAP_FRONT_RIGHT;
    pub const SF_CHANNEL_MAP_FRONT_CENTER: _bindgen_ty_6 =
        _bindgen_ty_6::SF_CHANNEL_MAP_FRONT_CENTER;
    pub const SF_CHANNEL_MAP_REAR_CENTER: _bindgen_ty_6 = _bindgen_ty_6::SF_CHANNEL_MAP_REAR_CENTER;
    pub const SF_CHANNEL_MAP_REAR_LEFT: _bindgen_ty_6 = _bindgen_ty_6::SF_CHANNEL_MAP_REAR_LEFT;
    pub const SF_CHANNEL_MAP_REAR_RIGHT: _bindgen_ty_6 = _bindgen_ty_6::SF_CHANNEL_MAP_REAR_RIGHT;
    pub const SF_CHANNEL_MAP_LFE: _bindgen_ty_6 = _bindgen_ty_6::SF_CHANNEL_MAP_LFE;
    pub const SF_CHANNEL_MAP_FRONT_LEFT_OF_CENTER: _bindgen_ty_6 =
        _bindgen_ty_6::SF_CHANNEL_MAP_FRONT_LEFT_OF_CENTER;
    pub const SF_CHANNEL_MAP_FRONT_RIGHT_OF_CENTER: _bindgen_ty_6 =
        _bindgen_ty_6::SF_CHANNEL_MAP_FRONT_RIGHT_OF_CENTER;
    pub const SF_CHANNEL_MAP_SIDE_LEFT: _bindgen_ty_6 = _bindgen_ty_6::SF_CHANNEL_MAP_SIDE_LEFT;
    pub const SF_CHANNEL_MAP_SIDE_RIGHT: _bindgen_ty_6 = _bindgen_ty_6::SF_CHANNEL_MAP_SIDE_RIGHT;
    pub const SF_CHANNEL_MAP_TOP_CENTER: _bindgen_ty_6 = _bindgen_ty_6::SF_CHANNEL_MAP_TOP_CENTER;
    pub const SF_CHANNEL_MAP_TOP_FRONT_LEFT: _bindgen_ty_6 =
        _bindgen_ty_6::SF_CHANNEL_MAP_TOP_FRONT_LEFT;
    pub const SF_CHANNEL_MAP_TOP_FRONT_RIGHT: _bindgen_ty_6 =
        _bindgen_ty_6::SF_CHANNEL_MAP_TOP_FRONT_RIGHT;
    pub const SF_CHANNEL_MAP_TOP_FRONT_CENTER: _bindgen_ty_6 =
        _bindgen_ty_6::SF_CHANNEL_MAP_TOP_FRONT_CENTER;
    pub const SF_CHANNEL_MAP_TOP_REAR_LEFT: _bindgen_ty_6 =
        _bindgen_ty_6::SF_CHANNEL_MAP_TOP_REAR_LEFT;
    pub const SF_CHANNEL_MAP_TOP_REAR_RIGHT: _bindgen_ty_6 =
        _bindgen_ty_6::SF_CHANNEL_MAP_TOP_REAR_RIGHT;
    pub const SF_CHANNEL_MAP_TOP_REAR_CENTER: _bindgen_ty_6 =
        _bindgen_ty_6::SF_CHANNEL_MAP_TOP_REAR_CENTER;
    pub const SF_CHANNEL_MAP_AMBISONIC_B_W: _bindgen_ty_6 =
        _bindgen_ty_6::SF_CHANNEL_MAP_AMBISONIC_B_W;
    pub const SF_CHANNEL_MAP_AMBISONIC_B_X: _bindgen_ty_6 =
        _bindgen_ty_6::SF_CHANNEL_MAP_AMBISONIC_B_X;
    pub const SF_CHANNEL_MAP_AMBISONIC_B_Y: _bindgen_ty_6 =
        _bindgen_ty_6::SF_CHANNEL_MAP_AMBISONIC_B_Y;
    pub const SF_CHANNEL_MAP_AMBISONIC_B_Z: _bindgen_ty_6 =
        _bindgen_ty_6::SF_CHANNEL_MAP_AMBISONIC_B_Z;
    pub const SF_CHANNEL_MAP_MAX: _bindgen_ty_6 = _bindgen_ty_6::SF_CHANNEL_MAP_MAX;
    #[repr(u32)]
    #[derive(Debug, Copy, Clone, PartialEq, Eq, Hash, PartialOrd, Ord)]
    pub enum _bindgen_ty_6 {
        SF_CHANNEL_MAP_INVALID = 0,
        SF_CHANNEL_MAP_MONO = 1,
        SF_CHANNEL_MAP_LEFT = 2,
        SF_CHANNEL_MAP_RIGHT = 3,
        SF_CHANNEL_MAP_CENTER = 4,
        SF_CHANNEL_MAP_FRONT_LEFT = 5,
        SF_CHANNEL_MAP_FRONT_RIGHT = 6,
        SF_CHANNEL_MAP_FRONT_CENTER = 7,
        SF_CHANNEL_MAP_REAR_CENTER = 8,
        SF_CHANNEL_MAP_REAR_LEFT = 9,
        SF_CHANNEL_MAP_REAR_RIGHT = 10,
        SF_CHANNEL_MAP_LFE = 11,
        SF_CHANNEL_MAP_FRONT_LEFT_OF_CENTER = 12,
        SF_CHANNEL_MAP_FRONT_RIGHT_OF_CENTER = 13,
        SF_CHANNEL_MAP_SIDE_LEFT = 14,
        SF_CHANNEL_MAP_SIDE_RIGHT = 15,
        SF_CHANNEL_MAP_TOP_CENTER = 16,
        SF_CHANNEL_MAP_TOP_FRONT_LEFT = 17,
        SF_CHANNEL_MAP_TOP_FRONT_RIGHT = 18,
        SF_CHANNEL_MAP_TOP_FRONT_CENTER = 19,
        SF_CHANNEL_MAP_TOP_REAR_LEFT = 20,
        SF_CHANNEL_MAP_TOP_REAR_RIGHT = 21,
        SF_CHANNEL_MAP_TOP_REAR_CENTER = 22,
        SF_CHANNEL_MAP_AMBISONIC_B_W = 23,
        SF_CHANNEL_MAP_AMBISONIC_B_X = 24,
        SF_CHANNEL_MAP_AMBISONIC_B_Y = 25,
        SF_CHANNEL_MAP_AMBISONIC_B_Z = 26,
        SF_CHANNEL_MAP_MAX = 27,
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct SNDFILE_tag {
        _unused: [u8; 0],
    }
    pub type SNDFILE = SNDFILE_tag;
    pub type sf_count_t = i64;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct SF_INFO {
        pub frames: sf_count_t,
        pub samplerate: ::std::os::raw::c_int,
        pub channels: ::std::os::raw::c_int,
        pub format: ::std::os::raw::c_int,
        pub sections: ::std::os::raw::c_int,
        pub seekable: ::std::os::raw::c_int,
    }
    #[test]
    fn bindgen_test_layout_SF_INFO() {
        assert_eq!(
            ::std::mem::size_of::<SF_INFO>(),
            32usize,
            concat!("Size of: ", stringify!(SF_INFO))
        );
        assert_eq!(
            ::std::mem::align_of::<SF_INFO>(),
            8usize,
            concat!("Alignment of ", stringify!(SF_INFO))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SF_INFO>())).frames as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_INFO),
                "::",
                stringify!(frames)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SF_INFO>())).samplerate as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_INFO),
                "::",
                stringify!(samplerate)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SF_INFO>())).channels as *const _ as usize },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_INFO),
                "::",
                stringify!(channels)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SF_INFO>())).format as *const _ as usize },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_INFO),
                "::",
                stringify!(format)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SF_INFO>())).sections as *const _ as usize },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_INFO),
                "::",
                stringify!(sections)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SF_INFO>())).seekable as *const _ as usize },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_INFO),
                "::",
                stringify!(seekable)
            )
        );
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct SF_FORMAT_INFO {
        pub format: ::std::os::raw::c_int,
        pub name: *const ::std::os::raw::c_char,
        pub extension: *const ::std::os::raw::c_char,
    }
    #[test]
    fn bindgen_test_layout_SF_FORMAT_INFO() {
        assert_eq!(
            ::std::mem::size_of::<SF_FORMAT_INFO>(),
            24usize,
            concat!("Size of: ", stringify!(SF_FORMAT_INFO))
        );
        assert_eq!(
            ::std::mem::align_of::<SF_FORMAT_INFO>(),
            8usize,
            concat!("Alignment of ", stringify!(SF_FORMAT_INFO))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SF_FORMAT_INFO>())).format as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_FORMAT_INFO),
                "::",
                stringify!(format)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SF_FORMAT_INFO>())).name as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_FORMAT_INFO),
                "::",
                stringify!(name)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SF_FORMAT_INFO>())).extension as *const _ as usize },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_FORMAT_INFO),
                "::",
                stringify!(extension)
            )
        );
    }
    impl Default for SF_FORMAT_INFO {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    pub const SFD_DEFAULT_LEVEL: _bindgen_ty_7 = _bindgen_ty_7::SFD_DEFAULT_LEVEL;
    pub const SFD_CUSTOM_LEVEL: _bindgen_ty_7 = _bindgen_ty_7::SFD_CUSTOM_LEVEL;
    pub const SFD_NO_DITHER: _bindgen_ty_7 = _bindgen_ty_7::SFD_NO_DITHER;
    pub const SFD_WHITE: _bindgen_ty_7 = _bindgen_ty_7::SFD_WHITE;
    pub const SFD_TRIANGULAR_PDF: _bindgen_ty_7 = _bindgen_ty_7::SFD_TRIANGULAR_PDF;
    #[repr(u32)]
    #[derive(Debug, Copy, Clone, PartialEq, Eq, Hash, PartialOrd, Ord)]
    pub enum _bindgen_ty_7 {
        SFD_DEFAULT_LEVEL = 0,
        SFD_CUSTOM_LEVEL = 1073741824,
        SFD_NO_DITHER = 500,
        SFD_WHITE = 501,
        SFD_TRIANGULAR_PDF = 502,
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, PartialOrd, PartialEq)]
    pub struct SF_DITHER_INFO {
        pub type_: ::std::os::raw::c_int,
        pub level: f64,
        pub name: *const ::std::os::raw::c_char,
    }
    #[test]
    fn bindgen_test_layout_SF_DITHER_INFO() {
        assert_eq!(
            ::std::mem::size_of::<SF_DITHER_INFO>(),
            24usize,
            concat!("Size of: ", stringify!(SF_DITHER_INFO))
        );
        assert_eq!(
            ::std::mem::align_of::<SF_DITHER_INFO>(),
            8usize,
            concat!("Alignment of ", stringify!(SF_DITHER_INFO))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SF_DITHER_INFO>())).type_ as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_DITHER_INFO),
                "::",
                stringify!(type_)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SF_DITHER_INFO>())).level as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_DITHER_INFO),
                "::",
                stringify!(level)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SF_DITHER_INFO>())).name as *const _ as usize },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_DITHER_INFO),
                "::",
                stringify!(name)
            )
        );
    }
    impl Default for SF_DITHER_INFO {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct SF_EMBED_FILE_INFO {
        pub offset: sf_count_t,
        pub length: sf_count_t,
    }
    #[test]
    fn bindgen_test_layout_SF_EMBED_FILE_INFO() {
        assert_eq!(
            ::std::mem::size_of::<SF_EMBED_FILE_INFO>(),
            16usize,
            concat!("Size of: ", stringify!(SF_EMBED_FILE_INFO))
        );
        assert_eq!(
            ::std::mem::align_of::<SF_EMBED_FILE_INFO>(),
            8usize,
            concat!("Alignment of ", stringify!(SF_EMBED_FILE_INFO))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SF_EMBED_FILE_INFO>())).offset as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_EMBED_FILE_INFO),
                "::",
                stringify!(offset)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SF_EMBED_FILE_INFO>())).length as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_EMBED_FILE_INFO),
                "::",
                stringify!(length)
            )
        );
    }
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub struct SF_CUE_POINT {
        pub indx: i32,
        pub position: u32,
        pub fcc_chunk: i32,
        pub chunk_start: i32,
        pub block_start: i32,
        pub sample_offset: u32,
        pub name: [::std::os::raw::c_char; 256usize],
    }
    #[test]
    fn bindgen_test_layout_SF_CUE_POINT() {
        assert_eq!(
            ::std::mem::size_of::<SF_CUE_POINT>(),
            280usize,
            concat!("Size of: ", stringify!(SF_CUE_POINT))
        );
        assert_eq!(
            ::std::mem::align_of::<SF_CUE_POINT>(),
            4usize,
            concat!("Alignment of ", stringify!(SF_CUE_POINT))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SF_CUE_POINT>())).indx as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_CUE_POINT),
                "::",
                stringify!(indx)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SF_CUE_POINT>())).position as *const _ as usize },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_CUE_POINT),
                "::",
                stringify!(position)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SF_CUE_POINT>())).fcc_chunk as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_CUE_POINT),
                "::",
                stringify!(fcc_chunk)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SF_CUE_POINT>())).chunk_start as *const _ as usize },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_CUE_POINT),
                "::",
                stringify!(chunk_start)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SF_CUE_POINT>())).block_start as *const _ as usize },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_CUE_POINT),
                "::",
                stringify!(block_start)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SF_CUE_POINT>())).sample_offset as *const _ as usize },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_CUE_POINT),
                "::",
                stringify!(sample_offset)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SF_CUE_POINT>())).name as *const _ as usize },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_CUE_POINT),
                "::",
                stringify!(name)
            )
        );
    }
    impl Default for SF_CUE_POINT {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    impl ::std::fmt::Debug for SF_CUE_POINT {
        fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
            write ! ( f , "SF_CUE_POINT {{ indx: {:?}, position: {:?}, fcc_chunk: {:?}, chunk_start: {:?}, block_start: {:?}, sample_offset: {:?}, name: [{}] }}" , self . indx , self . position , self . fcc_chunk , self . chunk_start , self . block_start , self . sample_offset , self . name . iter ( ) . enumerate ( ) . map ( | ( i , v ) | format ! ( "{}{:?}" , if i > 0 { ", " } else { "" } , v ) ) . collect :: < String > ( ) )
        }
    }
    impl ::std::cmp::PartialEq for SF_CUE_POINT {
        fn eq(&self, other: &SF_CUE_POINT) -> bool {
            self.indx == other.indx
                && self.position == other.position
                && self.fcc_chunk == other.fcc_chunk
                && self.chunk_start == other.chunk_start
                && self.block_start == other.block_start
                && self.sample_offset == other.sample_offset
                && &self.name[..] == &other.name[..]
        }
    }
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub struct SF_CUES {
        pub cue_count: u32,
        pub cue_points: [SF_CUE_POINT; 100usize],
    }
    #[test]
    fn bindgen_test_layout_SF_CUES() {
        assert_eq!(
            ::std::mem::size_of::<SF_CUES>(),
            28004usize,
            concat!("Size of: ", stringify!(SF_CUES))
        );
        assert_eq!(
            ::std::mem::align_of::<SF_CUES>(),
            4usize,
            concat!("Alignment of ", stringify!(SF_CUES))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SF_CUES>())).cue_count as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_CUES),
                "::",
                stringify!(cue_count)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SF_CUES>())).cue_points as *const _ as usize },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_CUES),
                "::",
                stringify!(cue_points)
            )
        );
    }
    impl Default for SF_CUES {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    impl ::std::fmt::Debug for SF_CUES {
        fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
            write!(
                f,
                "SF_CUES {{ cue_count: {:?}, cue_points: [{}] }}",
                self.cue_count,
                self.cue_points
                    .iter()
                    .enumerate()
                    .map(|(i, v)| format!("{}{:?}", if i > 0 { ", " } else { "" }, v))
                    .collect::<String>()
            )
        }
    }
    pub const SF_LOOP_NONE: _bindgen_ty_8 = _bindgen_ty_8::SF_LOOP_NONE;
    pub const SF_LOOP_FORWARD: _bindgen_ty_8 = _bindgen_ty_8::SF_LOOP_FORWARD;
    pub const SF_LOOP_BACKWARD: _bindgen_ty_8 = _bindgen_ty_8::SF_LOOP_BACKWARD;
    pub const SF_LOOP_ALTERNATING: _bindgen_ty_8 = _bindgen_ty_8::SF_LOOP_ALTERNATING;
    #[repr(u32)]
    #[derive(Debug, Copy, Clone, PartialEq, Eq, Hash, PartialOrd, Ord)]
    pub enum _bindgen_ty_8 {
        SF_LOOP_NONE = 800,
        SF_LOOP_FORWARD = 801,
        SF_LOOP_BACKWARD = 802,
        SF_LOOP_ALTERNATING = 803,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct SF_INSTRUMENT {
        pub gain: ::std::os::raw::c_int,
        pub basenote: ::std::os::raw::c_char,
        pub detune: ::std::os::raw::c_char,
        pub velocity_lo: ::std::os::raw::c_char,
        pub velocity_hi: ::std::os::raw::c_char,
        pub key_lo: ::std::os::raw::c_char,
        pub key_hi: ::std::os::raw::c_char,
        pub loop_count: ::std::os::raw::c_int,
        pub loops: [SF_INSTRUMENT__bindgen_ty_1; 16usize],
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct SF_INSTRUMENT__bindgen_ty_1 {
        pub mode: ::std::os::raw::c_int,
        pub start: u32,
        pub end: u32,
        pub count: u32,
    }
    #[test]
    fn bindgen_test_layout_SF_INSTRUMENT__bindgen_ty_1() {
        assert_eq!(
            ::std::mem::size_of::<SF_INSTRUMENT__bindgen_ty_1>(),
            16usize,
            concat!("Size of: ", stringify!(SF_INSTRUMENT__bindgen_ty_1))
        );
        assert_eq!(
            ::std::mem::align_of::<SF_INSTRUMENT__bindgen_ty_1>(),
            4usize,
            concat!("Alignment of ", stringify!(SF_INSTRUMENT__bindgen_ty_1))
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<SF_INSTRUMENT__bindgen_ty_1>())).mode as *const _ as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_INSTRUMENT__bindgen_ty_1),
                "::",
                stringify!(mode)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<SF_INSTRUMENT__bindgen_ty_1>())).start as *const _ as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_INSTRUMENT__bindgen_ty_1),
                "::",
                stringify!(start)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<SF_INSTRUMENT__bindgen_ty_1>())).end as *const _ as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_INSTRUMENT__bindgen_ty_1),
                "::",
                stringify!(end)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<SF_INSTRUMENT__bindgen_ty_1>())).count as *const _ as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_INSTRUMENT__bindgen_ty_1),
                "::",
                stringify!(count)
            )
        );
    }
    #[test]
    fn bindgen_test_layout_SF_INSTRUMENT() {
        assert_eq!(
            ::std::mem::size_of::<SF_INSTRUMENT>(),
            272usize,
            concat!("Size of: ", stringify!(SF_INSTRUMENT))
        );
        assert_eq!(
            ::std::mem::align_of::<SF_INSTRUMENT>(),
            4usize,
            concat!("Alignment of ", stringify!(SF_INSTRUMENT))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SF_INSTRUMENT>())).gain as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_INSTRUMENT),
                "::",
                stringify!(gain)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SF_INSTRUMENT>())).basenote as *const _ as usize },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_INSTRUMENT),
                "::",
                stringify!(basenote)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SF_INSTRUMENT>())).detune as *const _ as usize },
            5usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_INSTRUMENT),
                "::",
                stringify!(detune)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SF_INSTRUMENT>())).velocity_lo as *const _ as usize },
            6usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_INSTRUMENT),
                "::",
                stringify!(velocity_lo)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SF_INSTRUMENT>())).velocity_hi as *const _ as usize },
            7usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_INSTRUMENT),
                "::",
                stringify!(velocity_hi)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SF_INSTRUMENT>())).key_lo as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_INSTRUMENT),
                "::",
                stringify!(key_lo)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SF_INSTRUMENT>())).key_hi as *const _ as usize },
            9usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_INSTRUMENT),
                "::",
                stringify!(key_hi)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SF_INSTRUMENT>())).loop_count as *const _ as usize },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_INSTRUMENT),
                "::",
                stringify!(loop_count)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SF_INSTRUMENT>())).loops as *const _ as usize },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_INSTRUMENT),
                "::",
                stringify!(loops)
            )
        );
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, PartialOrd, PartialEq)]
    pub struct SF_LOOP_INFO {
        pub time_sig_num: ::std::os::raw::c_short,
        pub time_sig_den: ::std::os::raw::c_short,
        pub loop_mode: ::std::os::raw::c_int,
        pub num_beats: ::std::os::raw::c_int,
        pub bpm: f32,
        pub root_key: ::std::os::raw::c_int,
        pub future: [::std::os::raw::c_int; 6usize],
    }
    #[test]
    fn bindgen_test_layout_SF_LOOP_INFO() {
        assert_eq!(
            ::std::mem::size_of::<SF_LOOP_INFO>(),
            44usize,
            concat!("Size of: ", stringify!(SF_LOOP_INFO))
        );
        assert_eq!(
            ::std::mem::align_of::<SF_LOOP_INFO>(),
            4usize,
            concat!("Alignment of ", stringify!(SF_LOOP_INFO))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SF_LOOP_INFO>())).time_sig_num as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_LOOP_INFO),
                "::",
                stringify!(time_sig_num)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SF_LOOP_INFO>())).time_sig_den as *const _ as usize },
            2usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_LOOP_INFO),
                "::",
                stringify!(time_sig_den)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SF_LOOP_INFO>())).loop_mode as *const _ as usize },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_LOOP_INFO),
                "::",
                stringify!(loop_mode)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SF_LOOP_INFO>())).num_beats as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_LOOP_INFO),
                "::",
                stringify!(num_beats)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SF_LOOP_INFO>())).bpm as *const _ as usize },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_LOOP_INFO),
                "::",
                stringify!(bpm)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SF_LOOP_INFO>())).root_key as *const _ as usize },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_LOOP_INFO),
                "::",
                stringify!(root_key)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SF_LOOP_INFO>())).future as *const _ as usize },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_LOOP_INFO),
                "::",
                stringify!(future)
            )
        );
    }
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub struct SF_BROADCAST_INFO {
        pub description: [::std::os::raw::c_char; 256usize],
        pub originator: [::std::os::raw::c_char; 32usize],
        pub originator_reference: [::std::os::raw::c_char; 32usize],
        pub origination_date: [::std::os::raw::c_char; 10usize],
        pub origination_time: [::std::os::raw::c_char; 8usize],
        pub time_reference_low: u32,
        pub time_reference_high: u32,
        pub version: ::std::os::raw::c_short,
        pub umid: [::std::os::raw::c_char; 64usize],
        pub reserved: [::std::os::raw::c_char; 190usize],
        pub coding_history_size: u32,
        pub coding_history: [::std::os::raw::c_char; 256usize],
    }
    #[test]
    fn bindgen_test_layout_SF_BROADCAST_INFO() {
        assert_eq!(
            ::std::mem::size_of::<SF_BROADCAST_INFO>(),
            864usize,
            concat!("Size of: ", stringify!(SF_BROADCAST_INFO))
        );
        assert_eq!(
            ::std::mem::align_of::<SF_BROADCAST_INFO>(),
            4usize,
            concat!("Alignment of ", stringify!(SF_BROADCAST_INFO))
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<SF_BROADCAST_INFO>())).description as *const _ as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_BROADCAST_INFO),
                "::",
                stringify!(description)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<SF_BROADCAST_INFO>())).originator as *const _ as usize
            },
            256usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_BROADCAST_INFO),
                "::",
                stringify!(originator)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<SF_BROADCAST_INFO>())).originator_reference as *const _
                    as usize
            },
            288usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_BROADCAST_INFO),
                "::",
                stringify!(originator_reference)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<SF_BROADCAST_INFO>())).origination_date as *const _ as usize
            },
            320usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_BROADCAST_INFO),
                "::",
                stringify!(origination_date)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<SF_BROADCAST_INFO>())).origination_time as *const _ as usize
            },
            330usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_BROADCAST_INFO),
                "::",
                stringify!(origination_time)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<SF_BROADCAST_INFO>())).time_reference_low as *const _
                    as usize
            },
            340usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_BROADCAST_INFO),
                "::",
                stringify!(time_reference_low)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<SF_BROADCAST_INFO>())).time_reference_high as *const _
                    as usize
            },
            344usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_BROADCAST_INFO),
                "::",
                stringify!(time_reference_high)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SF_BROADCAST_INFO>())).version as *const _ as usize },
            348usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_BROADCAST_INFO),
                "::",
                stringify!(version)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SF_BROADCAST_INFO>())).umid as *const _ as usize },
            350usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_BROADCAST_INFO),
                "::",
                stringify!(umid)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SF_BROADCAST_INFO>())).reserved as *const _ as usize },
            414usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_BROADCAST_INFO),
                "::",
                stringify!(reserved)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<SF_BROADCAST_INFO>())).coding_history_size as *const _
                    as usize
            },
            604usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_BROADCAST_INFO),
                "::",
                stringify!(coding_history_size)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<SF_BROADCAST_INFO>())).coding_history as *const _ as usize
            },
            608usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_BROADCAST_INFO),
                "::",
                stringify!(coding_history)
            )
        );
    }
    impl Default for SF_BROADCAST_INFO {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    impl ::std::fmt::Debug for SF_BROADCAST_INFO {
        fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
            write ! ( f , "SF_BROADCAST_INFO {{ description: [{}], originator: [{}], originator_reference: [{}], origination_date: {:?}, origination_time: {:?}, time_reference_low: {:?}, time_reference_high: {:?}, version: {:?}, umid: [{}], reserved: [{}], coding_history_size: {:?}, coding_history: [{}] }}" , self . description . iter ( ) . enumerate ( ) . map ( | ( i , v ) | format ! ( "{}{:?}" , if i > 0 { ", " } else { "" } , v ) ) . collect :: < String > ( ) , self . originator . iter ( ) . enumerate ( ) . map ( | ( i , v ) | format ! ( "{}{:?}" , if i > 0 { ", " } else { "" } , v ) ) . collect :: < String > ( ) , self . originator_reference . iter ( ) . enumerate ( ) . map ( | ( i , v ) | format ! ( "{}{:?}" , if i > 0 { ", " } else { "" } , v ) ) . collect :: < String > ( ) , self . origination_date , self . origination_time , self . time_reference_low , self . time_reference_high , self . version , self . umid . iter ( ) . enumerate ( ) . map ( | ( i , v ) | format ! ( "{}{:?}" , if i > 0 { ", " } else { "" } , v ) ) . collect :: < String > ( ) , self . reserved . iter ( ) . enumerate ( ) . map ( | ( i , v ) | format ! ( "{}{:?}" , if i > 0 { ", " } else { "" } , v ) ) . collect :: < String > ( ) , self . coding_history_size , self . coding_history . iter ( ) . enumerate ( ) . map ( | ( i , v ) | format ! ( "{}{:?}" , if i > 0 { ", " } else { "" } , v ) ) . collect :: < String > ( ) )
        }
    }
    impl ::std::cmp::PartialEq for SF_BROADCAST_INFO {
        fn eq(&self, other: &SF_BROADCAST_INFO) -> bool {
            &self.description[..] == &other.description[..]
                && self.originator == other.originator
                && self.originator_reference == other.originator_reference
                && self.origination_date == other.origination_date
                && self.origination_time == other.origination_time
                && self.time_reference_low == other.time_reference_low
                && self.time_reference_high == other.time_reference_high
                && self.version == other.version
                && &self.umid[..] == &other.umid[..]
                && &self.reserved[..] == &other.reserved[..]
                && self.coding_history_size == other.coding_history_size
                && &self.coding_history[..] == &other.coding_history[..]
        }
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct SF_CART_TIMER {
        pub usage: [::std::os::raw::c_char; 4usize],
        pub value: i32,
    }
    #[test]
    fn bindgen_test_layout_SF_CART_TIMER() {
        assert_eq!(
            ::std::mem::size_of::<SF_CART_TIMER>(),
            8usize,
            concat!("Size of: ", stringify!(SF_CART_TIMER))
        );
        assert_eq!(
            ::std::mem::align_of::<SF_CART_TIMER>(),
            4usize,
            concat!("Alignment of ", stringify!(SF_CART_TIMER))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SF_CART_TIMER>())).usage as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_CART_TIMER),
                "::",
                stringify!(usage)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SF_CART_TIMER>())).value as *const _ as usize },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_CART_TIMER),
                "::",
                stringify!(value)
            )
        );
    }
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub struct SF_CART_INFO {
        pub version: [::std::os::raw::c_char; 4usize],
        pub title: [::std::os::raw::c_char; 64usize],
        pub artist: [::std::os::raw::c_char; 64usize],
        pub cut_id: [::std::os::raw::c_char; 64usize],
        pub client_id: [::std::os::raw::c_char; 64usize],
        pub category: [::std::os::raw::c_char; 64usize],
        pub classification: [::std::os::raw::c_char; 64usize],
        pub out_cue: [::std::os::raw::c_char; 64usize],
        pub start_date: [::std::os::raw::c_char; 10usize],
        pub start_time: [::std::os::raw::c_char; 8usize],
        pub end_date: [::std::os::raw::c_char; 10usize],
        pub end_time: [::std::os::raw::c_char; 8usize],
        pub producer_app_id: [::std::os::raw::c_char; 64usize],
        pub producer_app_version: [::std::os::raw::c_char; 64usize],
        pub user_def: [::std::os::raw::c_char; 64usize],
        pub level_reference: i32,
        pub post_timers: [SF_CART_TIMER; 8usize],
        pub reserved: [::std::os::raw::c_char; 276usize],
        pub url: [::std::os::raw::c_char; 1024usize],
        pub tag_text_size: u32,
        pub tag_text: [::std::os::raw::c_char; 256usize],
    }
    #[test]
    fn bindgen_test_layout_SF_CART_INFO() {
        assert_eq!(
            ::std::mem::size_of::<SF_CART_INFO>(),
            2308usize,
            concat!("Size of: ", stringify!(SF_CART_INFO))
        );
        assert_eq!(
            ::std::mem::align_of::<SF_CART_INFO>(),
            4usize,
            concat!("Alignment of ", stringify!(SF_CART_INFO))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SF_CART_INFO>())).version as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_CART_INFO),
                "::",
                stringify!(version)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SF_CART_INFO>())).title as *const _ as usize },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_CART_INFO),
                "::",
                stringify!(title)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SF_CART_INFO>())).artist as *const _ as usize },
            68usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_CART_INFO),
                "::",
                stringify!(artist)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SF_CART_INFO>())).cut_id as *const _ as usize },
            132usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_CART_INFO),
                "::",
                stringify!(cut_id)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SF_CART_INFO>())).client_id as *const _ as usize },
            196usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_CART_INFO),
                "::",
                stringify!(client_id)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SF_CART_INFO>())).category as *const _ as usize },
            260usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_CART_INFO),
                "::",
                stringify!(category)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SF_CART_INFO>())).classification as *const _ as usize },
            324usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_CART_INFO),
                "::",
                stringify!(classification)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SF_CART_INFO>())).out_cue as *const _ as usize },
            388usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_CART_INFO),
                "::",
                stringify!(out_cue)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SF_CART_INFO>())).start_date as *const _ as usize },
            452usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_CART_INFO),
                "::",
                stringify!(start_date)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SF_CART_INFO>())).start_time as *const _ as usize },
            462usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_CART_INFO),
                "::",
                stringify!(start_time)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SF_CART_INFO>())).end_date as *const _ as usize },
            470usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_CART_INFO),
                "::",
                stringify!(end_date)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SF_CART_INFO>())).end_time as *const _ as usize },
            480usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_CART_INFO),
                "::",
                stringify!(end_time)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<SF_CART_INFO>())).producer_app_id as *const _ as usize
            },
            488usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_CART_INFO),
                "::",
                stringify!(producer_app_id)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<SF_CART_INFO>())).producer_app_version as *const _ as usize
            },
            552usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_CART_INFO),
                "::",
                stringify!(producer_app_version)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SF_CART_INFO>())).user_def as *const _ as usize },
            616usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_CART_INFO),
                "::",
                stringify!(user_def)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<SF_CART_INFO>())).level_reference as *const _ as usize
            },
            680usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_CART_INFO),
                "::",
                stringify!(level_reference)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SF_CART_INFO>())).post_timers as *const _ as usize },
            684usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_CART_INFO),
                "::",
                stringify!(post_timers)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SF_CART_INFO>())).reserved as *const _ as usize },
            748usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_CART_INFO),
                "::",
                stringify!(reserved)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SF_CART_INFO>())).url as *const _ as usize },
            1024usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_CART_INFO),
                "::",
                stringify!(url)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SF_CART_INFO>())).tag_text_size as *const _ as usize },
            2048usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_CART_INFO),
                "::",
                stringify!(tag_text_size)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SF_CART_INFO>())).tag_text as *const _ as usize },
            2052usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_CART_INFO),
                "::",
                stringify!(tag_text)
            )
        );
    }
    impl Default for SF_CART_INFO {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    impl ::std::fmt::Debug for SF_CART_INFO {
        fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
            write ! ( f , "SF_CART_INFO {{ version: {:?}, title: [{}], artist: [{}], cut_id: [{}], client_id: [{}], category: [{}], classification: [{}], out_cue: [{}], start_date: {:?}, start_time: {:?}, end_date: {:?}, end_time: {:?}, producer_app_id: [{}], producer_app_version: [{}], user_def: [{}], level_reference: {:?}, post_timers: {:?}, reserved: [{}], url: [{}], tag_text_size: {:?}, tag_text: [{}] }}" , self . version , self . title . iter ( ) . enumerate ( ) . map ( | ( i , v ) | format ! ( "{}{:?}" , if i > 0 { ", " } else { "" } , v ) ) . collect :: < String > ( ) , self . artist . iter ( ) . enumerate ( ) . map ( | ( i , v ) | format ! ( "{}{:?}" , if i > 0 { ", " } else { "" } , v ) ) . collect :: < String > ( ) , self . cut_id . iter ( ) . enumerate ( ) . map ( | ( i , v ) | format ! ( "{}{:?}" , if i > 0 { ", " } else { "" } , v ) ) . collect :: < String > ( ) , self . client_id . iter ( ) . enumerate ( ) . map ( | ( i , v ) | format ! ( "{}{:?}" , if i > 0 { ", " } else { "" } , v ) ) . collect :: < String > ( ) , self . category . iter ( ) . enumerate ( ) . map ( | ( i , v ) | format ! ( "{}{:?}" , if i > 0 { ", " } else { "" } , v ) ) . collect :: < String > ( ) , self . classification . iter ( ) . enumerate ( ) . map ( | ( i , v ) | format ! ( "{}{:?}" , if i > 0 { ", " } else { "" } , v ) ) . collect :: < String > ( ) , self . out_cue . iter ( ) . enumerate ( ) . map ( | ( i , v ) | format ! ( "{}{:?}" , if i > 0 { ", " } else { "" } , v ) ) . collect :: < String > ( ) , self . start_date , self . start_time , self . end_date , self . end_time , self . producer_app_id . iter ( ) . enumerate ( ) . map ( | ( i , v ) | format ! ( "{}{:?}" , if i > 0 { ", " } else { "" } , v ) ) . collect :: < String > ( ) , self . producer_app_version . iter ( ) . enumerate ( ) . map ( | ( i , v ) | format ! ( "{}{:?}" , if i > 0 { ", " } else { "" } , v ) ) . collect :: < String > ( ) , self . user_def . iter ( ) . enumerate ( ) . map ( | ( i , v ) | format ! ( "{}{:?}" , if i > 0 { ", " } else { "" } , v ) ) . collect :: < String > ( ) , self . level_reference , self . post_timers , self . reserved . iter ( ) . enumerate ( ) . map ( | ( i , v ) | format ! ( "{}{:?}" , if i > 0 { ", " } else { "" } , v ) ) . collect :: < String > ( ) , self . url . iter ( ) . enumerate ( ) . map ( | ( i , v ) | format ! ( "{}{:?}" , if i > 0 { ", " } else { "" } , v ) ) . collect :: < String > ( ) , self . tag_text_size , self . tag_text . iter ( ) . enumerate ( ) . map ( | ( i , v ) | format ! ( "{}{:?}" , if i > 0 { ", " } else { "" } , v ) ) . collect :: < String > ( ) )
        }
    }
    impl ::std::cmp::PartialEq for SF_CART_INFO {
        fn eq(&self, other: &SF_CART_INFO) -> bool {
            self.version == other.version
                && &self.title[..] == &other.title[..]
                && &self.artist[..] == &other.artist[..]
                && &self.cut_id[..] == &other.cut_id[..]
                && &self.client_id[..] == &other.client_id[..]
                && &self.category[..] == &other.category[..]
                && &self.classification[..] == &other.classification[..]
                && &self.out_cue[..] == &other.out_cue[..]
                && self.start_date == other.start_date
                && self.start_time == other.start_time
                && self.end_date == other.end_date
                && self.end_time == other.end_time
                && &self.producer_app_id[..] == &other.producer_app_id[..]
                && &self.producer_app_version[..] == &other.producer_app_version[..]
                && &self.user_def[..] == &other.user_def[..]
                && self.level_reference == other.level_reference
                && self.post_timers == other.post_timers
                && &self.reserved[..] == &other.reserved[..]
                && &self.url[..] == &other.url[..]
                && self.tag_text_size == other.tag_text_size
                && &self.tag_text[..] == &other.tag_text[..]
        }
    }
    pub type sf_vio_get_filelen = ::std::option::Option<
        unsafe extern "C" fn(user_data: *mut ::std::os::raw::c_void) -> sf_count_t,
    >;
    pub type sf_vio_seek = ::std::option::Option<
        unsafe extern "C" fn(
            offset: sf_count_t,
            whence: ::std::os::raw::c_int,
            user_data: *mut ::std::os::raw::c_void,
        ) -> sf_count_t,
    >;
    pub type sf_vio_read = ::std::option::Option<
        unsafe extern "C" fn(
            ptr: *mut ::std::os::raw::c_void,
            count: sf_count_t,
            user_data: *mut ::std::os::raw::c_void,
        ) -> sf_count_t,
    >;
    pub type sf_vio_write = ::std::option::Option<
        unsafe extern "C" fn(
            ptr: *const ::std::os::raw::c_void,
            count: sf_count_t,
            user_data: *mut ::std::os::raw::c_void,
        ) -> sf_count_t,
    >;
    pub type sf_vio_tell = ::std::option::Option<
        unsafe extern "C" fn(user_data: *mut ::std::os::raw::c_void) -> sf_count_t,
    >;
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct SF_VIRTUAL_IO {
        pub get_filelen: sf_vio_get_filelen,
        pub seek: sf_vio_seek,
        pub read: sf_vio_read,
        pub write: sf_vio_write,
        pub tell: sf_vio_tell,
    }
    #[test]
    fn bindgen_test_layout_SF_VIRTUAL_IO() {
        assert_eq!(
            ::std::mem::size_of::<SF_VIRTUAL_IO>(),
            40usize,
            concat!("Size of: ", stringify!(SF_VIRTUAL_IO))
        );
        assert_eq!(
            ::std::mem::align_of::<SF_VIRTUAL_IO>(),
            8usize,
            concat!("Alignment of ", stringify!(SF_VIRTUAL_IO))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SF_VIRTUAL_IO>())).get_filelen as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_VIRTUAL_IO),
                "::",
                stringify!(get_filelen)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SF_VIRTUAL_IO>())).seek as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_VIRTUAL_IO),
                "::",
                stringify!(seek)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SF_VIRTUAL_IO>())).read as *const _ as usize },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_VIRTUAL_IO),
                "::",
                stringify!(read)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SF_VIRTUAL_IO>())).write as *const _ as usize },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_VIRTUAL_IO),
                "::",
                stringify!(write)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SF_VIRTUAL_IO>())).tell as *const _ as usize },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_VIRTUAL_IO),
                "::",
                stringify!(tell)
            )
        );
    }
    impl Default for SF_VIRTUAL_IO {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    extern "C" {
        pub fn sf_open(
            path: *const ::std::os::raw::c_char,
            mode: ::std::os::raw::c_int,
            sfinfo: *mut SF_INFO,
        ) -> *mut SNDFILE;
    }
    extern "C" {
        pub fn sf_open_fd(
            fd: ::std::os::raw::c_int,
            mode: ::std::os::raw::c_int,
            sfinfo: *mut SF_INFO,
            close_desc: ::std::os::raw::c_int,
        ) -> *mut SNDFILE;
    }
    extern "C" {
        pub fn sf_open_virtual(
            sfvirtual: *mut SF_VIRTUAL_IO,
            mode: ::std::os::raw::c_int,
            sfinfo: *mut SF_INFO,
            user_data: *mut ::std::os::raw::c_void,
        ) -> *mut SNDFILE;
    }
    extern "C" {
        pub fn sf_error(sndfile: *mut SNDFILE) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn sf_strerror(sndfile: *mut SNDFILE) -> *const ::std::os::raw::c_char;
    }
    extern "C" {
        pub fn sf_error_number(errnum: ::std::os::raw::c_int) -> *const ::std::os::raw::c_char;
    }
    extern "C" {
        pub fn sf_perror(sndfile: *mut SNDFILE) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn sf_error_str(
            sndfile: *mut SNDFILE,
            str: *mut ::std::os::raw::c_char,
            len: usize,
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn sf_command(
            sndfile: *mut SNDFILE,
            command: ::std::os::raw::c_int,
            data: *mut ::std::os::raw::c_void,
            datasize: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn sf_format_check(info: *const SF_INFO) -> ::std::os::raw::c_int;
    }
    pub const SF_SEEK_SET: _bindgen_ty_9 = _bindgen_ty_9::SF_SEEK_SET;
    pub const SF_SEEK_CUR: _bindgen_ty_9 = _bindgen_ty_9::SF_SEEK_CUR;
    pub const SF_SEEK_END: _bindgen_ty_9 = _bindgen_ty_9::SF_SEEK_END;
    #[repr(u32)]
    #[derive(Debug, Copy, Clone, PartialEq, Eq, Hash, PartialOrd, Ord)]
    pub enum _bindgen_ty_9 {
        SF_SEEK_SET = 0,
        SF_SEEK_CUR = 1,
        SF_SEEK_END = 2,
    }
    extern "C" {
        pub fn sf_seek(
            sndfile: *mut SNDFILE,
            frames: sf_count_t,
            whence: ::std::os::raw::c_int,
        ) -> sf_count_t;
    }
    extern "C" {
        pub fn sf_set_string(
            sndfile: *mut SNDFILE,
            str_type: ::std::os::raw::c_int,
            str: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn sf_get_string(
            sndfile: *mut SNDFILE,
            str_type: ::std::os::raw::c_int,
        ) -> *const ::std::os::raw::c_char;
    }
    extern "C" {
        pub fn sf_version_string() -> *const ::std::os::raw::c_char;
    }
    extern "C" {
        pub fn sf_current_byterate(sndfile: *mut SNDFILE) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn sf_read_raw(
            sndfile: *mut SNDFILE,
            ptr: *mut ::std::os::raw::c_void,
            bytes: sf_count_t,
        ) -> sf_count_t;
    }
    extern "C" {
        pub fn sf_write_raw(
            sndfile: *mut SNDFILE,
            ptr: *const ::std::os::raw::c_void,
            bytes: sf_count_t,
        ) -> sf_count_t;
    }
    extern "C" {
        pub fn sf_readf_short(
            sndfile: *mut SNDFILE,
            ptr: *mut ::std::os::raw::c_short,
            frames: sf_count_t,
        ) -> sf_count_t;
    }
    extern "C" {
        pub fn sf_writef_short(
            sndfile: *mut SNDFILE,
            ptr: *const ::std::os::raw::c_short,
            frames: sf_count_t,
        ) -> sf_count_t;
    }
    extern "C" {
        pub fn sf_readf_int(
            sndfile: *mut SNDFILE,
            ptr: *mut ::std::os::raw::c_int,
            frames: sf_count_t,
        ) -> sf_count_t;
    }
    extern "C" {
        pub fn sf_writef_int(
            sndfile: *mut SNDFILE,
            ptr: *const ::std::os::raw::c_int,
            frames: sf_count_t,
        ) -> sf_count_t;
    }
    extern "C" {
        pub fn sf_readf_float(
            sndfile: *mut SNDFILE,
            ptr: *mut f32,
            frames: sf_count_t,
        ) -> sf_count_t;
    }
    extern "C" {
        pub fn sf_writef_float(
            sndfile: *mut SNDFILE,
            ptr: *const f32,
            frames: sf_count_t,
        ) -> sf_count_t;
    }
    extern "C" {
        pub fn sf_readf_double(
            sndfile: *mut SNDFILE,
            ptr: *mut f64,
            frames: sf_count_t,
        ) -> sf_count_t;
    }
    extern "C" {
        pub fn sf_writef_double(
            sndfile: *mut SNDFILE,
            ptr: *const f64,
            frames: sf_count_t,
        ) -> sf_count_t;
    }
    extern "C" {
        pub fn sf_read_short(
            sndfile: *mut SNDFILE,
            ptr: *mut ::std::os::raw::c_short,
            items: sf_count_t,
        ) -> sf_count_t;
    }
    extern "C" {
        pub fn sf_write_short(
            sndfile: *mut SNDFILE,
            ptr: *const ::std::os::raw::c_short,
            items: sf_count_t,
        ) -> sf_count_t;
    }
    extern "C" {
        pub fn sf_read_int(
            sndfile: *mut SNDFILE,
            ptr: *mut ::std::os::raw::c_int,
            items: sf_count_t,
        ) -> sf_count_t;
    }
    extern "C" {
        pub fn sf_write_int(
            sndfile: *mut SNDFILE,
            ptr: *const ::std::os::raw::c_int,
            items: sf_count_t,
        ) -> sf_count_t;
    }
    extern "C" {
        pub fn sf_read_float(sndfile: *mut SNDFILE, ptr: *mut f32, items: sf_count_t)
            -> sf_count_t;
    }
    extern "C" {
        pub fn sf_write_float(
            sndfile: *mut SNDFILE,
            ptr: *const f32,
            items: sf_count_t,
        ) -> sf_count_t;
    }
    extern "C" {
        pub fn sf_read_double(
            sndfile: *mut SNDFILE,
            ptr: *mut f64,
            items: sf_count_t,
        ) -> sf_count_t;
    }
    extern "C" {
        pub fn sf_write_double(
            sndfile: *mut SNDFILE,
            ptr: *const f64,
            items: sf_count_t,
        ) -> sf_count_t;
    }
    extern "C" {
        pub fn sf_close(sndfile: *mut SNDFILE) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn sf_write_sync(sndfile: *mut SNDFILE);
    }
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub struct SF_CHUNK_INFO {
        pub id: [::std::os::raw::c_char; 64usize],
        pub id_size: ::std::os::raw::c_uint,
        pub datalen: ::std::os::raw::c_uint,
        pub data: *mut ::std::os::raw::c_void,
    }
    #[test]
    fn bindgen_test_layout_SF_CHUNK_INFO() {
        assert_eq!(
            ::std::mem::size_of::<SF_CHUNK_INFO>(),
            80usize,
            concat!("Size of: ", stringify!(SF_CHUNK_INFO))
        );
        assert_eq!(
            ::std::mem::align_of::<SF_CHUNK_INFO>(),
            8usize,
            concat!("Alignment of ", stringify!(SF_CHUNK_INFO))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SF_CHUNK_INFO>())).id as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_CHUNK_INFO),
                "::",
                stringify!(id)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SF_CHUNK_INFO>())).id_size as *const _ as usize },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_CHUNK_INFO),
                "::",
                stringify!(id_size)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SF_CHUNK_INFO>())).datalen as *const _ as usize },
            68usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_CHUNK_INFO),
                "::",
                stringify!(datalen)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<SF_CHUNK_INFO>())).data as *const _ as usize },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(SF_CHUNK_INFO),
                "::",
                stringify!(data)
            )
        );
    }
    impl Default for SF_CHUNK_INFO {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    impl ::std::fmt::Debug for SF_CHUNK_INFO {
        fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
            write!(
                f,
                "SF_CHUNK_INFO {{ id: [{}], id_size: {:?}, datalen: {:?}, data: {:?} }}",
                self.id
                    .iter()
                    .enumerate()
                    .map(|(i, v)| format!("{}{:?}", if i > 0 { ", " } else { "" }, v))
                    .collect::<String>(),
                self.id_size,
                self.datalen,
                self.data
            )
        }
    }
    impl ::std::cmp::PartialEq for SF_CHUNK_INFO {
        fn eq(&self, other: &SF_CHUNK_INFO) -> bool {
            &self.id[..] == &other.id[..]
                && self.id_size == other.id_size
                && self.datalen == other.datalen
                && self.data == other.data
        }
    }
    extern "C" {
        pub fn sf_set_chunk(
            sndfile: *mut SNDFILE,
            chunk_info: *const SF_CHUNK_INFO,
        ) -> ::std::os::raw::c_int;
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct SF_CHUNK_ITERATOR {
        _unused: [u8; 0],
    }
    extern "C" {
        pub fn sf_get_chunk_iterator(
            sndfile: *mut SNDFILE,
            chunk_info: *const SF_CHUNK_INFO,
        ) -> *mut SF_CHUNK_ITERATOR;
    }
    extern "C" {
        pub fn sf_next_chunk_iterator(iterator: *mut SF_CHUNK_ITERATOR) -> *mut SF_CHUNK_ITERATOR;
    }
    extern "C" {
        pub fn sf_get_chunk_size(
            it: *const SF_CHUNK_ITERATOR,
            chunk_info: *mut SF_CHUNK_INFO,
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn sf_get_chunk_data(
            it: *const SF_CHUNK_ITERATOR,
            chunk_info: *mut SF_CHUNK_INFO,
        ) -> ::std::os::raw::c_int;
    }
    pub type __builtin_va_list = [__va_list_tag; 1usize];
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __va_list_tag {
        pub gp_offset: ::std::os::raw::c_uint,
        pub fp_offset: ::std::os::raw::c_uint,
        pub overflow_arg_area: *mut ::std::os::raw::c_void,
        pub reg_save_area: *mut ::std::os::raw::c_void,
    }
    #[test]
    fn bindgen_test_layout___va_list_tag() {
        assert_eq!(
            ::std::mem::size_of::<__va_list_tag>(),
            24usize,
            concat!("Size of: ", stringify!(__va_list_tag))
        );
        assert_eq!(
            ::std::mem::align_of::<__va_list_tag>(),
            8usize,
            concat!("Alignment of ", stringify!(__va_list_tag))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<__va_list_tag>())).gp_offset as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__va_list_tag),
                "::",
                stringify!(gp_offset)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<__va_list_tag>())).fp_offset as *const _ as usize },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(__va_list_tag),
                "::",
                stringify!(fp_offset)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<__va_list_tag>())).overflow_arg_area as *const _ as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(__va_list_tag),
                "::",
                stringify!(overflow_arg_area)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<__va_list_tag>())).reg_save_area as *const _ as usize },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(__va_list_tag),
                "::",
                stringify!(reg_save_area)
            )
        );
    }
    impl Default for __va_list_tag {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
}
