#![allow(
    dead_code,
    improper_ctypes,
    mutable_transmutes,
    non_camel_case_types,
    non_snake_case,
    non_upper_case_globals,
    parenthesized_params_in_types_and_modules,
    unused_imports,
    unused_mut
)]
#![feature(libc)]
extern crate libc;
use crate::ck::carry::carrye::*;
use crate::ck::compile::compilee::*;
use crate::ck::dynl::dynle::*;
use crate::ck::hid::hide::*;
use crate::ck::midi::rtme::*;
use crate::ck::shell::shelle::*;
use crate::ck::ulib::mach::mache::*;
use crate::ck::util::math::utilmathe::*;
use crate::ck::util::string::stringe::*;
use crate::ck::vm::vme::*;
use crate::dts::*;
use libc::*;
///! master chuck module for easy embedding, thanks to 1.4.0.0 `numchucks` release!
fn main() {}
// #[repr(C)]
// pub struct __BindgenUnionField<T>(::std::marker::PhantomData<T>);
// impl<T> __BindgenUnionField<T> {
//     #[inline]
//     pub fn new() -> Self {
//         __BindgenUnionField(::std::marker::PhantomData)
//     }
//     #[inline]
//     pub unsafe fn as_ref(&self) -> &T {
//         transmute(self)
//     }
//     #[inline]
//     pub unsafe fn as_mut(&mut self) -> &mut T {
//         transmute(self)
//     }
// }
// impl<T> Default for __BindgenUnionField<T> {
//     #[inline]
//     fn default() -> Self {
//         Self::new()
//     }
// }
// impl<T> ::std::clone::Clone for __BindgenUnionField<T> {
//     #[inline]
//     fn clone(&self) -> Self {
//         Self::new()
//     }
// }

        pub type list_value_type<_Tp> = _Tp;
        pub type list_pointer = self::root::std::__cxx11::list__Tp_alloc_traits;
        pub type list_const_pointer = self::root::std::__cxx11::list__Tp_alloc_traits;
        pub type list_reference = self::root::std::__cxx11::list__Tp_alloc_traits;
        pub type list_const_reference = self::root::std::__cxx11::list__Tp_alloc_traits;
        pub type list_iterator = self::root::std::_List_iterator;
        pub type list_const_iterator = self::root::std::_List_const_iterator;
        pub type list_const_reverse_iterator =
            self::root::std::reverse_iterator<self::root::std::__cxx11::list_const_iterator>;
        pub type list_reverse_iterator =
            self::root::std::reverse_iterator<self::root::std::__cxx11::list_iterator>;
        pub type list_size_type = usize;
        pub type list_difference_type = isize;
        pub type list_allocator_type<_Alloc> = _Alloc;
        pub type list__Node = self::root::std::_List_node;
        impl Default for list {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        impl ::std::fmt::Debug for list {
            fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
                write!(f, "list {{  }}")
            }
        }
        impl PartialEq for list {
            fn eq(&self, other: &list) -> bool {
                self._base == other._base
            }
        }
    }
    pub type integral_constant_value_type<_Tp> = _Tp;
    pub type integral_constant_type = u8;
    pub type true_type = u8;
    pub type false_type = u8;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __and_ {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct is_empty {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct remove_reference {
        pub _address: u8,
    }
    pub type remove_reference_type<_Tp> = _Tp;
    pub type remove_reference_t = self::root::std::remove_reference;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct make_unsigned {
        pub _address: u8,
    }
    pub type make_unsigned_type = u8;
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub union aligned_storage_type {
        pub __data: *mut c_uchar,
        pub __align: self::root::std::aligned_storage_type__bindgen_ty_1,
        _bindgen_union_align: u64,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct aligned_storage_type__bindgen_ty_1 {
        pub _address: u8,
    }
    // #[test]
    // fn bindgen_test_layout_aligned_storage_type() {
    //     assert_eq!(
    //         size_of::<aligned_storage_type>(),
    //         8usize,
    //         concat!("Size of: ", stringify!(aligned_storage_type))
    //     );
    //     assert_eq!(
    //         align_of::<aligned_storage_type>(),
    //         8usize,
    //         concat!("Alignment of ", stringify!(aligned_storage_type))
    //     );
    // }
    impl Default for aligned_storage_type {
        fn default() -> Self {
            unsafe { zeroed() }
        }
    }
    impl ::std::fmt::Debug for aligned_storage_type {
        fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
            write!(f, "aligned_storage_type {{ union }}")
        }
    }
    pub type enable_if_t = u8;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __detector {
        pub _address: u8,
    }
    pub type __detector_value_t = self::root::std::false_type;
    pub type __detector_type<_Default> = _Default;
    pub type __detected_or = self::root::std::__detector;
    pub type __detected_or_t = self::root::std::__detected_or;
    #[repr(C)]
    #[derive(Debug, Default, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __pair_base {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct pair<_T1, _T2> {
        pub first: _T1,
        pub second: _T2,
        pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_T1>>,
        pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<_T2>>,
    }
    pub type pair_first_type<_T1> = _T1;
    pub type pair_second_type<_T2> = _T2;
    pub type pair__PCCP = u8;
    pub type pair__PCCFP = u8;
    impl<_T1, _T2> Default for pair<_T1, _T2> {
        fn default() -> Self {
            unsafe { zeroed() }
        }
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct input_iterator_tag {
        pub _address: u8,
    }
    // #[test]
    // fn bindgen_test_layout_input_iterator_tag() {
    //     assert_eq!(
    //         size_of::<input_iterator_tag>(),
    //         1usize,
    //         concat!("Size of: ", stringify!(input_iterator_tag))
    //     );
    //     assert_eq!(
    //         align_of::<input_iterator_tag>(),
    //         1usize,
    //         concat!("Alignment of ", stringify!(input_iterator_tag))
    //     );
    // }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct output_iterator_tag {
        pub _address: u8,
    }
    // #[test]
    // fn bindgen_test_layout_output_iterator_tag() {
    //     assert_eq!(
    //         size_of::<output_iterator_tag>(),
    //         1usize,
    //         concat!("Size of: ", stringify!(output_iterator_tag))
    //     );
    //     assert_eq!(
    //         align_of::<output_iterator_tag>(),
    //         1usize,
    //         concat!("Alignment of ", stringify!(output_iterator_tag))
    //     );
    // }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct forward_iterator_tag {
        pub _address: u8,
    }
    // #[test]
    // fn bindgen_test_layout_forward_iterator_tag() {
    //     assert_eq!(
    //         size_of::<forward_iterator_tag>(),
    //         1usize,
    //         concat!("Size of: ", stringify!(forward_iterator_tag))
    //     );
    //     assert_eq!(
    //         align_of::<forward_iterator_tag>(),
    //         1usize,
    //         concat!("Alignment of ", stringify!(forward_iterator_tag))
    //     );
    // }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct bidirectional_iterator_tag {
        pub _address: u8,
    }
    // #[test]
    // fn bindgen_test_layout_bidirectional_iterator_tag() {
    //     assert_eq!(
    //         size_of::<bidirectional_iterator_tag>(),
    //         1usize,
    //         concat!("Size of: ", stringify!(bidirectional_iterator_tag))
    //     );
    //     assert_eq!(
    //         align_of::<bidirectional_iterator_tag>(),
    //         1usize,
    //         concat!("Alignment of ", stringify!(bidirectional_iterator_tag))
    //     );
    // }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct random_access_iterator_tag {
        pub _address: u8,
    }
    // #[test]
    // fn bindgen_test_layout_random_access_iterator_tag() {
    //     assert_eq!(
    //         size_of::<random_access_iterator_tag>(),
    //         1usize,
    //         concat!("Size of: ", stringify!(random_access_iterator_tag))
    //     );
    //     assert_eq!(
    //         align_of::<random_access_iterator_tag>(),
    //         1usize,
    //         concat!("Alignment of ", stringify!(random_access_iterator_tag))
    //     );
    // }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct iterator {
        pub _address: u8,
    }
    pub type iterator_iterator_category<_Category> = _Category;
    pub type iterator_value_type<_Tp> = _Tp;
    pub type iterator_difference_type<_Distance> = _Distance;
    pub type iterator_pointer<_Pointer> = _Pointer;
    pub type iterator_reference<_Reference> = _Reference;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __iterator_traits {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct iterator_traits {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct __undefined {
        _unused: [u8; 0],
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __get_first_arg {
        pub _address: u8,
    }
    pub type __get_first_arg_type = self::root::std::__undefined;
    pub type __get_first_arg_t = self::root::std::__get_first_arg;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __replace_first_arg {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct pointer_traits {
        pub _address: u8,
    }
    pub type pointer_traits___element_type = [u8; 0usize];
    pub type pointer_traits___difference_type = [u8; 0usize];
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct pointer_traits___rebind {
        pub _address: u8,
    }
    impl Default for pointer_traits___rebind {
        fn default() -> Self {
            unsafe { zeroed() }
        }
    }
    pub type pointer_traits_pointer<_Ptr> = _Ptr;
    pub type pointer_traits_element_type = self::root::std::__detected_or_t;
    pub type pointer_traits_difference_type = self::root::std::__detected_or_t;
    pub type pointer_traits_rebind = self::root::std::pointer_traits___rebind;
    pub type __ptr_rebind = self::root::std::pointer_traits;
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct reverse_iterator<_Iterator> {
        pub current: _Iterator,
        pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Iterator>>,
    }
    pub type reverse_iterator___traits_type = self::root::std::iterator_traits;
    pub type reverse_iterator_iterator_type<_Iterator> = _Iterator;
    pub type reverse_iterator_difference_type = self::root::std::reverse_iterator___traits_type;
    pub type reverse_iterator_pointer = self::root::std::reverse_iterator___traits_type;
    pub type reverse_iterator_reference = self::root::std::reverse_iterator___traits_type;
    impl<_Iterator> Default for reverse_iterator<_Iterator> {
        fn default() -> Self {
            unsafe { zeroed() }
        }
    }
    pub type streamoff = c_long;
    pub type streamsize = isize;
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct fpos<_StateT> {
        pub _M_off: self::root::std::streamoff,
        pub _M_state: _StateT,
        pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_StateT>>,
    }
    impl<_StateT> Default for fpos<_StateT> {
        fn default() -> Self {
            unsafe { zeroed() }
        }
    }
    pub type streampos = self::root::std::fpos<self::root::mbstate_t>;
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct char_traits {
        pub _address: u8,
    }
    impl Default for char_traits {
        fn default() -> Self {
            unsafe { zeroed() }
        }
    }
    #[repr(C)]
    pub struct exception__bindgen_vtable(c_void);
    #[repr(C)]
    #[derive(Debug, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct exception {
        pub vtable_: *const exception__bindgen_vtable,
    }
    // #[test]
    // fn bindgen_test_layout_exception() {
    //     assert_eq!(
    //         size_of::<exception>(),
    //         8usize,
    //         concat!("Size of: ", stringify!(exception))
    //     );
    //     assert_eq!(
    //         align_of::<exception>(),
    //         8usize,
    //         concat!("Alignment of ", stringify!(exception))
    //     );
    // }
    impl Default for exception {
        fn default() -> Self {
            unsafe { zeroed() }
        }
    }
    extern "C" {
        #[link_name = "\u{1}exception_destructor"]
        pub fn exception_exception_destructor(this: *mut self::root::std::exception);
    }
    extern "C" {
        #[link_name = "\u{1}what"]
        pub fn exception_what(this: *mut c_void) -> *const c_char;
    }
    pub type __allocator_base = self::root::__gnu_cxx::new_allocator;
    #[repr(C)]
    #[derive(Debug, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct allocator {
        pub _address: u8,
    }
    pub type allocator_size_type = usize;
    pub type allocator_difference_type = isize;
    pub type allocator_pointer<_Tp> = *mut _Tp;
    pub type allocator_const_pointer<_Tp> = *const _Tp;
    pub type allocator_reference<_Tp> = *mut _Tp;
    pub type allocator_const_reference<_Tp> = *const _Tp;
    pub type allocator_value_type<_Tp> = _Tp;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct allocator_rebind {
        pub _address: u8,
    }
    pub type allocator_rebind_other = self::root::std::allocator;
    pub type allocator_propagate_on_container_move_assignment = self::root::std::true_type;
    pub type allocator_is_always_equal = self::root::std::true_type;
    impl Default for allocator {
        fn default() -> Self {
            unsafe { zeroed() }
        }
    }
    pub type __c_locale = self::root::__locale_t;
    pub type stringstream = self::root::std::__cxx11::basic_stringstream<c_char>;
    pub type fstream = self::root::std::basic_fstream<c_char>;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct unary_function {
        pub _address: u8,
    }
    pub type unary_function_argument_type<_Arg> = _Arg;
    pub type unary_function_result_type<_Result> = _Result;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct binary_function {
        pub _address: u8,
    }
    pub type binary_function_first_argument_type<_Arg1> = _Arg1;
    pub type binary_function_second_argument_type<_Arg2> = _Arg2;
    pub type binary_function_result_type<_Result> = _Result;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct less {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct _Select1st {
        pub _address: u8,
    }
    impl Default for _Select1st {
        fn default() -> Self {
            unsafe { zeroed() }
        }
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __allocator_traits_base {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __allocator_traits_base___rebind {
        pub _address: u8,
    }
    impl Default for __allocator_traits_base___rebind {
        fn default() -> Self {
            unsafe { zeroed() }
        }
    }
    pub type __allocator_traits_base___pointer = [u8; 0usize];
    pub type __allocator_traits_base___c_pointer = [u8; 0usize];
    pub type __allocator_traits_base___v_pointer = [u8; 0usize];
    pub type __allocator_traits_base___cv_pointer = [u8; 0usize];
    pub type __allocator_traits_base___pocca = [u8; 0usize];
    pub type __allocator_traits_base___pocma = [u8; 0usize];
    pub type __allocator_traits_base___pocs = [u8; 0usize];
    pub type __allocator_traits_base___equal = [u8; 0usize];
    // #[test]
    // fn bindgen_test_layout___allocator_traits_base() {
    //     assert_eq!(
    //         size_of::<__allocator_traits_base>(),
    //         1usize,
    //         concat!("Size of: ", stringify!(__allocator_traits_base))
    //     );
    //     assert_eq!(
    //         align_of::<__allocator_traits_base>(),
    //         1usize,
    //         concat!("Alignment of ", stringify!(__allocator_traits_base))
    //     );
    // }
    pub type __alloc_rebind = self::root::std::__allocator_traits_base;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct allocator_traits {
        pub _address: u8,
    }
    pub type allocator_traits_allocator_type<_Alloc> = _Alloc;
    pub type allocator_traits_value_type = [u8; 0usize];
    pub type allocator_traits_pointer = self::root::std::__detected_or_t;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct allocator_traits__Ptr {
        pub _address: u8,
    }
    pub type allocator_traits__Ptr_type = [u8; 0usize];
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct allocator_traits__Diff {
        pub _address: u8,
    }
    pub type allocator_traits__Diff_type = self::root::std::pointer_traits;
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct allocator_traits__Size {
        pub _address: u8,
    }
    impl Default for allocator_traits__Size {
        fn default() -> Self {
            unsafe { zeroed() }
        }
    }
    pub type allocator_traits_const_pointer = [u8; 0usize];
    pub type allocator_traits_void_pointer = self::root::std::allocator_traits__Ptr;
    pub type allocator_traits_const_void_pointer = self::root::std::allocator_traits__Ptr;
    pub type allocator_traits_difference_type = [u8; 0usize];
    pub type allocator_traits_size_type = [u8; 0usize];
    pub type allocator_traits_propagate_on_container_copy_assignment =
        self::root::std::__detected_or_t;
    pub type allocator_traits_propagate_on_container_move_assignment =
        self::root::std::__detected_or_t;
    pub type allocator_traits_propagate_on_container_swap = self::root::std::__detected_or_t;
    pub type allocator_traits_is_always_equal = self::root::std::__detected_or_t;
    pub type allocator_traits_rebind_alloc = self::root::std::__alloc_rebind;
    pub type allocator_traits_rebind_traits = self::root::std::allocator_traits;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct allocator_traits___construct_helper {
        pub _address: u8,
    }
    pub type allocator_traits___construct_helper_type<_Alloc> = _Alloc;
    pub type allocator_traits___has_construct =
        self::root::std::allocator_traits___construct_helper;
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct basic_string_view<_CharT> {
        pub _M_len: usize,
        pub _M_str: *const _CharT,
        pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_CharT>>,
    }
    pub type basic_string_view_traits_type<_Traits> = _Traits;
    pub type basic_string_view_value_type<_CharT> = _CharT;
    pub type basic_string_view_pointer<_CharT> = *const _CharT;
    pub type basic_string_view_const_pointer<_CharT> = *const _CharT;
    pub type basic_string_view_reference<_CharT> = *const _CharT;
    pub type basic_string_view_const_reference<_CharT> = *const _CharT;
    pub type basic_string_view_const_iterator<_CharT> = *const _CharT;
    pub type basic_string_view_iterator<_CharT> =
        self::root::std::basic_string_view_const_iterator<_CharT>;
    pub type basic_string_view_const_reverse_iterator<_CharT> = self::root::std::reverse_iterator<
        self::root::std::basic_string_view_const_iterator<_CharT>,
    >;
    pub type basic_string_view_reverse_iterator<_CharT> =
        self::root::std::basic_string_view_const_reverse_iterator<_CharT>;
    pub type basic_string_view_size_type = usize;
    pub type basic_string_view_difference_type = isize;
    impl<_CharT> Default for basic_string_view<_CharT> {
        fn default() -> Self {
            unsafe { zeroed() }
        }
    }
    pub mod __detail {

        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct _List_node_base {
            pub _M_next: *mut self::root::std::__detail::_List_node_base,
            pub _M_prev: *mut self::root::std::__detail::_List_node_base,
        }
        // #[test]
        // fn bindgen_test_layout__List_node_base() {
        //     assert_eq!(
        //         size_of::<_List_node_base>(),
        //         16usize,
        //         concat!("Size of: ", stringify!(_List_node_base))
        //     );
        //     assert_eq!(
        //         align_of::<_List_node_base>(),
        //         8usize,
        //         concat!("Alignment of ", stringify!(_List_node_base))
        //     );
        //     assert_eq!(
        //         unsafe {
        //             &(*(::std::ptr::null::<_List_node_base>()))._M_next as *const _ as usize
        //         },
        //         0usize,
        //         concat!(
        //             "Offset of field: ",
        //             stringify!(_List_node_base),
        //             "::",
        //             stringify!(_M_next)
        //         )
        //     );
        //     assert_eq!(
        //         unsafe {
        //             &(*(::std::ptr::null::<_List_node_base>()))._M_prev as *const _ as usize
        //         },
        //         8usize,
        //         concat!(
        //             "Offset of field: ",
        //             stringify!(_List_node_base),
        //             "::",
        //             stringify!(_M_prev)
        //         )
        //     );
        // }
        extern "C" {
            #[link_name = "\u{1}swap"]
            pub fn _List_node_base_swap(
                __x: *mut self::root::std::__detail::_List_node_base,
                __y: *mut self::root::std::__detail::_List_node_base,
            );
        }
        extern "C" {
            #[link_name = "\u{1}_M_transfer"]
            pub fn _List_node_base__M_transfer(
                this: *mut self::root::std::__detail::_List_node_base,
                __first: *mut self::root::std::__detail::_List_node_base,
                __last: *mut self::root::std::__detail::_List_node_base,
            );
        }
        extern "C" {
            #[link_name = "\u{1}_M_reverse"]
            pub fn _List_node_base__M_reverse(
                this: *mut self::root::std::__detail::_List_node_base,
            );
        }
        extern "C" {
            #[link_name = "\u{1}_M_hook"]
            pub fn _List_node_base__M_hook(
                this: *mut self::root::std::__detail::_List_node_base,
                __position: *mut self::root::std::__detail::_List_node_base,
            );
        }
        extern "C" {
            #[link_name = "\u{1}_M_unhook"]
            pub fn _List_node_base__M_unhook(this: *mut self::root::std::__detail::_List_node_base);
        }
        impl Default for _List_node_base {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        impl _List_node_base {
            #[inline]
            pub unsafe fn swap(
                __x: *mut self::root::std::__detail::_List_node_base,
                __y: *mut self::root::std::__detail::_List_node_base,
            ) {
                _List_node_base_swap(__x, __y)
            }
            #[inline]
            pub unsafe fn _M_transfer(
                &mut self,
                __first: *mut self::root::std::__detail::_List_node_base,
                __last: *mut self::root::std::__detail::_List_node_base,
            ) {
                _List_node_base__M_transfer(self, __first, __last)
            }
            #[inline]
            pub unsafe fn _M_reverse(&mut self) {
                _List_node_base__M_reverse(self)
            }
            #[inline]
            pub unsafe fn _M_hook(
                &mut self,
                __position: *mut self::root::std::__detail::_List_node_base,
            ) {
                _List_node_base__M_hook(self, __position)
            }
            #[inline]
            pub unsafe fn _M_unhook(&mut self) {
                _List_node_base__M_unhook(self)
            }
        }
        #[repr(C)]
        #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct _List_node_header {
            pub _base: self::root::std::__detail::_List_node_base,
            pub _M_size: usize,
        }
        // #[test]
        // fn bindgen_test_layout__List_node_header() {
        //     assert_eq!(
        //         size_of::<_List_node_header>(),
        //         24usize,
        //         concat!("Size of: ", stringify!(_List_node_header))
        //     );
        //     assert_eq!(
        //         align_of::<_List_node_header>(),
        //         8usize,
        //         concat!("Alignment of ", stringify!(_List_node_header))
        //     );
        //     assert_eq!(
        //         unsafe {
        //             &(*(::std::ptr::null::<_List_node_header>()))._M_size as *const _ as usize
        //         },
        //         16usize,
        //         concat!(
        //             "Offset of field: ",
        //             stringify!(_List_node_header),
        //             "::",
        //             stringify!(_M_size)
        //         )
        //     );
        // }
        impl Default for _List_node_header {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
    }
    pub mod literals {}
    #[repr(C)]
    pub struct _Vector_base {
        pub _M_impl: self::root::std::_Vector_base__Vector_impl,
    }
    pub type _Vector_base__Tp_alloc_type = [u8; 0usize];
    pub type _Vector_base_pointer = [u8; 0usize];
    #[repr(C)]
    pub struct _Vector_base__Vector_impl {
        pub _M_start: self::root::std::_Vector_base_pointer,
        pub _M_finish: self::root::std::_Vector_base_pointer,
        pub _M_end_of_storage: self::root::std::_Vector_base_pointer,
    }
    impl Default for _Vector_base__Vector_impl {
        fn default() -> Self {
            unsafe { zeroed() }
        }
    }
    impl ::std::fmt::Debug for _Vector_base__Vector_impl {
        fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
            write!(f, "_Vector_base__Vector_impl {{  }}")
        }
    }
    impl PartialEq for _Vector_base__Vector_impl {
        fn eq(&self, other: &_Vector_base__Vector_impl) -> bool {
            self._M_start == other._M_start
                && self._M_finish == other._M_finish
                && self._M_end_of_storage == other._M_end_of_storage
        }
    }
    pub type _Vector_base_allocator_type<_Alloc> = _Alloc;
    impl Default for _Vector_base {
        fn default() -> Self {
            unsafe { zeroed() }
        }
    }
    impl ::std::fmt::Debug for _Vector_base {
        fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
            write!(f, "_Vector_base {{ _M_impl: {:?} }}", self._M_impl)
        }
    }
    impl PartialEq for _Vector_base {
        fn eq(&self, other: &_Vector_base) -> bool {
            self._M_impl == other._M_impl
        }
    }
    #[repr(C)]
    pub struct vector {
        pub _base: self::root::std::_Vector_base,
    }
    pub type vector__Base = self::root::std::_Vector_base;
    pub type vector__Tp_alloc_type = self::root::std::vector__Base;
    pub type vector__Alloc_traits = self::root::__gnu_cxx::__alloc_traits;
    pub type vector_value_type<_Tp> = _Tp;
    pub type vector_pointer = self::root::std::vector__Base;
    pub type vector_const_pointer = self::root::std::vector__Alloc_traits;
    pub type vector_reference = self::root::std::vector__Alloc_traits;
    pub type vector_const_reference = self::root::std::vector__Alloc_traits;
    pub type vector_iterator =
        self::root::__gnu_cxx::__normal_iterator<self::root::std::vector_pointer>;
    pub type vector_const_iterator =
        self::root::__gnu_cxx::__normal_iterator<self::root::std::vector_const_pointer>;
    pub type vector_const_reverse_iterator =
        self::root::std::reverse_iterator<self::root::std::vector_const_iterator>;
    pub type vector_reverse_iterator =
        self::root::std::reverse_iterator<self::root::std::vector_iterator>;
    pub type vector_size_type = usize;
    pub type vector_difference_type = isize;
    pub type vector_allocator_type<_Alloc> = _Alloc;
    #[repr(C)]
    #[derive(Debug, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct vector__Temporary_value {
        pub _M_this: *mut self::root::std::vector,
        pub __buf: u8,
    }
    impl Default for vector__Temporary_value {
        fn default() -> Self {
            unsafe { zeroed() }
        }
    }
    impl Default for vector {
        fn default() -> Self {
            unsafe { zeroed() }
        }
    }
    impl ::std::fmt::Debug for vector {
        fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
            write!(f, "vector {{  }}")
        }
    }
    impl PartialEq for vector {
        fn eq(&self, other: &vector) -> bool {
            self._base == other._base
        }
    }
    #[repr(C)]
    pub struct __cow_string {
        pub __bindgen_anon_1: self::root::std::__cow_string__bindgen_ty_1,
    }
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub union __cow_string__bindgen_ty_1 {
        pub _M_p: *const c_char,
        pub _M_bytes: [c_char; 8usize],
        _bindgen_union_align: u64,
    }
    // #[test]
    // fn bindgen_test_layout___cow_string__bindgen_ty_1() {
    //     assert_eq!(
    //         size_of::<__cow_string__bindgen_ty_1>(),
    //         8usize,
    //         concat!("Size of: ", stringify!(__cow_string__bindgen_ty_1))
    //     );
    //     assert_eq!(
    //         align_of::<__cow_string__bindgen_ty_1>(),
    //         8usize,
    //         concat!("Alignment of ", stringify!(__cow_string__bindgen_ty_1))
    //     );
    //     assert_eq!(
    //         unsafe {
    //             &(*(::std::ptr::null::<__cow_string__bindgen_ty_1>()))._M_p as *const _ as usize
    //         },
    //         0usize,
    //         concat!(
    //             "Offset of field: ",
    //             stringify!(__cow_string__bindgen_ty_1),
    //             "::",
    //             stringify!(_M_p)
    //         )
    //     );
    //     assert_eq!(
    //         unsafe {
    //             &(*(::std::ptr::null::<__cow_string__bindgen_ty_1>()))._M_bytes as *const _
    //                 as usize
    //         },
    //         0usize,
    //         concat!(
    //             "Offset of field: ",
    //             stringify!(__cow_string__bindgen_ty_1),
    //             "::",
    //             stringify!(_M_bytes)
    //         )
    //     );
    // }
    impl Default for __cow_string__bindgen_ty_1 {
        fn default() -> Self {
            unsafe { zeroed() }
        }
    }
    impl ::std::fmt::Debug for __cow_string__bindgen_ty_1 {
        fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
            write!(f, "__cow_string__bindgen_ty_1 {{ union }}")
        }
    }
    // #[test]
    // fn bindgen_test_layout___cow_string() {
    //     assert_eq!(
    //         size_of::<__cow_string>(),
    //         8usize,
    //         concat!("Size of: ", stringify!(__cow_string))
    //     );
    //     assert_eq!(
    //         align_of::<__cow_string>(),
    //         8usize,
    //         concat!("Alignment of ", stringify!(__cow_string))
    //     );
    // }
    extern "C" {
        #[link_name = "\u{1}__cow_string"]
        pub fn __cow_string___cow_string(this: *mut self::root::std::__cow_string);
    }
    extern "C" {
        #[link_name = "\u{1}__cow_string"]
        pub fn __cow_string___cow_string1(
            this: *mut self::root::std::__cow_string,
            arg1: *const self::root::std::__cxx11::string,
        );
    }
    extern "C" {
        #[link_name = "\u{1}__cow_string"]
        pub fn __cow_string___cow_string2(
            this: *mut self::root::std::__cow_string,
            arg1: *const c_char,
            arg2: usize,
        );
    }
    extern "C" {
        #[link_name = "\u{1}__cow_string"]
        pub fn __cow_string___cow_string3(
            this: *mut self::root::std::__cow_string,
            arg1: *const self::root::std::__cow_string,
        );
    }
    extern "C" {
        #[link_name = "\u{1}__cow_string"]
        pub fn __cow_string___cow_string4(
            this: *mut self::root::std::__cow_string,
            arg1: *mut self::root::std::__cow_string,
        );
    }
    extern "C" {
        #[link_name = "\u{1}__cow_string_destructor"]
        pub fn __cow_string___cow_string_destructor(this: *mut self::root::std::__cow_string);
    }
    impl Default for __cow_string {
        fn default() -> Self {
            unsafe { zeroed() }
        }
    }
    impl ::std::fmt::Debug for __cow_string {
        fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
            write!(
                f,
                "__cow_string {{ __bindgen_anon_1: {:?} }}",
                self.__bindgen_anon_1
            )
        }
    }
    impl __cow_string {
        #[inline]
        pub unsafe fn new() -> Self {
            let mut __bindgen_tmp = uninitialized();
            __cow_string___cow_string(&mut __bindgen_tmp);
            __bindgen_tmp
        }
        #[inline]
        pub unsafe fn new1(arg1: *const self::root::std::__cxx11::string) -> Self {
            let mut __bindgen_tmp = uninitialized();
            __cow_string___cow_string1(&mut __bindgen_tmp, arg1);
            __bindgen_tmp
        }
        #[inline]
        pub unsafe fn new2(arg1: *const c_char, arg2: usize) -> Self {
            let mut __bindgen_tmp = uninitialized();
            __cow_string___cow_string2(&mut __bindgen_tmp, arg1, arg2);
            __bindgen_tmp
        }
        #[inline]
        pub unsafe fn new3(arg1: *const self::root::std::__cow_string) -> Self {
            let mut __bindgen_tmp = uninitialized();
            __cow_string___cow_string3(&mut __bindgen_tmp, arg1);
            __bindgen_tmp
        }
        #[inline]
        pub unsafe fn new4(arg1: *mut self::root::std::__cow_string) -> Self {
            let mut __bindgen_tmp = uninitialized();
            __cow_string___cow_string4(&mut __bindgen_tmp, arg1);
            __bindgen_tmp
        }
        #[inline]
        pub unsafe fn destruct(&mut self) {
            __cow_string___cow_string_destructor(self)
        }
    }
    #[repr(C)]
    pub struct runtime_error {
        pub _base: self::root::std::exception,
        pub _M_msg: self::root::std::__cow_string,
    }
    // #[test]
    // fn bindgen_test_layout_runtime_error() {
    //     assert_eq!(
    //         size_of::<runtime_error>(),
    //         16usize,
    //         concat!("Size of: ", stringify!(runtime_error))
    //     );
    //     assert_eq!(
    //         align_of::<runtime_error>(),
    //         8usize,
    //         concat!("Alignment of ", stringify!(runtime_error))
    //     );
    //     assert_eq!(
    //         unsafe { &(*(::std::ptr::null::<runtime_error>()))._M_msg as *const _ as usize },
    //         8usize,
    //         concat!(
    //             "Offset of field: ",
    //             stringify!(runtime_error),
    //             "::",
    //             stringify!(_M_msg)
    //         )
    //     );
    // }
    extern "C" {
        #[link_name = "\u{1}runtime_error"]
        pub fn runtime_error_runtime_error(
            this: *mut self::root::std::runtime_error,
            __arg: *const self::root::std::__cxx11::string,
        );
    }
    extern "C" {
        #[link_name = "\u{1}runtime_error"]
        pub fn runtime_error_runtime_error1(
            this: *mut self::root::std::runtime_error,
            arg1: *const c_char,
        );
    }
    extern "C" {
        #[link_name = "\u{1}runtime_error"]
        pub fn runtime_error_runtime_error2(
            this: *mut self::root::std::runtime_error,
            arg1: *const self::root::std::runtime_error,
        );
    }
    impl Default for runtime_error {
        fn default() -> Self {
            unsafe { zeroed() }
        }
    }
    impl ::std::fmt::Debug for runtime_error {
        fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
            write!(f, "runtime_error {{ _M_msg: {:?} }}", self._M_msg)
        }
    }
    impl runtime_error {
        #[inline]
        pub unsafe fn new(__arg: *const self::root::std::__cxx11::string) -> Self {
            let mut __bindgen_tmp = uninitialized();
            runtime_error_runtime_error(&mut __bindgen_tmp, __arg);
            __bindgen_tmp
        }
        #[inline]
        pub unsafe fn new1(arg1: *const c_char) -> Self {
            let mut __bindgen_tmp = uninitialized();
            runtime_error_runtime_error1(&mut __bindgen_tmp, arg1);
            __bindgen_tmp
        }
        #[inline]
        pub unsafe fn new2(arg1: *const self::root::std::runtime_error) -> Self {
            let mut __bindgen_tmp = uninitialized();
            runtime_error_runtime_error2(&mut __bindgen_tmp, arg1);
            __bindgen_tmp
        }
    }
    extern "C" {
        #[link_name = "\u{1}runtime_error_destructor"]
        pub fn runtime_error_runtime_error_destructor(this: *mut self::root::std::runtime_error);
    }
    extern "C" {
        #[link_name = "\u{1}what"]
        pub fn runtime_error_what(this: *mut c_void) -> *const c_char;
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct optional {
        pub _address: u8,
    }
    pub type optional__Base = u8;
    pub type optional_value_type<_Tp> = _Tp;
    #[repr(C)]
    #[derive(Debug, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct _Node_handle_common {
        pub _M_ptr: self::root::std::_Node_handle_common__AllocTraits,
        pub _M_alloc: self::root::std::optional,
    }
    pub type _Node_handle_common__AllocTraits = self::root::std::allocator_traits;
    pub type _Node_handle_common_allocator_type = self::root::std::__alloc_rebind;
    impl Default for _Node_handle_common {
        fn default() -> Self {
            unsafe { zeroed() }
        }
    }
    #[repr(C)]
    #[derive(Debug, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct _Node_handle {
        pub _base: self::root::std::_Node_handle_common,
        pub _M_pkey: self::root::std::_Node_handle___pointer,
        pub _M_pmapped: self::root::std::_Node_handle___pointer,
    }
    pub type _Node_handle_key_type<_Key> = _Key;
    pub type _Node_handle_mapped_type = [u8; 0usize];
    pub type _Node_handle__AllocTraits = self::root::std::allocator_traits;
    pub type _Node_handle___pointer = self::root::std::__ptr_rebind;
    impl Default for _Node_handle {
        fn default() -> Self {
            unsafe { zeroed() }
        }
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct _Node_insert_return<_Iterator, _NodeHandle> {
        pub position: _Iterator,
        pub inserted: bool,
        pub node: _NodeHandle,
        pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Iterator>>,
        pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<_NodeHandle>>,
    }
    impl<_Iterator, _NodeHandle> Default for _Node_insert_return<_Iterator, _NodeHandle> {
        fn default() -> Self {
            unsafe { zeroed() }
        }
    }
    pub const _Rb_tree_color__S_red: self::root::std::_Rb_tree_color = 0;
    pub const _Rb_tree_color__S_black: self::root::std::_Rb_tree_color = 1;
    pub type _Rb_tree_color = u32;
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct _Rb_tree_node_base {
        pub _M_color: self::root::std::_Rb_tree_color,
        pub _M_parent: self::root::std::_Rb_tree_node_base__Base_ptr,
        pub _M_left: self::root::std::_Rb_tree_node_base__Base_ptr,
        pub _M_right: self::root::std::_Rb_tree_node_base__Base_ptr,
    }
    pub type _Rb_tree_node_base__Base_ptr = *mut self::root::std::_Rb_tree_node_base;
    pub type _Rb_tree_node_base__Const_Base_ptr = *const self::root::std::_Rb_tree_node_base;
    // #[test]
    // fn bindgen_test_layout__Rb_tree_node_base() {
    //     assert_eq!(
    //         size_of::<_Rb_tree_node_base>(),
    //         32usize,
    //         concat!("Size of: ", stringify!(_Rb_tree_node_base))
    //     );
    //     assert_eq!(
    //         align_of::<_Rb_tree_node_base>(),
    //         8usize,
    //         concat!("Alignment of ", stringify!(_Rb_tree_node_base))
    //     );
    //     assert_eq!(
    //         unsafe {
    //             &(*(::std::ptr::null::<_Rb_tree_node_base>()))._M_color as *const _ as usize
    //         },
    //         0usize,
    //         concat!(
    //             "Offset of field: ",
    //             stringify!(_Rb_tree_node_base),
    //             "::",
    //             stringify!(_M_color)
    //         )
    //     );
    //     assert_eq!(
    //         unsafe {
    //             &(*(::std::ptr::null::<_Rb_tree_node_base>()))._M_parent as *const _ as usize
    //         },
    //         8usize,
    //         concat!(
    //             "Offset of field: ",
    //             stringify!(_Rb_tree_node_base),
    //             "::",
    //             stringify!(_M_parent)
    //         )
    //     );
    //     assert_eq!(
    //         unsafe {
    //             &(*(::std::ptr::null::<_Rb_tree_node_base>()))._M_left as *const _ as usize
    //         },
    //         16usize,
    //         concat!(
    //             "Offset of field: ",
    //             stringify!(_Rb_tree_node_base),
    //             "::",
    //             stringify!(_M_left)
    //         )
    //     );
    //     assert_eq!(
    //         unsafe {
    //             &(*(::std::ptr::null::<_Rb_tree_node_base>()))._M_right as *const _ as usize
    //         },
    //         24usize,
    //         concat!(
    //             "Offset of field: ",
    //             stringify!(_Rb_tree_node_base),
    //             "::",
    //             stringify!(_M_right)
    //         )
    //     );
    // }
    impl Default for _Rb_tree_node_base {
        fn default() -> Self {
            unsafe { zeroed() }
        }
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct _Rb_tree_key_compare<_Key_compare> {
        pub _M_key_compare: _Key_compare,
        pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Key_compare>>,
    }
    impl<_Key_compare> Default for _Rb_tree_key_compare<_Key_compare> {
        fn default() -> Self {
            unsafe { zeroed() }
        }
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct _Rb_tree_node {
        pub _base: self::root::std::_Rb_tree_node_base,
        pub _M_storage: self::root::__gnu_cxx::__aligned_membuf,
    }
    pub type _Rb_tree_node__Link_type = *mut self::root::std::_Rb_tree_node;
    impl Default for _Rb_tree_node {
        fn default() -> Self {
            unsafe { zeroed() }
        }
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct _Rb_tree_iterator {
        pub _M_node: self::root::std::_Rb_tree_iterator__Base_ptr,
    }
    pub type _Rb_tree_iterator_value_type<_Tp> = _Tp;
    pub type _Rb_tree_iterator_reference<_Tp> = *mut _Tp;
    pub type _Rb_tree_iterator_pointer<_Tp> = *mut _Tp;
    pub type _Rb_tree_iterator_iterator_category = self::root::std::bidirectional_iterator_tag;
    pub type _Rb_tree_iterator_difference_type = isize;
    pub type _Rb_tree_iterator__Self = self::root::std::_Rb_tree_iterator;
    pub type _Rb_tree_iterator__Base_ptr = self::root::std::_Rb_tree_node_base__Base_ptr;
    pub type _Rb_tree_iterator__Link_type = *mut self::root::std::_Rb_tree_node;
    impl Default for _Rb_tree_iterator {
        fn default() -> Self {
            unsafe { zeroed() }
        }
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct _Rb_tree_const_iterator {
        pub _M_node: self::root::std::_Rb_tree_const_iterator__Base_ptr,
    }
    pub type _Rb_tree_const_iterator_value_type<_Tp> = _Tp;
    pub type _Rb_tree_const_iterator_reference<_Tp> = *const _Tp;
    pub type _Rb_tree_const_iterator_pointer<_Tp> = *const _Tp;
    pub type _Rb_tree_const_iterator_iterator = self::root::std::_Rb_tree_iterator;
    pub type _Rb_tree_const_iterator_iterator_category =
        self::root::std::bidirectional_iterator_tag;
    pub type _Rb_tree_const_iterator_difference_type = isize;
    pub type _Rb_tree_const_iterator__Self = self::root::std::_Rb_tree_const_iterator;
    pub type _Rb_tree_const_iterator__Base_ptr =
        self::root::std::_Rb_tree_node_base__Const_Base_ptr;
    pub type _Rb_tree_const_iterator__Link_type = *const self::root::std::_Rb_tree_node;
    impl Default for _Rb_tree_const_iterator {
        fn default() -> Self {
            unsafe { zeroed() }
        }
    }
    #[repr(C)]
    #[derive(Debug, Default, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct _Rb_tree {
        pub _M_impl: u8,
    }
    pub type _Rb_tree__Node_allocator = [u8; 0usize];
    pub type _Rb_tree__Alloc_traits = self::root::__gnu_cxx::__alloc_traits;
    pub type _Rb_tree__Base_ptr = *mut self::root::std::_Rb_tree_node_base;
    pub type _Rb_tree__Const_Base_ptr = *const self::root::std::_Rb_tree_node_base;
    pub type _Rb_tree__Link_type = *mut self::root::std::_Rb_tree_node;
    pub type _Rb_tree__Const_Link_type = *const self::root::std::_Rb_tree_node;
    #[repr(C)]
    #[derive(Debug, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct _Rb_tree__Reuse_or_alloc_node {
        pub _M_root: self::root::std::_Rb_tree__Base_ptr,
        pub _M_nodes: self::root::std::_Rb_tree__Base_ptr,
        pub _M_t: *mut self::root::std::_Rb_tree,
    }
    impl Default for _Rb_tree__Reuse_or_alloc_node {
        fn default() -> Self {
            unsafe { zeroed() }
        }
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct _Rb_tree__Alloc_node {
        pub _M_t: *mut self::root::std::_Rb_tree,
    }
    impl Default for _Rb_tree__Alloc_node {
        fn default() -> Self {
            unsafe { zeroed() }
        }
    }
    pub type _Rb_tree_key_type<_Key> = _Key;
    pub type _Rb_tree_value_type<_Val> = _Val;
    pub type _Rb_tree_pointer<_Val> = *mut self::root::std::_Rb_tree_value_type<_Val>;
    pub type _Rb_tree_const_pointer<_Val> = *const self::root::std::_Rb_tree_value_type<_Val>;
    pub type _Rb_tree_reference<_Val> = *mut self::root::std::_Rb_tree_value_type<_Val>;
    pub type _Rb_tree_const_reference<_Val> = *const self::root::std::_Rb_tree_value_type<_Val>;
    pub type _Rb_tree_size_type = usize;
    pub type _Rb_tree_difference_type = isize;
    pub type _Rb_tree_allocator_type<_Alloc> = _Alloc;
    pub type _Rb_tree_reverse_iterator =
        self::root::std::reverse_iterator<self::root::std::_Rb_tree_iterator>;
    pub type _Rb_tree_const_reverse_iterator =
        self::root::std::reverse_iterator<self::root::std::_Rb_tree_const_iterator>;
    pub type _Rb_tree_node_type = self::root::std::_Node_handle;
    pub type _Rb_tree_insert_return_type =
        self::root::std::_Node_insert_return<_Iterator, _NodeHandle>;
    pub type _Rb_tree__Compatible_tree = self::root::std::_Rb_tree;
    pub type _Rb_tree__Rb_tree_impl__Base_key_compare<_Key_compare> =
        self::root::std::_Rb_tree_key_compare<_Key_compare>;
    #[repr(C)]
    pub struct map {
        pub _M_t: self::root::std::map__Rep_type,
    }
    pub type map_key_type<_Key> = _Key;
    pub type map_mapped_type<_Tp> = _Tp;
    pub type map_value_type<_Key, _Tp> = self::root::std::pair<_Key, _Tp>;
    pub type map_key_compare<_Compare> = _Compare;
    pub type map_allocator_type<_Alloc> = _Alloc;
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct map_value_compare<_Compare> {
        pub comp: _Compare,
        pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Compare>>,
    }
    impl<_Compare> Default for map_value_compare<_Compare> {
        fn default() -> Self {
            unsafe { zeroed() }
        }
    }
    pub type map__Pair_alloc_type = [u8; 0usize];
    pub type map__Rep_type = self::root::std::_Rb_tree;
    pub type map__Alloc_traits = self::root::__gnu_cxx::__alloc_traits;
    pub type map_pointer = [u8; 0usize];
    pub type map_const_pointer = [u8; 0usize];
    pub type map_reference = [u8; 0usize];
    pub type map_const_reference = [u8; 0usize];
    pub type map_iterator = [u8; 0usize];
    pub type map_const_iterator = [u8; 0usize];
    pub type map_size_type = [u8; 0usize];
    pub type map_difference_type = [u8; 0usize];
    pub type map_reverse_iterator = [u8; 0usize];
    pub type map_const_reverse_iterator = [u8; 0usize];
    pub type map_node_type = [u8; 0usize];
    pub type map_insert_return_type = [u8; 0usize];
    impl Default for map {
        fn default() -> Self {
            unsafe { zeroed() }
        }
    }
    impl ::std::fmt::Debug for map {
        fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
            write!(f, "map {{ _M_t: {:?} }}", self._M_t)
        }
    }
    impl PartialEq for map {
        fn eq(&self, other: &map) -> bool {
            self._M_t == other._M_t
        }
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct _Deque_iterator {
        pub _M_cur: self::root::std::_Deque_iterator__Elt_pointer,
        pub _M_first: self::root::std::_Deque_iterator__Elt_pointer,
        pub _M_last: self::root::std::_Deque_iterator__Elt_pointer,
        pub _M_node: self::root::std::_Deque_iterator__Map_pointer,
    }
    pub type _Deque_iterator___ptr_to = self::root::std::pointer_traits;
    pub type _Deque_iterator___iter = self::root::std::_Deque_iterator;
    pub type _Deque_iterator_iterator = self::root::std::_Deque_iterator___iter;
    pub type _Deque_iterator_const_iterator = self::root::std::_Deque_iterator___iter;
    pub type _Deque_iterator__Elt_pointer = self::root::std::_Deque_iterator___ptr_to;
    pub type _Deque_iterator__Map_pointer = self::root::std::_Deque_iterator___ptr_to;
    pub type _Deque_iterator_iterator_category = self::root::std::random_access_iterator_tag;
    pub type _Deque_iterator_value_type<_Tp> = _Tp;
    pub type _Deque_iterator_pointer<_Ptr> = _Ptr;
    pub type _Deque_iterator_reference<_Ref> = _Ref;
    pub type _Deque_iterator_size_type = usize;
    pub type _Deque_iterator_difference_type = isize;
    pub type _Deque_iterator__Self = self::root::std::_Deque_iterator;
    impl Default for _Deque_iterator {
        fn default() -> Self {
            unsafe { zeroed() }
        }
    }
    #[repr(C)]
    pub struct _Deque_base {
        pub _M_impl: self::root::std::_Deque_base__Deque_impl,
    }
    pub type _Deque_base__Tp_alloc_type = [u8; 0usize];
    pub type _Deque_base__Alloc_traits = self::root::__gnu_cxx::__alloc_traits;
    pub type _Deque_base__Ptr = [u8; 0usize];
    pub type _Deque_base__Ptr_const = [u8; 0usize];
    pub type _Deque_base__Map_alloc_type = [u8; 0usize];
    pub type _Deque_base__Map_alloc_traits = self::root::__gnu_cxx::__alloc_traits;
    pub type _Deque_base_allocator_type<_Alloc> = _Alloc;
    pub type _Deque_base_size_type = [u8; 0usize];
    pub type _Deque_base_iterator = self::root::std::_Deque_iterator;
    pub type _Deque_base_const_iterator = self::root::std::_Deque_iterator;
    pub type _Deque_base__Map_pointer = [u8; 0usize];
    #[repr(C)]
    pub struct _Deque_base__Deque_impl {
        pub _M_map: self::root::std::_Deque_base__Map_pointer,
        pub _M_map_size: usize,
        pub _M_start: self::root::std::_Deque_base_iterator,
        pub _M_finish: self::root::std::_Deque_base_iterator,
    }
    impl Default for _Deque_base__Deque_impl {
        fn default() -> Self {
            unsafe { zeroed() }
        }
    }
    impl ::std::fmt::Debug for _Deque_base__Deque_impl {
        fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
            write!(
                f,
                "_Deque_base__Deque_impl {{ _M_map_size: {:?}, _M_start: {:?}, _M_finish: {:?} }}",
                self._M_map_size, self._M_start, self._M_finish
            )
        }
    }
    impl PartialEq for _Deque_base__Deque_impl {
        fn eq(&self, other: &_Deque_base__Deque_impl) -> bool {
            self._M_map == other._M_map
                && self._M_map_size == other._M_map_size
                && self._M_start == other._M_start
                && self._M_finish == other._M_finish
        }
    }
    pub const _Deque_base__S_initial_map_size: self::root::std::_Deque_base__bindgen_ty_1 = 0;
    pub type _Deque_base__bindgen_ty_1 = i32;
    impl Default for _Deque_base {
        fn default() -> Self {
            unsafe { zeroed() }
        }
    }
    impl ::std::fmt::Debug for _Deque_base {
        fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
            write!(f, "_Deque_base {{ _M_impl: {:?} }}", self._M_impl)
        }
    }
    impl PartialEq for _Deque_base {
        fn eq(&self, other: &_Deque_base) -> bool {
            self._M_impl == other._M_impl
        }
    }
    #[repr(C)]
    pub struct deque {
        pub _base: self::root::std::_Deque_base,
    }
    pub type deque__Base = self::root::std::_Deque_base;
    pub type deque__Tp_alloc_type = self::root::std::deque__Base;
    pub type deque__Alloc_traits = self::root::std::deque__Base;
    pub type deque__Map_pointer = self::root::std::deque__Base;
    pub type deque_value_type<_Tp> = _Tp;
    pub type deque_pointer = self::root::std::deque__Alloc_traits;
    pub type deque_const_pointer = self::root::std::deque__Alloc_traits;
    pub type deque_reference = self::root::std::deque__Alloc_traits;
    pub type deque_const_reference = self::root::std::deque__Alloc_traits;
    pub type deque_iterator = self::root::std::deque__Base;
    pub type deque_const_iterator = self::root::std::deque__Base;
    pub type deque_const_reverse_iterator =
        self::root::std::reverse_iterator<self::root::std::deque_const_iterator>;
    pub type deque_reverse_iterator =
        self::root::std::reverse_iterator<self::root::std::deque_iterator>;
    pub type deque_size_type = usize;
    pub type deque_difference_type = isize;
    pub type deque_allocator_type<_Alloc> = _Alloc;
    impl Default for deque {
        fn default() -> Self {
            unsafe { zeroed() }
        }
    }
    impl ::std::fmt::Debug for deque {
        fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
            write!(f, "deque {{  }}")
        }
    }
    impl PartialEq for deque {
        fn eq(&self, other: &deque) -> bool {
            self._base == other._base
        }
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct queue<_Sequence> {
        pub c: _Sequence,
        pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Sequence>>,
    }
    pub type queue__Uses = u8;
    pub type queue_value_type = [u8; 0usize];
    pub type queue_reference = [u8; 0usize];
    pub type queue_const_reference = [u8; 0usize];
    pub type queue_size_type = [u8; 0usize];
    pub type queue_container_type<_Sequence> = _Sequence;
    impl<_Sequence> Default for queue<_Sequence> {
        fn default() -> Self {
            unsafe { zeroed() }
        }
    }
    #[repr(C)]
    #[derive(Debug, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct locale {
        pub _M_impl: *mut self::root::std::locale__Impl,
    }
    pub type locale_category = c_int;
    pub const locale__S_categories_size: self::root::std::locale__bindgen_ty_1 = 12;
    pub type locale__bindgen_ty_1 = u32;
    pub const locale_none: self::root::std::locale_category = 0;
    pub const locale_ctype: self::root::std::locale_category = 1;
    pub const locale_numeric: self::root::std::locale_category = 2;
    pub const locale_collate: self::root::std::locale_category = 4;
    pub const locale_time: self::root::std::locale_category = 8;
    pub const locale_monetary: self::root::std::locale_category = 16;
    pub const locale_messages: self::root::std::locale_category = 32;
    pub const locale_all: self::root::std::locale_category = 63;
    extern "C" {
        #[link_name = "\u{1}_S_classic"]
        pub static mut locale__S_classic: *mut self::root::std::locale__Impl;
    }
    extern "C" {
        #[link_name = "\u{1}_S_global"]
        pub static mut locale__S_global: *mut self::root::std::locale__Impl;
    }
    extern "C" {
        #[link_name = "\u{1}_S_categories"]
        pub static locale__S_categories: *const *const c_char;
    }
    extern "C" {
        #[link_name = "\u{1}_S_once"]
        pub static mut locale__S_once: self::root::__gthread_once_t;
    }
    extern "C" {
        #[link_name = "\u{1}_S_twinned_facets"]
        pub static mut locale__S_twinned_facets: [*const self::root::std::locale_id; 0usize];
    }
    // #[test]
    // fn bindgen_test_layout_locale() {
    //     assert_eq!(
    //         size_of::<locale>(),
    //         8usize,
    //         concat!("Size of: ", stringify!(locale))
    //     );
    //     assert_eq!(
    //         align_of::<locale>(),
    //         8usize,
    //         concat!("Alignment of ", stringify!(locale))
    //     );
    //     assert_eq!(
    //         unsafe { &(*(::std::ptr::null::<locale>()))._M_impl as *const _ as usize },
    //         0usize,
    //         concat!(
    //             "Offset of field: ",
    //             stringify!(locale),
    //             "::",
    //             stringify!(_M_impl)
    //         )
    //     );
    // }
    extern "C" {
        #[link_name = "\u{1}name"]
        pub fn locale_name(
            this: *const self::root::std::locale,
        ) -> self::root::std::__cxx11::string;
    }
    extern "C" {
        #[link_name = "\u{1}global"]
        pub fn locale_global(__loc: *const self::root::std::locale) -> self::root::std::locale;
    }
    extern "C" {
        #[link_name = "\u{1}classic"]
        pub fn locale_classic() -> *const self::root::std::locale;
    }
    extern "C" {
        #[link_name = "\u{1}locale"]
        pub fn locale_locale(this: *mut self::root::std::locale);
    }
    extern "C" {
        #[link_name = "\u{1}locale"]
        pub fn locale_locale1(
            this: *mut self::root::std::locale,
            __other: *const self::root::std::locale,
        );
    }
    extern "C" {
        #[link_name = "\u{1}locale"]
        pub fn locale_locale2(this: *mut self::root::std::locale, __s: *const c_char);
    }
    extern "C" {
        #[link_name = "\u{1}locale"]
        pub fn locale_locale3(
            this: *mut self::root::std::locale,
            __base: *const self::root::std::locale,
            __s: *const c_char,
            __cat: self::root::std::locale_category,
        );
    }
    extern "C" {
        #[link_name = "\u{1}locale"]
        pub fn locale_locale4(
            this: *mut self::root::std::locale,
            __base: *const self::root::std::locale,
            __add: *const self::root::std::locale,
            __cat: self::root::std::locale_category,
        );
    }
    extern "C" {
        #[link_name = "\u{1}locale_destructor"]
        pub fn locale_locale_destructor(this: *mut self::root::std::locale);
    }
    impl Default for locale {
        fn default() -> Self {
            unsafe { zeroed() }
        }
    }
    impl locale {
        #[inline]
        pub unsafe fn name(&self) -> self::root::std::__cxx11::string {
            locale_name(self)
        }
        #[inline]
        pub unsafe fn global(__loc: *const self::root::std::locale) -> self::root::std::locale {
            locale_global(__loc)
        }
        #[inline]
        pub unsafe fn classic() -> *const self::root::std::locale {
            locale_classic()
        }
        #[inline]
        pub unsafe fn new() -> Self {
            let mut __bindgen_tmp = uninitialized();
            locale_locale(&mut __bindgen_tmp);
            __bindgen_tmp
        }
        #[inline]
        pub unsafe fn new1(__other: *const self::root::std::locale) -> Self {
            let mut __bindgen_tmp = uninitialized();
            locale_locale1(&mut __bindgen_tmp, __other);
            __bindgen_tmp
        }
        #[inline]
        pub unsafe fn new2(__s: *const c_char) -> Self {
            let mut __bindgen_tmp = uninitialized();
            locale_locale2(&mut __bindgen_tmp, __s);
            __bindgen_tmp
        }
        #[inline]
        pub unsafe fn new3(
            __base: *const self::root::std::locale,
            __s: *const c_char,
            __cat: self::root::std::locale_category,
        ) -> Self {
            let mut __bindgen_tmp = uninitialized();
            locale_locale3(&mut __bindgen_tmp, __base, __s, __cat);
            __bindgen_tmp
        }
        #[inline]
        pub unsafe fn new4(
            __base: *const self::root::std::locale,
            __add: *const self::root::std::locale,
            __cat: self::root::std::locale_category,
        ) -> Self {
            let mut __bindgen_tmp = uninitialized();
            locale_locale4(&mut __bindgen_tmp, __base, __add, __cat);
            __bindgen_tmp
        }
        #[inline]
        pub unsafe fn destruct(&mut self) {
            locale_locale_destructor(self)
        }
    }
    #[repr(C)]
    pub struct locale_facet__bindgen_vtable(c_void);
    #[repr(C)]
    #[derive(Debug, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct locale_facet {
        pub vtable_: *const locale_facet__bindgen_vtable,
        pub _M_refcount: self::root::_Atomic_word,
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct locale_facet___shim {
        _unused: [u8; 0],
    }
    extern "C" {
        #[link_name = "\u{1}_S_c_locale"]
        pub static mut locale_facet__S_c_locale: self::root::std::__c_locale;
    }
    extern "C" {
        #[link_name = "\u{1}_S_c_name"]
        pub static mut locale_facet__S_c_name: [c_char; 2usize];
    }
    extern "C" {
        #[link_name = "\u{1}_S_once"]
        pub static mut locale_facet__S_once: self::root::__gthread_once_t;
    }
    // #[test]
    // fn bindgen_test_layout_locale_facet() {
    //     assert_eq!(
    //         size_of::<locale_facet>(),
    //         16usize,
    //         concat!("Size of: ", stringify!(locale_facet))
    //     );
    //     assert_eq!(
    //         align_of::<locale_facet>(),
    //         8usize,
    //         concat!("Alignment of ", stringify!(locale_facet))
    //     );
    //     assert_eq!(
    //         unsafe {
    //             &(*(::std::ptr::null::<locale_facet>()))._M_refcount as *const _ as usize
    //         },
    //         8usize,
    //         concat!(
    //             "Offset of field: ",
    //             stringify!(locale_facet),
    //             "::",
    //             stringify!(_M_refcount)
    //         )
    //     );
    // }
    extern "C" {
        #[link_name = "\u{1}_S_create_c_locale"]
        pub fn locale_facet__S_create_c_locale(
            __cloc: *mut self::root::std::__c_locale,
            __s: *const c_char,
            __old: self::root::std::__c_locale,
        );
    }
    extern "C" {
        #[link_name = "\u{1}_S_clone_c_locale"]
        pub fn locale_facet__S_clone_c_locale(
            __cloc: *mut self::root::std::__c_locale,
        ) -> self::root::std::__c_locale;
    }
    extern "C" {
        #[link_name = "\u{1}_S_destroy_c_locale"]
        pub fn locale_facet__S_destroy_c_locale(__cloc: *mut self::root::std::__c_locale);
    }
    extern "C" {
        #[link_name = "\u{1}_S_lc_ctype_c_locale"]
        pub fn locale_facet__S_lc_ctype_c_locale(
            __cloc: self::root::std::__c_locale,
            __s: *const c_char,
        ) -> self::root::std::__c_locale;
    }
    extern "C" {
        #[link_name = "\u{1}_S_get_c_locale"]
        pub fn locale_facet__S_get_c_locale() -> self::root::std::__c_locale;
    }
    extern "C" {
        #[link_name = "\u{1}_S_get_c_name"]
        pub fn locale_facet__S_get_c_name() -> *const c_char;
    }
    impl Default for locale_facet {
        fn default() -> Self {
            unsafe { zeroed() }
        }
    }
    impl locale_facet {
        #[inline]
        pub unsafe fn _S_create_c_locale(
            __cloc: *mut self::root::std::__c_locale,
            __s: *const c_char,
            __old: self::root::std::__c_locale,
        ) {
            locale_facet__S_create_c_locale(__cloc, __s, __old)
        }
        #[inline]
        pub unsafe fn _S_clone_c_locale(
            __cloc: *mut self::root::std::__c_locale,
        ) -> self::root::std::__c_locale {
            locale_facet__S_clone_c_locale(__cloc)
        }
        #[inline]
        pub unsafe fn _S_destroy_c_locale(__cloc: *mut self::root::std::__c_locale) {
            locale_facet__S_destroy_c_locale(__cloc)
        }
        #[inline]
        pub unsafe fn _S_lc_ctype_c_locale(
            __cloc: self::root::std::__c_locale,
            __s: *const c_char,
        ) -> self::root::std::__c_locale {
            locale_facet__S_lc_ctype_c_locale(__cloc, __s)
        }
        #[inline]
        pub unsafe fn _S_get_c_locale() -> self::root::std::__c_locale {
            locale_facet__S_get_c_locale()
        }
        #[inline]
        pub unsafe fn _S_get_c_name() -> *const c_char {
            locale_facet__S_get_c_name()
        }
    }
    extern "C" {
        #[link_name = "\u{1}facet_destructor"]
        pub fn locale_facet_facet_destructor(this: *mut self::root::std::locale_facet);
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct locale_id {
        pub _M_index: usize,
    }
    extern "C" {
        #[link_name = "\u{1}_S_refcount"]
        pub static mut locale_id__S_refcount: self::root::_Atomic_word;
    }
    // #[test]
    // fn bindgen_test_layout_locale_id() {
    //     assert_eq!(
    //         size_of::<locale_id>(),
    //         8usize,
    //         concat!("Size of: ", stringify!(locale_id))
    //     );
    //     assert_eq!(
    //         align_of::<locale_id>(),
    //         8usize,
    //         concat!("Alignment of ", stringify!(locale_id))
    //     );
    //     assert_eq!(
    //         unsafe { &(*(::std::ptr::null::<locale_id>()))._M_index as *const _ as usize },
    //         0usize,
    //         concat!(
    //             "Offset of field: ",
    //             stringify!(locale_id),
    //             "::",
    //             stringify!(_M_index)
    //         )
    //     );
    // }
    extern "C" {
        #[link_name = "\u{1}_M_id"]
        pub fn locale_id__M_id(this: *const self::root::std::locale_id) -> usize;
    }
    impl locale_id {
        #[inline]
        pub unsafe fn _M_id(&self) -> usize {
            locale_id__M_id(self)
        }
    }
    #[repr(C)]
    #[derive(Debug, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct locale__Impl {
        pub _M_refcount: self::root::_Atomic_word,
        pub _M_facets: *mut *const self::root::std::locale_facet,
        pub _M_facets_size: usize,
        pub _M_caches: *mut *const self::root::std::locale_facet,
        pub _M_names: *mut *mut c_char,
    }
    extern "C" {
        #[link_name = "\u{1}_S_id_ctype"]
        pub static mut locale__Impl__S_id_ctype: [*const self::root::std::locale_id; 0usize];
    }
    extern "C" {
        #[link_name = "\u{1}_S_id_numeric"]
        pub static mut locale__Impl__S_id_numeric: [*const self::root::std::locale_id; 0usize];
    }
    extern "C" {
        #[link_name = "\u{1}_S_id_collate"]
        pub static mut locale__Impl__S_id_collate: [*const self::root::std::locale_id; 0usize];
    }
    extern "C" {
        #[link_name = "\u{1}_S_id_time"]
        pub static mut locale__Impl__S_id_time: [*const self::root::std::locale_id; 0usize];
    }
    extern "C" {
        #[link_name = "\u{1}_S_id_monetary"]
        pub static mut locale__Impl__S_id_monetary: [*const self::root::std::locale_id; 0usize];
    }
    extern "C" {
        #[link_name = "\u{1}_S_id_messages"]
        pub static mut locale__Impl__S_id_messages: [*const self::root::std::locale_id; 0usize];
    }
    extern "C" {
        #[link_name = "\u{1}_S_facet_categories"]
        pub static mut locale__Impl__S_facet_categories:
            [*const *const self::root::std::locale_id; 0usize];
    }
    // #[test]
    // fn bindgen_test_layout_locale__Impl() {
    //     assert_eq!(
    //         size_of::<locale__Impl>(),
    //         40usize,
    //         concat!("Size of: ", stringify!(locale__Impl))
    //     );
    //     assert_eq!(
    //         align_of::<locale__Impl>(),
    //         8usize,
    //         concat!("Alignment of ", stringify!(locale__Impl))
    //     );
    //     assert_eq!(
    //         unsafe {
    //             &(*(::std::ptr::null::<locale__Impl>()))._M_refcount as *const _ as usize
    //         },
    //         0usize,
    //         concat!(
    //             "Offset of field: ",
    //             stringify!(locale__Impl),
    //             "::",
    //             stringify!(_M_refcount)
    //         )
    //     );
    //     assert_eq!(
    //         unsafe { &(*(::std::ptr::null::<locale__Impl>()))._M_facets as *const _ as usize },
    //         8usize,
    //         concat!(
    //             "Offset of field: ",
    //             stringify!(locale__Impl),
    //             "::",
    //             stringify!(_M_facets)
    //         )
    //     );
    //     assert_eq!(
    //         unsafe {
    //             &(*(::std::ptr::null::<locale__Impl>()))._M_facets_size as *const _ as usize
    //         },
    //         16usize,
    //         concat!(
    //             "Offset of field: ",
    //             stringify!(locale__Impl),
    //             "::",
    //             stringify!(_M_facets_size)
    //         )
    //     );
    //     assert_eq!(
    //         unsafe { &(*(::std::ptr::null::<locale__Impl>()))._M_caches as *const _ as usize },
    //         24usize,
    //         concat!(
    //             "Offset of field: ",
    //             stringify!(locale__Impl),
    //             "::",
    //             stringify!(_M_caches)
    //         )
    //     );
    //     assert_eq!(
    //         unsafe { &(*(::std::ptr::null::<locale__Impl>()))._M_names as *const _ as usize },
    //         32usize,
    //         concat!(
    //             "Offset of field: ",
    //             stringify!(locale__Impl),
    //             "::",
    //             stringify!(_M_names)
    //         )
    //     );
    // }
    impl Default for locale__Impl {
        fn default() -> Self {
            unsafe { zeroed() }
        }
    }
    pub mod _V2 {

        #[repr(C)]
        pub struct error_category__bindgen_vtable(c_void);
        #[repr(C)]
        #[derive(Debug, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct error_category {
            pub vtable_: *const error_category__bindgen_vtable,
        }
        // #[test]
        // fn bindgen_test_layout_error_category() {
        //     assert_eq!(
        //         size_of::<error_category>(),
        //         8usize,
        //         concat!("Size of: ", stringify!(error_category))
        //     );
        //     assert_eq!(
        //         align_of::<error_category>(),
        //         8usize,
        //         concat!("Alignment of ", stringify!(error_category))
        //     );
        // }
        impl Default for error_category {
            fn default() -> Self {
                unsafe { zeroed() }
            }
        }
        extern "C" {
            #[link_name = "\u{1}error_category_destructor"]
            pub fn error_category_error_category_destructor(
                this: *mut self::root::std::_V2::error_category,
            );
        }
        extern "C" {
            #[link_name = "\u{1}default_error_condition"]
            pub fn error_category_default_error_condition(
                this: *mut c_void,
                __i: c_int,
            ) -> self::root::std::error_condition;
        }
        extern "C" {
            #[link_name = "\u{1}equivalent"]
            pub fn error_category_equivalent(
                this: *mut c_void,
                __i: c_int,
                __cond: *const self::root::std::error_condition,
            ) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}equivalent"]
            pub fn error_category_equivalent1(
                this: *mut c_void,
                __code: *const self::root::std::error_code,
                __i: c_int,
            ) -> bool;
        }
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct error_code {
        pub _M_value: c_int,
        pub _M_cat: *const self::root::std::_V2::error_category,
    }
    // #[test]
    // fn bindgen_test_layout_error_code() {
    //     assert_eq!(
    //         size_of::<error_code>(),
    //         16usize,
    //         concat!("Size of: ", stringify!(error_code))
    //     );
    //     assert_eq!(
    //         align_of::<error_code>(),
    //         8usize,
    //         concat!("Alignment of ", stringify!(error_code))
    //     );
    //     assert_eq!(
    //         unsafe { &(*(::std::ptr::null::<error_code>()))._M_value as *const _ as usize },
    //         0usize,
    //         concat!(
    //             "Offset of field: ",
    //             stringify!(error_code),
    //             "::",
    //             stringify!(_M_value)
    //         )
    //     );
    //     assert_eq!(
    //         unsafe { &(*(::std::ptr::null::<error_code>()))._M_cat as *const _ as usize },
    //         8usize,
    //         concat!(
    //             "Offset of field: ",
    //             stringify!(error_code),
    //             "::",
    //             stringify!(_M_cat)
    //         )
    //     );
    // }
    extern "C" {
        #[link_name = "\u{1}default_error_condition"]
        pub fn error_code_default_error_condition(
            this: *const self::root::std::error_code,
        ) -> self::root::std::error_condition;
    }
    impl Default for error_code {
        fn default() -> Self {
            unsafe { zeroed() }
        }
    }
    impl error_code {
        #[inline]
        pub unsafe fn default_error_condition(&self) -> self::root::std::error_condition {
            error_code_default_error_condition(self)
        }
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct error_condition {
        pub _M_value: c_int,
        pub _M_cat: *const self::root::std::_V2::error_category,
    }
    // #[test]
    // fn bindgen_test_layout_error_condition() {
    //     assert_eq!(
    //         size_of::<error_condition>(),
    //         16usize,
    //         concat!("Size of: ", stringify!(error_condition))
    //     );
    //     assert_eq!(
    //         align_of::<error_condition>(),
    //         8usize,
    //         concat!("Alignment of ", stringify!(error_condition))
    //     );
    //     assert_eq!(
    //         unsafe {
    //             &(*(::std::ptr::null::<error_condition>()))._M_value as *const _ as usize
    //         },
    //         0usize,
    //         concat!(
    //             "Offset of field: ",
    //             stringify!(error_condition),
    //             "::",
    //             stringify!(_M_value)
    //         )
    //     );
    //     assert_eq!(
    //         unsafe { &(*(::std::ptr::null::<error_condition>()))._M_cat as *const _ as usize },
    //         8usize,
    //         concat!(
    //             "Offset of field: ",
    //             stringify!(error_condition),
    //             "::",
    //             stringify!(_M_cat)
    //         )
    //     );
    // }
    impl Default for error_condition {
        fn default() -> Self {
            unsafe { zeroed() }
        }
    }
    #[repr(C)]
    pub struct system_error {
        pub _base: self::root::std::runtime_error,
        pub _M_code: self::root::std::error_code,
    }
    // #[test]
    // fn bindgen_test_layout_system_error() {
    //     assert_eq!(
    //         size_of::<system_error>(),
    //         32usize,
    //         concat!("Size of: ", stringify!(system_error))
    //     );
    //     assert_eq!(
    //         align_of::<system_error>(),
    //         8usize,
    //         concat!("Alignment of ", stringify!(system_error))
    //     );
    //     assert_eq!(
    //         unsafe { &(*(::std::ptr::null::<system_error>()))._M_code as *const _ as usize },
    //         16usize,
    //         concat!(
    //             "Offset of field: ",
    //             stringify!(system_error),
    //             "::",
    //             stringify!(_M_code)
    //         )
    //     );
    // }
    impl Default for system_error {
        fn default() -> Self {
            unsafe { zeroed() }
        }
    }
    impl ::std::fmt::Debug for system_error {
        fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
            write!(f, "system_error {{ _M_code: {:?} }}", self._M_code)
        }
    }
    extern "C" {
        #[link_name = "\u{1}system_error_destructor"]
        pub fn system_error_system_error_destructor(this: *mut self::root::std::system_error);
    }
    pub const _Ios_Fmtflags__S_boolalpha: self::root::std::_Ios_Fmtflags = 1;
    pub const _Ios_Fmtflags__S_dec: self::root::std::_Ios_Fmtflags = 2;
    pub const _Ios_Fmtflags__S_fixed: self::root::std::_Ios_Fmtflags = 4;
    pub const _Ios_Fmtflags__S_hex: self::root::std::_Ios_Fmtflags = 8;
    pub const _Ios_Fmtflags__S_internal: self::root::std::_Ios_Fmtflags = 16;
    pub const _Ios_Fmtflags__S_left: self::root::std::_Ios_Fmtflags = 32;
    pub const _Ios_Fmtflags__S_oct: self::root::std::_Ios_Fmtflags = 64;
    pub const _Ios_Fmtflags__S_right: self::root::std::_Ios_Fmtflags = 128;
    pub const _Ios_Fmtflags__S_scientific: self::root::std::_Ios_Fmtflags = 256;
    pub const _Ios_Fmtflags__S_showbase: self::root::std::_Ios_Fmtflags = 512;
    pub const _Ios_Fmtflags__S_showpoint: self::root::std::_Ios_Fmtflags = 1024;
    pub const _Ios_Fmtflags__S_showpos: self::root::std::_Ios_Fmtflags = 2048;
    pub const _Ios_Fmtflags__S_skipws: self::root::std::_Ios_Fmtflags = 4096;
    pub const _Ios_Fmtflags__S_unitbuf: self::root::std::_Ios_Fmtflags = 8192;
    pub const _Ios_Fmtflags__S_uppercase: self::root::std::_Ios_Fmtflags = 16384;
    pub const _Ios_Fmtflags__S_adjustfield: self::root::std::_Ios_Fmtflags = 176;
    pub const _Ios_Fmtflags__S_basefield: self::root::std::_Ios_Fmtflags = 74;
    pub const _Ios_Fmtflags__S_floatfield: self::root::std::_Ios_Fmtflags = 260;
    pub const _Ios_Fmtflags__S_ios_fmtflags_end: self::root::std::_Ios_Fmtflags = 65536;
    pub const _Ios_Fmtflags__S_ios_fmtflags_max: self::root::std::_Ios_Fmtflags = 2147483647;
    pub const _Ios_Fmtflags__S_ios_fmtflags_min: self::root::std::_Ios_Fmtflags = -2147483648;
    pub type _Ios_Fmtflags = i32;
    pub const _Ios_Openmode__S_app: self::root::std::_Ios_Openmode = 1;
    pub const _Ios_Openmode__S_ate: self::root::std::_Ios_Openmode = 2;
    pub const _Ios_Openmode__S_bin: self::root::std::_Ios_Openmode = 4;
    pub const _Ios_Openmode__S_in: self::root::std::_Ios_Openmode = 8;
    pub const _Ios_Openmode__S_out: self::root::std::_Ios_Openmode = 16;
    pub const _Ios_Openmode__S_trunc: self::root::std::_Ios_Openmode = 32;
    pub const _Ios_Openmode__S_ios_openmode_end: self::root::std::_Ios_Openmode = 65536;
    pub const _Ios_Openmode__S_ios_openmode_max: self::root::std::_Ios_Openmode = 2147483647;
    pub const _Ios_Openmode__S_ios_openmode_min: self::root::std::_Ios_Openmode = -2147483648;
    pub type _Ios_Openmode = i32;
    pub const _Ios_Iostate__S_goodbit: self::root::std::_Ios_Iostate = 0;
    pub const _Ios_Iostate__S_badbit: self::root::std::_Ios_Iostate = 1;
    pub const _Ios_Iostate__S_eofbit: self::root::std::_Ios_Iostate = 2;
    pub const _Ios_Iostate__S_failbit: self::root::std::_Ios_Iostate = 4;
    pub const _Ios_Iostate__S_ios_iostate_end: self::root::std::_Ios_Iostate = 65536;
    pub const _Ios_Iostate__S_ios_iostate_max: self::root::std::_Ios_Iostate = 2147483647;
    pub const _Ios_Iostate__S_ios_iostate_min: self::root::std::_Ios_Iostate = -2147483648;
    pub type _Ios_Iostate = i32;
    pub const _Ios_Seekdir__S_beg: self::root::std::_Ios_Seekdir = 0;
    pub const _Ios_Seekdir__S_cur: self::root::std::_Ios_Seekdir = 1;
    pub const _Ios_Seekdir__S_end: self::root::std::_Ios_Seekdir = 2;
    pub const _Ios_Seekdir__S_ios_seekdir_end: self::root::std::_Ios_Seekdir = 65536;
    pub type _Ios_Seekdir = u32;
    #[repr(C)]
    pub struct ios_base__bindgen_vtable(c_void);
    #[repr(C)]
    #[derive(Debug, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct ios_base {
        pub vtable_: *const ios_base__bindgen_vtable,
        pub _M_precision: self::root::std::streamsize,
        pub _M_width: self::root::std::streamsize,
        pub _M_flags: self::root::std::ios_base_fmtflags,
        pub _M_exception: self::root::std::ios_base_iostate,
        pub _M_streambuf_state: self::root::std::ios_base_iostate,
        pub _M_callbacks: *mut self::root::std::ios_base__Callback_list,
        pub _M_word_zero: self::root::std::ios_base__Words,
        pub _M_local_word: [self::root::std::ios_base__Words; 8usize],
        pub _M_word_size: c_int,
        pub _M_word: *mut self::root::std::ios_base__Words,
        pub _M_ios_locale: self::root::std::locale,
    }
    #[repr(C)]
    pub struct ios_base_failure {
        pub _base: self::root::std::system_error,
    }
    // #[test]
    // fn bindgen_test_layout_ios_base_failure() {
    //     assert_eq!(
    //         size_of::<ios_base_failure>(),
    //         32usize,
    //         concat!("Size of: ", stringify!(ios_base_failure))
    //     );
    //     assert_eq!(
    //         align_of::<ios_base_failure>(),
    //         8usize,
    //         concat!("Alignment of ", stringify!(ios_base_failure))
    //     );
    // }
    extern "C" {
        #[link_name = "\u{1}failure"]
        pub fn ios_base_failure_failure(
            this: *mut self::root::std::ios_base_failure,
            __str: *const self::root::std::__cxx11::string,
        );
    }
    extern "C" {
        #[link_name = "\u{1}failure"]
        pub fn ios_base_failure_failure1(
            this: *mut self::root::std::ios_base_failure,
            arg1: *const self::root::std::__cxx11::string,
            arg2: *const self::root::std::error_code,
        );
    }
    extern "C" {
        #[link_name = "\u{1}failure"]
        pub fn ios_base_failure_failure2(
            this: *mut self::root::std::ios_base_failure,
            arg1: *const c_char,
            arg2: *const self::root::std::error_code,
        );
    }
    impl Default for ios_base_failure {
        fn default() -> Self {
            unsafe { zeroed() }
        }
    }
    impl ::std::fmt::Debug for ios_base_failure {
        fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
            write!(f, "ios_base_failure {{  }}")
        }
    }
    impl ios_base_failure {
        #[inline]
        pub unsafe fn new(__str: *const self::root::std::__cxx11::string) -> Self {
            let mut __bindgen_tmp = uninitialized();
            ios_base_failure_failure(&mut __bindgen_tmp, __str);
            __bindgen_tmp
        }
        #[inline]
        pub unsafe fn new1(
            arg1: *const self::root::std::__cxx11::string,
            arg2: *const self::root::std::error_code,
        ) -> Self {
            let mut __bindgen_tmp = uninitialized();
            ios_base_failure_failure1(&mut __bindgen_tmp, arg1, arg2);
            __bindgen_tmp
        }
        #[inline]
        pub unsafe fn new2(arg1: *const c_char, arg2: *const self::root::std::error_code) -> Self {
            let mut __bindgen_tmp = uninitialized();
            ios_base_failure_failure2(&mut __bindgen_tmp, arg1, arg2);
            __bindgen_tmp
        }
    }
    pub use std::_Ios_Fmtflags as ios_base_fmtflags;
    pub use std::_Ios_Iostate as ios_base_iostate;
    pub use std::_Ios_Openmode as ios_base_openmode;
    pub use std::_Ios_Seekdir as ios_base_seekdir;
    pub const ios_base_event_erase_event: self::root::std::ios_base_event = 0;
    pub const ios_base_event_imbue_event: self::root::std::ios_base_event = 1;
    pub const ios_base_event_copyfmt_event: self::root::std::ios_base_event = 2;
    pub type ios_base_event = u32;
    pub type ios_base_event_callback = ::std::option::Option<
        unsafe extern "C" fn(
            __e: self::root::std::ios_base_event,
            __b: *mut self::root::std::ios_base,
            __i: c_int,
        ),
    >;
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct ios_base__Callback_list {
        pub _M_next: *mut self::root::std::ios_base__Callback_list,
        pub _M_fn: self::root::std::ios_base_event_callback,
        pub _M_index: c_int,
        pub _M_refcount: self::root::_Atomic_word,
    }
    // #[test]
    // fn bindgen_test_layout_ios_base__Callback_list() {
    //     assert_eq!(
    //         size_of::<ios_base__Callback_list>(),
    //         24usize,
    //         concat!("Size of: ", stringify!(ios_base__Callback_list))
    //     );
    //     assert_eq!(
    //         align_of::<ios_base__Callback_list>(),
    //         8usize,
    //         concat!("Alignment of ", stringify!(ios_base__Callback_list))
    //     );
    //     assert_eq!(
    //         unsafe {
    //             &(*(::std::ptr::null::<ios_base__Callback_list>()))._M_next as *const _ as usize
    //         },
    //         0usize,
    //         concat!(
    //             "Offset of field: ",
    //             stringify!(ios_base__Callback_list),
    //             "::",
    //             stringify!(_M_next)
    //         )
    //     );
    //     assert_eq!(
    //         unsafe {
    //             &(*(::std::ptr::null::<ios_base__Callback_list>()))._M_fn as *const _ as usize
    //         },
    //         8usize,
    //         concat!(
    //             "Offset of field: ",
    //             stringify!(ios_base__Callback_list),
    //             "::",
    //             stringify!(_M_fn)
    //         )
    //     );
    //     assert_eq!(
    //         unsafe {
    //             &(*(::std::ptr::null::<ios_base__Callback_list>()))._M_index as *const _
    //                 as usize
    //         },
    //         16usize,
    //         concat!(
    //             "Offset of field: ",
    //             stringify!(ios_base__Callback_list),
    //             "::",
    //             stringify!(_M_index)
    //         )
    //     );
    //     assert_eq!(
    //         unsafe {
    //             &(*(::std::ptr::null::<ios_base__Callback_list>()))._M_refcount as *const _
    //                 as usize
    //         },
    //         20usize,
    //         concat!(
    //             "Offset of field: ",
    //             stringify!(ios_base__Callback_list),
    //             "::",
    //             stringify!(_M_refcount)
    //         )
    //     );
    // }
    impl Default for ios_base__Callback_list {
        fn default() -> Self {
            unsafe { zeroed() }
        }
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct ios_base__Words {
        pub _M_pword: *mut c_void,
        pub _M_iword: c_long,
    }
    // #[test]
    // fn bindgen_test_layout_ios_base__Words() {
    //     assert_eq!(
    //         size_of::<ios_base__Words>(),
    //         16usize,
    //         concat!("Size of: ", stringify!(ios_base__Words))
    //     );
    //     assert_eq!(
    //         align_of::<ios_base__Words>(),
    //         8usize,
    //         concat!("Alignment of ", stringify!(ios_base__Words))
    //     );
    //     assert_eq!(
    //         unsafe {
    //             &(*(::std::ptr::null::<ios_base__Words>()))._M_pword as *const _ as usize
    //         },
    //         0usize,
    //         concat!(
    //             "Offset of field: ",
    //             stringify!(ios_base__Words),
    //             "::",
    //             stringify!(_M_pword)
    //         )
    //     );
    //     assert_eq!(
    //         unsafe {
    //             &(*(::std::ptr::null::<ios_base__Words>()))._M_iword as *const _ as usize
    //         },
    //         8usize,
    //         concat!(
    //             "Offset of field: ",
    //             stringify!(ios_base__Words),
    //             "::",
    //             stringify!(_M_iword)
    //         )
    //     );
    // }
    impl Default for ios_base__Words {
        fn default() -> Self {
            unsafe { zeroed() }
        }
    }
    pub const ios_base__S_local_word_size: self::root::std::ios_base__bindgen_ty_1 = 8;
    pub type ios_base__bindgen_ty_1 = u32;
    #[repr(C)]
    #[derive(Debug, Default, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct ios_base_Init {
        pub _address: u8,
    }
    extern "C" {
        #[link_name = "\u{1}_S_refcount"]
        pub static mut ios_base_Init__S_refcount: self::root::_Atomic_word;
    }
    extern "C" {
        #[link_name = "\u{1}_S_synced_with_stdio"]
        pub static mut ios_base_Init__S_synced_with_stdio: bool;
    }
    // #[test]
    // fn bindgen_test_layout_ios_base_Init() {
    //     assert_eq!(
    //         size_of::<ios_base_Init>(),
    //         1usize,
    //         concat!("Size of: ", stringify!(ios_base_Init))
    //     );
    //     assert_eq!(
    //         align_of::<ios_base_Init>(),
    //         1usize,
    //         concat!("Alignment of ", stringify!(ios_base_Init))
    //     );
    // }
    extern "C" {
        #[link_name = "\u{1}Init"]
        pub fn ios_base_Init_Init(this: *mut self::root::std::ios_base_Init);
    }
    extern "C" {
        #[link_name = "\u{1}Init_destructor"]
        pub fn ios_base_Init_Init_destructor(this: *mut self::root::std::ios_base_Init);
    }
    impl ios_base_Init {
        #[inline]
        pub unsafe fn new() -> Self {
            let mut __bindgen_tmp = uninitialized();
            ios_base_Init_Init(&mut __bindgen_tmp);
            __bindgen_tmp
        }
        #[inline]
        pub unsafe fn destruct(&mut self) {
            ios_base_Init_Init_destructor(self)
        }
    }
    extern "C" {
        #[link_name = "\u{1}boolalpha"]
        pub static ios_base_boolalpha: self::root::std::ios_base_fmtflags;
    }
    extern "C" {
        #[link_name = "\u{1}dec"]
        pub static ios_base_dec: self::root::std::ios_base_fmtflags;
    }
    extern "C" {
        #[link_name = "\u{1}fixed"]
        pub static ios_base_fixed: self::root::std::ios_base_fmtflags;
    }
    extern "C" {
        #[link_name = "\u{1}hex"]
        pub static ios_base_hex: self::root::std::ios_base_fmtflags;
    }
    extern "C" {
        #[link_name = "\u{1}internal"]
        pub static ios_base_internal: self::root::std::ios_base_fmtflags;
    }
    extern "C" {
        #[link_name = "\u{1}left"]
        pub static ios_base_left: self::root::std::ios_base_fmtflags;
    }
    extern "C" {
        #[link_name = "\u{1}oct"]
        pub static ios_base_oct: self::root::std::ios_base_fmtflags;
    }
    extern "C" {
        #[link_name = "\u{1}right"]
        pub static ios_base_right: self::root::std::ios_base_fmtflags;
    }
    extern "C" {
        #[link_name = "\u{1}scientific"]
        pub static ios_base_scientific: self::root::std::ios_base_fmtflags;
    }
    extern "C" {
        #[link_name = "\u{1}showbase"]
        pub static ios_base_showbase: self::root::std::ios_base_fmtflags;
    }
    extern "C" {
        #[link_name = "\u{1}showpoint"]
        pub static ios_base_showpoint: self::root::std::ios_base_fmtflags;
    }
    extern "C" {
        #[link_name = "\u{1}showpos"]
        pub static ios_base_showpos: self::root::std::ios_base_fmtflags;
    }
    extern "C" {
        #[link_name = "\u{1}skipws"]
        pub static ios_base_skipws: self::root::std::ios_base_fmtflags;
    }
    extern "C" {
        #[link_name = "\u{1}unitbuf"]
        pub static ios_base_unitbuf: self::root::std::ios_base_fmtflags;
    }
    extern "C" {
        #[link_name = "\u{1}uppercase"]
        pub static ios_base_uppercase: self::root::std::ios_base_fmtflags;
    }
    extern "C" {
        #[link_name = "\u{1}adjustfield"]
        pub static ios_base_adjustfield: self::root::std::ios_base_fmtflags;
    }
    extern "C" {
        #[link_name = "\u{1}basefield"]
        pub static ios_base_basefield: self::root::std::ios_base_fmtflags;
    }
    extern "C" {
        #[link_name = "\u{1}floatfield"]
        pub static ios_base_floatfield: self::root::std::ios_base_fmtflags;
    }
    extern "C" {
        #[link_name = "\u{1}badbit"]
        pub static ios_base_badbit: self::root::std::ios_base_iostate;
    }
    extern "C" {
        #[link_name = "\u{1}eofbit"]
        pub static ios_base_eofbit: self::root::std::ios_base_iostate;
    }
    extern "C" {
        #[link_name = "\u{1}failbit"]
        pub static ios_base_failbit: self::root::std::ios_base_iostate;
    }
    extern "C" {
        #[link_name = "\u{1}goodbit"]
        pub static ios_base_goodbit: self::root::std::ios_base_iostate;
    }
    extern "C" {
        #[link_name = "\u{1}app"]
        pub static ios_base_app: self::root::std::ios_base_openmode;
    }
    extern "C" {
        #[link_name = "\u{1}ate"]
        pub static ios_base_ate: self::root::std::ios_base_openmode;
    }
    extern "C" {
        #[link_name = "\u{1}binary"]
        pub static ios_base_binary: self::root::std::ios_base_openmode;
    }
    extern "C" {
        #[link_name = "\u{1}in"]
        pub static ios_base_in: self::root::std::ios_base_openmode;
    }
    extern "C" {
        #[link_name = "\u{1}out"]
        pub static ios_base_out: self::root::std::ios_base_openmode;
    }
    extern "C" {
        #[link_name = "\u{1}trunc"]
        pub static ios_base_trunc: self::root::std::ios_base_openmode;
    }
    extern "C" {
        #[link_name = "\u{1}beg"]
        pub static ios_base_beg: self::root::std::ios_base_seekdir;
    }
    extern "C" {
        #[link_name = "\u{1}cur"]
        pub static ios_base_cur: self::root::std::ios_base_seekdir;
    }
    extern "C" {
        #[link_name = "\u{1}end"]
        pub static ios_base_end: self::root::std::ios_base_seekdir;
    }
    // #[test]
    // fn bindgen_test_layout_ios_base() {
    //     assert_eq!(
    //         size_of::<ios_base>(),
    //         216usize,
    //         concat!("Size of: ", stringify!(ios_base))
    //     );
    //     assert_eq!(
    //         align_of::<ios_base>(),
    //         8usize,
    //         concat!("Alignment of ", stringify!(ios_base))
    //     );
    //     assert_eq!(
    //         unsafe { &(*(::std::ptr::null::<ios_base>()))._M_precision as *const _ as usize },
    //         8usize,
    //         concat!(
    //             "Offset of field: ",
    //             stringify!(ios_base),
    //             "::",
    //             stringify!(_M_precision)
    //         )
    //     );
    //     assert_eq!(
    //         unsafe { &(*(::std::ptr::null::<ios_base>()))._M_width as *const _ as usize },
    //         16usize,
    //         concat!(
    //             "Offset of field: ",
    //             stringify!(ios_base),
    //             "::",
    //             stringify!(_M_width)
    //         )
    //     );
    //     assert_eq!(
    //         unsafe { &(*(::std::ptr::null::<ios_base>()))._M_flags as *const _ as usize },
    //         24usize,
    //         concat!(
    //             "Offset of field: ",
    //             stringify!(ios_base),
    //             "::",
    //             stringify!(_M_flags)
    //         )
    //     );
    //     assert_eq!(
    //         unsafe { &(*(::std::ptr::null::<ios_base>()))._M_exception as *const _ as usize },
    //         28usize,
    //         concat!(
    //             "Offset of field: ",
    //             stringify!(ios_base),
    //             "::",
    //             stringify!(_M_exception)
    //         )
    //     );
    //     assert_eq!(
    //         unsafe {
    //             &(*(::std::ptr::null::<ios_base>()))._M_streambuf_state as *const _ as usize
    //         },
    //         32usize,
    //         concat!(
    //             "Offset of field: ",
    //             stringify!(ios_base),
    //             "::",
    //             stringify!(_M_streambuf_state)
    //         )
    //     );
    //     assert_eq!(
    //         unsafe { &(*(::std::ptr::null::<ios_base>()))._M_callbacks as *const _ as usize },
    //         40usize,
    //         concat!(
    //             "Offset of field: ",
    //             stringify!(ios_base),
    //             "::",
    //             stringify!(_M_callbacks)
    //         )
    //     );
    //     assert_eq!(
    //         unsafe { &(*(::std::ptr::null::<ios_base>()))._M_word_zero as *const _ as usize },
    //         48usize,
    //         concat!(
    //             "Offset of field: ",
    //             stringify!(ios_base),
    //             "::",
    //             stringify!(_M_word_zero)
    //         )
    //     );
    //     assert_eq!(
    //         unsafe { &(*(::std::ptr::null::<ios_base>()))._M_local_word as *const _ as usize },
    //         64usize,
    //         concat!(
    //             "Offset of field: ",
    //             stringify!(ios_base),
    //             "::",
    //             stringify!(_M_local_word)
    //         )
    //     );
    //     assert_eq!(
    //         unsafe { &(*(::std::ptr::null::<ios_base>()))._M_word_size as *const _ as usize },
    //         192usize,
    //         concat!(
    //             "Offset of field: ",
    //             stringify!(ios_base),
    //             "::",
    //             stringify!(_M_word_size)
    //         )
    //     );
    //     assert_eq!(
    //         unsafe { &(*(::std::ptr::null::<ios_base>()))._M_word as *const _ as usize },
    //         200usize,
    //         concat!(
    //             "Offset of field: ",
    //             stringify!(ios_base),
    //             "::",
    //             stringify!(_M_word)
    //         )
    //     );
    //     assert_eq!(
    //         unsafe { &(*(::std::ptr::null::<ios_base>()))._M_ios_locale as *const _ as usize },
    //         208usize,
    //         concat!(
    //             "Offset of field: ",
    //             stringify!(ios_base),
    //             "::",
    //             stringify!(_M_ios_locale)
    //         )
    //     );
    // }
    extern "C" {
        #[link_name = "\u{1}register_callback"]
        pub fn ios_base_register_callback(
            this: *mut self::root::std::ios_base,
            __fn: self::root::std::ios_base_event_callback,
            __index: c_int,
        );
    }
    extern "C" {
        #[link_name = "\u{1}_M_call_callbacks"]
        pub fn ios_base__M_call_callbacks(
            this: *mut self::root::std::ios_base,
            __ev: self::root::std::ios_base_event,
        );
    }
    extern "C" {
        #[link_name = "\u{1}_M_dispose_callbacks"]
        pub fn ios_base__M_dispose_callbacks(this: *mut self::root::std::ios_base);
    }
    extern "C" {
        #[link_name = "\u{1}_M_grow_words"]
        pub fn ios_base__M_grow_words(
            this: *mut self::root::std::ios_base,
            __index: c_int,
            __iword: bool,
        ) -> *mut self::root::std::ios_base__Words;
    }
    extern "C" {
        #[link_name = "\u{1}_M_init"]
        pub fn ios_base__M_init(this: *mut self::root::std::ios_base);
    }
    extern "C" {
        #[link_name = "\u{1}sync_with_stdio"]
        pub fn ios_base_sync_with_stdio(__sync: bool) -> bool;
    }
    extern "C" {
        #[link_name = "\u{1}imbue"]
        pub fn ios_base_imbue(
            this: *mut self::root::std::ios_base,
            __loc: *const self::root::std::locale,
        ) -> self::root::std::locale;
    }
    extern "C" {
        #[link_name = "\u{1}xalloc"]
        pub fn ios_base_xalloc() -> c_int;
    }
    extern "C" {
        #[link_name = "\u{1}_M_move"]
        pub fn ios_base__M_move(
            this: *mut self::root::std::ios_base,
            arg1: *mut self::root::std::ios_base,
        );
    }
    extern "C" {
        #[link_name = "\u{1}_M_swap"]
        pub fn ios_base__M_swap(
            this: *mut self::root::std::ios_base,
            __rhs: *mut self::root::std::ios_base,
        );
    }
    extern "C" {
        #[link_name = "\u{1}ios_base"]
        pub fn ios_base_ios_base(this: *mut self::root::std::ios_base);
    }
    impl Default for ios_base {
        fn default() -> Self {
            unsafe { zeroed() }
        }
    }
    impl ios_base {
        #[inline]
        pub unsafe fn register_callback(
            &mut self,
            __fn: self::root::std::ios_base_event_callback,
            __index: c_int,
        ) {
            ios_base_register_callback(self, __fn, __index)
        }
        #[inline]
        pub unsafe fn _M_call_callbacks(&mut self, __ev: self::root::std::ios_base_event) {
            ios_base__M_call_callbacks(self, __ev)
        }
        #[inline]
        pub unsafe fn _M_dispose_callbacks(&mut self) {
            ios_base__M_dispose_callbacks(self)
        }
        #[inline]
        pub unsafe fn _M_grow_words(
            &mut self,
            __index: c_int,
            __iword: bool,
        ) -> *mut self::root::std::ios_base__Words {
            ios_base__M_grow_words(self, __index, __iword)
        }
        #[inline]
        pub unsafe fn _M_init(&mut self) {
            ios_base__M_init(self)
        }
        #[inline]
        pub unsafe fn sync_with_stdio(__sync: bool) -> bool {
            ios_base_sync_with_stdio(__sync)
        }
        #[inline]
        pub unsafe fn imbue(
            &mut self,
            __loc: *const self::root::std::locale,
        ) -> self::root::std::locale {
            ios_base_imbue(self, __loc)
        }
        #[inline]
        pub unsafe fn xalloc() -> c_int {
            ios_base_xalloc()
        }
        #[inline]
        pub unsafe fn _M_move(&mut self, arg1: *mut self::root::std::ios_base) {
            ios_base__M_move(self, arg1)
        }
        #[inline]
        pub unsafe fn _M_swap(&mut self, __rhs: *mut self::root::std::ios_base) {
            ios_base__M_swap(self, __rhs)
        }
        #[inline]
        pub unsafe fn new() -> Self {
            let mut __bindgen_tmp = uninitialized();
            ios_base_ios_base(&mut __bindgen_tmp);
            __bindgen_tmp
        }
    }
    extern "C" {
        #[link_name = "\u{1}failure_destructor"]
        pub fn ios_base_failure_failure_destructor(this: *mut self::root::std::ios_base_failure);
    }
    extern "C" {
        #[link_name = "\u{1}what"]
        pub fn ios_base_failure_what(this: *mut c_void) -> *const c_char;
    }
    extern "C" {
        #[link_name = "\u{1}ios_base_destructor"]
        pub fn ios_base_ios_base_destructor(this: *mut self::root::std::ios_base);
    }
    #[repr(C)]
    pub struct basic_streambuf__bindgen_vtable(c_void);
    #[repr(C)]
    #[derive(Debug, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct basic_streambuf<_CharT> {
        pub vtable_: *const basic_streambuf__bindgen_vtable,
        pub _M_in_beg: *mut self::root::std::basic_streambuf_char_type<_CharT>,
        pub _M_in_cur: *mut self::root::std::basic_streambuf_char_type<_CharT>,
        pub _M_in_end: *mut self::root::std::basic_streambuf_char_type<_CharT>,
        pub _M_out_beg: *mut self::root::std::basic_streambuf_char_type<_CharT>,
        pub _M_out_cur: *mut self::root::std::basic_streambuf_char_type<_CharT>,
        pub _M_out_end: *mut self::root::std::basic_streambuf_char_type<_CharT>,
        pub _M_buf_locale: self::root::std::locale,
        pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_CharT>>,
    }
    pub type basic_streambuf_char_type<_CharT> = _CharT;
    pub type basic_streambuf_traits_type<_Traits> = _Traits;
    pub type basic_streambuf_int_type = [u8; 0usize];
    pub type basic_streambuf_pos_type = [u8; 0usize];
    pub type basic_streambuf_off_type = [u8; 0usize];
    pub type basic_streambuf___streambuf_type<_CharT> =
        self::root::std::basic_streambuf<self::root::std::basic_streambuf_char_type<_CharT>>;
    impl<_CharT> Default for basic_streambuf<_CharT> {
        fn default() -> Self {
            unsafe { zeroed() }
        }
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct ctype_base {
        pub _address: u8,
    }
    pub type ctype_base___to_type = *const c_int;
    pub type ctype_base_mask = c_ushort;
    pub const ctype_base_upper: self::root::std::ctype_base_mask = 256;
    pub const ctype_base_lower: self::root::std::ctype_base_mask = 512;
    pub const ctype_base_alpha: self::root::std::ctype_base_mask = 1024;
    pub const ctype_base_digit: self::root::std::ctype_base_mask = 2048;
    pub const ctype_base_xdigit: self::root::std::ctype_base_mask = 4096;
    pub const ctype_base_space: self::root::std::ctype_base_mask = 8192;
    pub const ctype_base_print: self::root::std::ctype_base_mask = 16384;
    pub const ctype_base_graph: self::root::std::ctype_base_mask = 3076;
    pub const ctype_base_cntrl: self::root::std::ctype_base_mask = 2;
    pub const ctype_base_punct: self::root::std::ctype_base_mask = 4;
    pub const ctype_base_alnum: self::root::std::ctype_base_mask = 3072;
    pub const ctype_base_blank: self::root::std::ctype_base_mask = 1;
    // #[test]
    // fn bindgen_test_layout_ctype_base() {
    //     assert_eq!(
    //         size_of::<ctype_base>(),
    //         1usize,
    //         concat!("Size of: ", stringify!(ctype_base))
    //     );
    //     assert_eq!(
    //         align_of::<ctype_base>(),
    //         1usize,
    //         concat!("Alignment of ", stringify!(ctype_base))
    //     );
    // }
    #[repr(C)]
    pub struct istreambuf_iterator<_CharT> {
        pub _M_sbuf: *mut self::root::std::istreambuf_iterator_streambuf_type<_CharT>,
        pub _M_c: self::root::std::istreambuf_iterator_int_type,
        pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_CharT>>,
    }
    pub type istreambuf_iterator_char_type<_CharT> = _CharT;
    pub type istreambuf_iterator_traits_type<_Traits> = _Traits;
    pub type istreambuf_iterator_int_type = [u8; 0usize];
    pub type istreambuf_iterator_streambuf_type<_CharT> = self::root::std::basic_streambuf<_CharT>;
    pub type istreambuf_iterator_istream_type<_CharT> = self::root::std::basic_istream<_CharT>;
    impl<_CharT> Default for istreambuf_iterator<_CharT> {
        fn default() -> Self {
            unsafe { zeroed() }
        }
    }
    impl<_CharT> ::std::fmt::Debug for istreambuf_iterator<_CharT> {
        fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
            write!(f, "istreambuf_iterator {{ _M_sbuf: {:?} }}", self._M_sbuf)
        }
    }
    impl<_CharT> PartialEq for istreambuf_iterator<_CharT>
    where
        _CharT: PartialEq,
    {
        fn eq(&self, other: &istreambuf_iterator<_CharT>) -> bool {
            self._M_sbuf == other._M_sbuf && self._M_c == other._M_c
        }
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct ostreambuf_iterator<_CharT> {
        pub _M_sbuf: *mut self::root::std::ostreambuf_iterator_streambuf_type<_CharT>,
        pub _M_failed: bool,
        pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_CharT>>,
    }
    pub type ostreambuf_iterator_char_type<_CharT> = _CharT;
    pub type ostreambuf_iterator_traits_type<_Traits> = _Traits;
    pub type ostreambuf_iterator_streambuf_type<_CharT> = self::root::std::basic_streambuf<_CharT>;
    pub type ostreambuf_iterator_ostream_type<_CharT> = self::root::std::basic_ostream<_CharT>;
    impl<_CharT> Default for ostreambuf_iterator<_CharT> {
        fn default() -> Self {
            unsafe { zeroed() }
        }
    }
    #[repr(C)]
    #[derive(Debug, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __ctype_abstract_base {
        pub _base: self::root::std::locale_facet,
    }
    pub type __ctype_abstract_base_char_type<_CharT> = _CharT;
    impl Default for __ctype_abstract_base {
        fn default() -> Self {
            unsafe { zeroed() }
        }
    }
    #[repr(C)]
    #[derive(Debug, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct ctype {
        pub _base: self::root::std::__ctype_abstract_base,
    }
    pub type ctype_char_type<_CharT> = _CharT;
    pub type ctype_mask = self::root::std::__ctype_abstract_base;
    impl Default for ctype {
        fn default() -> Self {
            unsafe { zeroed() }
        }
    }
    #[repr(C)]
    #[derive(Debug, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct num_get {
        pub _base: self::root::std::locale_facet,
    }
    pub type num_get_char_type<_CharT> = _CharT;
    pub type num_get_iter_type<_InIter> = _InIter;
    impl Default for num_get {
        fn default() -> Self {
            unsafe { zeroed() }
        }
    }
    #[repr(C)]
    #[derive(Debug, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct num_put {
        pub _base: self::root::std::locale_facet,
    }
    pub type num_put_char_type<_CharT> = _CharT;
    pub type num_put_iter_type<_OutIter> = _OutIter;
    impl Default for num_put {
        fn default() -> Self {
            unsafe { zeroed() }
        }
    }
    #[repr(C)]
    #[derive(Debug, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct basic_ios<_CharT> {
        pub _base: self::root::std::ios_base,
        pub _M_tie: *mut self::root::std::basic_ostream<_CharT>,
        pub _M_fill: self::root::std::basic_ios_char_type<_CharT>,
        pub _M_fill_init: bool,
        pub _M_streambuf: *mut self::root::std::basic_streambuf<_CharT>,
        pub _M_ctype: *const self::root::std::basic_ios___ctype_type,
        pub _M_num_put: *const self::root::std::basic_ios___num_put_type,
        pub _M_num_get: *const self::root::std::basic_ios___num_get_type,
        pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_CharT>>,
    }
    pub type basic_ios_char_type<_CharT> = _CharT;
    pub type basic_ios_int_type = [u8; 0usize];
    pub type basic_ios_pos_type = [u8; 0usize];
    pub type basic_ios_off_type = [u8; 0usize];
    pub type basic_ios_traits_type<_Traits> = _Traits;
    pub type basic_ios___ctype_type = self::root::std::ctype;
    pub type basic_ios___num_put_type = self::root::std::num_put;
    pub type basic_ios___num_get_type = self::root::std::num_get;
    impl<_CharT> Default for basic_ios<_CharT> {
        fn default() -> Self {
            unsafe { zeroed() }
        }
    }
    #[repr(C)]
    #[derive(Debug, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct basic_ostream<_CharT> {
        pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_CharT>>,
    }
    pub type basic_ostream_char_type<_CharT> = _CharT;
    pub type basic_ostream_int_type = [u8; 0usize];
    pub type basic_ostream_pos_type = [u8; 0usize];
    pub type basic_ostream_off_type = [u8; 0usize];
    pub type basic_ostream_traits_type<_Traits> = _Traits;
    pub type basic_ostream___streambuf_type<_CharT> = self::root::std::basic_streambuf<_CharT>;
    pub type basic_ostream___ios_type<_CharT> = self::root::std::basic_ios<_CharT>;
    pub type basic_ostream___ostream_type<_CharT> = self::root::std::basic_ostream<_CharT>;
    pub type basic_ostream___num_put_type = self::root::std::num_put;
    pub type basic_ostream___ctype_type = self::root::std::ctype;
    impl<_CharT> Default for basic_ostream<_CharT> {
        fn default() -> Self {
            unsafe { zeroed() }
        }
    }
    #[repr(C)]
    #[derive(Debug, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct basic_ostream_sentry {
        pub _M_ok: bool,
        pub _M_os: *mut self::root::std::basic_ostream<_CharT>,
    }
    impl Default for basic_ostream_sentry {
        fn default() -> Self {
            unsafe { zeroed() }
        }
    }
    #[repr(C)]
    #[derive(Debug, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct basic_istream<_CharT> {
        pub _M_gcount: self::root::std::streamsize,
        pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_CharT>>,
    }
    pub type basic_istream_char_type<_CharT> = _CharT;
    pub type basic_istream_int_type = [u8; 0usize];
    pub type basic_istream_pos_type = [u8; 0usize];
    pub type basic_istream_off_type = [u8; 0usize];
    pub type basic_istream_traits_type<_Traits> = _Traits;
    pub type basic_istream___streambuf_type<_CharT> = self::root::std::basic_streambuf<_CharT>;
    pub type basic_istream___ios_type<_CharT> = self::root::std::basic_ios<_CharT>;
    pub type basic_istream___istream_type<_CharT> = self::root::std::basic_istream<_CharT>;
    pub type basic_istream___num_get_type = self::root::std::num_get;
    pub type basic_istream___ctype_type = self::root::std::ctype;
    impl<_CharT> Default for basic_istream<_CharT> {
        fn default() -> Self {
            unsafe { zeroed() }
        }
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct basic_istream_sentry {
        pub _M_ok: bool,
    }
    pub type basic_istream_sentry_traits_type = _Traits;
    pub type basic_istream_sentry___streambuf_type = self::root::std::basic_streambuf<_CharT>;
    pub type basic_istream_sentry___istream_type = self::root::std::basic_istream<_CharT>;
    pub type basic_istream_sentry___ctype_type = self::root::std::basic_istream___ctype_type;
    pub type basic_istream_sentry___int_type = [u8; 0usize];
    #[repr(C)]
    #[derive(Debug, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct basic_iostream<_CharT> {
        pub _base: self::root::std::basic_istream<_CharT>,
        pub _base_1: self::root::std::basic_ostream<_CharT>,
        pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_CharT>>,
    }
    pub type basic_iostream_char_type<_CharT> = _CharT;
    pub type basic_iostream_int_type = [u8; 0usize];
    pub type basic_iostream_pos_type = [u8; 0usize];
    pub type basic_iostream_off_type = [u8; 0usize];
    pub type basic_iostream_traits_type<_Traits> = _Traits;
    pub type basic_iostream___istream_type<_CharT> = self::root::std::basic_istream<_CharT>;
    pub type basic_iostream___ostream_type<_CharT> = self::root::std::basic_ostream<_CharT>;
    impl<_CharT> Default for basic_iostream<_CharT> {
        fn default() -> Self {
            unsafe { zeroed() }
        }
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct codecvt_base {
        pub _address: u8,
    }
    pub const codecvt_base_result_ok: self::root::std::codecvt_base_result = 0;
    pub const codecvt_base_result_partial: self::root::std::codecvt_base_result = 1;
    pub const codecvt_base_result_error: self::root::std::codecvt_base_result = 2;
    pub const codecvt_base_result_noconv: self::root::std::codecvt_base_result = 3;
    pub type codecvt_base_result = u32;
    // #[test]
    // fn bindgen_test_layout_codecvt_base() {
    //     assert_eq!(
    //         size_of::<codecvt_base>(),
    //         1usize,
    //         concat!("Size of: ", stringify!(codecvt_base))
    //     );
    //     assert_eq!(
    //         align_of::<codecvt_base>(),
    //         1usize,
    //         concat!("Alignment of ", stringify!(codecvt_base))
    //     );
    // }
    #[repr(C)]
    #[derive(Debug, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __codecvt_abstract_base {
        pub _base: self::root::std::locale_facet,
    }
    pub use std::codecvt_base_result as __codecvt_abstract_base_result;
    pub type __codecvt_abstract_base_intern_type<_InternT> = _InternT;
    pub type __codecvt_abstract_base_extern_type<_ExternT> = _ExternT;
    pub type __codecvt_abstract_base_state_type<_StateT> = _StateT;
    impl Default for __codecvt_abstract_base {
        fn default() -> Self {
            unsafe { zeroed() }
        }
    }
    #[repr(C)]
    #[derive(Debug, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct codecvt {
        pub _base: self::root::std::__codecvt_abstract_base,
        pub _M_c_locale_codecvt: self::root::std::__c_locale,
    }
    pub use std::codecvt_base_result as codecvt_result;
    pub type codecvt_intern_type<_InternT> = _InternT;
    pub type codecvt_extern_type<_ExternT> = _ExternT;
    pub type codecvt_state_type<_StateT> = _StateT;
    impl Default for codecvt {
        fn default() -> Self {
            unsafe { zeroed() }
        }
    }
    pub type __c_lock = self::root::__gthread_mutex_t;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __basic_file {
        pub _address: u8,
    }
    #[repr(C)]
    pub struct basic_filebuf<_CharT> {
        pub _base: self::root::std::basic_streambuf<_CharT>,
        pub _M_lock: self::root::std::__c_lock,
        pub _M_file: self::root::std::basic_filebuf___file_type,
        pub _M_mode: self::root::std::ios_base_openmode,
        pub _M_state_beg: self::root::std::basic_filebuf___state_type,
        pub _M_state_cur: self::root::std::basic_filebuf___state_type,
        pub _M_state_last: self::root::std::basic_filebuf___state_type,
        pub _M_buf: *mut self::root::std::basic_filebuf_char_type<_CharT>,
        pub _M_buf_size: usize,
        pub _M_buf_allocated: bool,
        pub _M_reading: bool,
        pub _M_writing: bool,
        pub _M_pback: self::root::std::basic_filebuf_char_type<_CharT>,
        pub _M_pback_cur_save: *mut self::root::std::basic_filebuf_char_type<_CharT>,
        pub _M_pback_end_save: *mut self::root::std::basic_filebuf_char_type<_CharT>,
        pub _M_pback_init: bool,
        pub _M_codecvt: *const self::root::std::basic_filebuf___codecvt_type,
        pub _M_ext_buf: *mut c_char,
        pub _M_ext_buf_size: self::root::std::streamsize,
        pub _M_ext_next: *const c_char,
        pub _M_ext_end: *mut c_char,
        pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_CharT>>,
    }
    pub type basic_filebuf___chk_state = self::root::std::__and_;
    pub type basic_filebuf_char_type<_CharT> = _CharT;
    pub type basic_filebuf_traits_type<_Traits> = _Traits;
    pub type basic_filebuf_int_type = [u8; 0usize];
    pub type basic_filebuf_pos_type = [u8; 0usize];
    pub type basic_filebuf_off_type = [u8; 0usize];
    pub type basic_filebuf___streambuf_type<_CharT> =
        self::root::std::basic_streambuf<self::root::std::basic_filebuf_char_type<_CharT>>;
    pub type basic_filebuf___filebuf_type<_CharT> =
        self::root::std::basic_filebuf<self::root::std::basic_filebuf_char_type<_CharT>>;
    pub type basic_filebuf___file_type = self::root::std::__basic_file;
    pub type basic_filebuf___state_type = [u8; 0usize];
    pub type basic_filebuf___codecvt_type = self::root::std::codecvt;
    impl<_CharT> Default for basic_filebuf<_CharT> {
        fn default() -> Self {
            unsafe { zeroed() }
        }
    }
    impl<_CharT> ::std::fmt::Debug for basic_filebuf<_CharT> {
        fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
            write ! ( f , "basic_filebuf {{ _M_lock: {:?}, _M_file: {:?}, _M_mode: {:?}, _M_buf: {:?}, _M_buf_size: {:?}, _M_buf_allocated: {:?}, _M_reading: {:?}, _M_writing: {:?}, _M_pback: Non-debuggable generic, _M_pback_cur_save: {:?}, _M_pback_end_save: {:?}, _M_pback_init: {:?}, _M_codecvt: {:?}, _M_ext_buf: {:?}, _M_ext_buf_size: {:?}, _M_ext_next: {:?}, _M_ext_end: {:?} }}" , self . _M_lock , self . _M_file , self . _M_mode , self . _M_buf , self . _M_buf_size , self . _M_buf_allocated , self . _M_reading , self . _M_writing , self . _M_pback_cur_save , self . _M_pback_end_save , self . _M_pback_init , self . _M_codecvt , self . _M_ext_buf , self . _M_ext_buf_size , self . _M_ext_next , self . _M_ext_end )
        }
    }
    #[repr(C)]
    pub struct basic_fstream<_CharT> {
        pub _base: self::root::std::basic_iostream<_CharT>,
        pub _M_filebuf: self::root::std::basic_fstream___filebuf_type<_CharT>,
        pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_CharT>>,
    }
    pub type basic_fstream_char_type<_CharT> = _CharT;
    pub type basic_fstream_traits_type<_Traits> = _Traits;
    pub type basic_fstream_int_type = [u8; 0usize];
    pub type basic_fstream_pos_type = [u8; 0usize];
    pub type basic_fstream_off_type = [u8; 0usize];
    pub type basic_fstream___filebuf_type<_CharT> =
        self::root::std::basic_filebuf<self::root::std::basic_fstream_char_type<_CharT>>;
    pub type basic_fstream___ios_type<_CharT> =
        self::root::std::basic_ios<self::root::std::basic_fstream_char_type<_CharT>>;
    pub type basic_fstream___iostream_type<_CharT> =
        self::root::std::basic_iostream<self::root::std::basic_fstream_char_type<_CharT>>;
    impl<_CharT> Default for basic_fstream<_CharT> {
        fn default() -> Self {
            unsafe { zeroed() }
        }
    }
    impl<_CharT> ::std::fmt::Debug for basic_fstream<_CharT> {
        fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
            write!(f, "basic_fstream {{ _M_filebuf: {:?} }}", self._M_filebuf)
        }
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct _List_node {
        pub _base: self::root::std::__detail::_List_node_base,
        pub _M_storage: self::root::__gnu_cxx::__aligned_membuf,
    }
    impl Default for _List_node {
        fn default() -> Self {
            unsafe { zeroed() }
        }
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct _List_iterator {
        pub _M_node: *mut self::root::std::__detail::_List_node_base,
    }
    pub type _List_iterator__Self = self::root::std::_List_iterator;
    pub type _List_iterator__Node = self::root::std::_List_node;
    pub type _List_iterator_difference_type = isize;
    pub type _List_iterator_iterator_category = self::root::std::bidirectional_iterator_tag;
    pub type _List_iterator_value_type<_Tp> = _Tp;
    pub type _List_iterator_pointer<_Tp> = *mut _Tp;
    pub type _List_iterator_reference<_Tp> = *mut _Tp;
    impl Default for _List_iterator {
        fn default() -> Self {
            unsafe { zeroed() }
        }
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct _List_const_iterator {
        pub _M_node: *const self::root::std::__detail::_List_node_base,
    }
    pub type _List_const_iterator__Self = self::root::std::_List_const_iterator;
    pub type _List_const_iterator__Node = self::root::std::_List_node;
    pub type _List_const_iterator_iterator = self::root::std::_List_iterator;
    pub type _List_const_iterator_difference_type = isize;
    pub type _List_const_iterator_iterator_category = self::root::std::bidirectional_iterator_tag;
    pub type _List_const_iterator_value_type<_Tp> = _Tp;
    pub type _List_const_iterator_pointer<_Tp> = *const _Tp;
    pub type _List_const_iterator_reference<_Tp> = *const _Tp;
    impl Default for _List_const_iterator {
        fn default() -> Self {
            unsafe { zeroed() }
        }
    }
}
pub mod __gnu_cxx {

    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __normal_iterator<_Iterator> {
        pub _M_current: _Iterator,
        pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Iterator>>,
    }
    pub type __normal_iterator___traits_type = self::root::std::iterator_traits;
    pub type __normal_iterator_iterator_type<_Iterator> = _Iterator;
    pub type __normal_iterator_iterator_category =
        self::root::__gnu_cxx::__normal_iterator___traits_type;
    pub type __normal_iterator_value_type = self::root::__gnu_cxx::__normal_iterator___traits_type;
    pub type __normal_iterator_difference_type =
        self::root::__gnu_cxx::__normal_iterator___traits_type;
    pub type __normal_iterator_reference = self::root::__gnu_cxx::__normal_iterator___traits_type;
    pub type __normal_iterator_pointer = self::root::__gnu_cxx::__normal_iterator___traits_type;
    impl<_Iterator> Default for __normal_iterator<_Iterator> {
        fn default() -> Self {
            unsafe { zeroed() }
        }
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct _Char_types {
        pub _address: u8,
    }
    pub type _Char_types_int_type = c_ulong;
    pub type _Char_types_pos_type = self::root::std::streampos;
    pub type _Char_types_off_type = self::root::std::streamoff;
    pub type _Char_types_state_type = self::root::mbstate_t;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct char_traits {
        pub _address: u8,
    }
    pub type char_traits_char_type<_CharT> = _CharT;
    pub type char_traits_int_type = self::root::__gnu_cxx::_Char_types;
    pub type char_traits_pos_type = self::root::__gnu_cxx::_Char_types;
    pub type char_traits_off_type = self::root::__gnu_cxx::_Char_types;
    pub type char_traits_state_type = self::root::__gnu_cxx::_Char_types;
    #[repr(C)]
    #[derive(Debug, Default, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct new_allocator {
        pub _address: u8,
    }
    pub type new_allocator_size_type = usize;
    pub type new_allocator_difference_type = isize;
    pub type new_allocator_pointer<_Tp> = *mut _Tp;
    pub type new_allocator_const_pointer<_Tp> = *const _Tp;
    pub type new_allocator_reference<_Tp> = *mut _Tp;
    pub type new_allocator_const_reference<_Tp> = *const _Tp;
    pub type new_allocator_value_type<_Tp> = _Tp;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct new_allocator_rebind {
        pub _address: u8,
    }
    pub type new_allocator_rebind_other = self::root::__gnu_cxx::new_allocator;
    pub type new_allocator_propagate_on_container_move_assignment = self::root::std::true_type;
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __alloc_traits {
        pub _address: u8,
    }
    pub type __alloc_traits_allocator_type<_Alloc> = _Alloc;
    pub type __alloc_traits__Base_type = self::root::std::allocator_traits;
    pub type __alloc_traits_value_type = self::root::__gnu_cxx::__alloc_traits__Base_type;
    pub type __alloc_traits_pointer = self::root::__gnu_cxx::__alloc_traits__Base_type;
    pub type __alloc_traits_const_pointer = self::root::__gnu_cxx::__alloc_traits__Base_type;
    pub type __alloc_traits_size_type = self::root::__gnu_cxx::__alloc_traits__Base_type;
    pub type __alloc_traits_difference_type = self::root::__gnu_cxx::__alloc_traits__Base_type;
    pub type __alloc_traits_reference = *mut self::root::__gnu_cxx::__alloc_traits_value_type;
    pub type __alloc_traits_const_reference =
        *const self::root::__gnu_cxx::__alloc_traits_value_type;
    pub type __alloc_traits___is_custom_pointer = self::root::std::__and_;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __alloc_traits_rebind {
        pub _address: u8,
    }
    pub type __alloc_traits_rebind_other = self::root::__gnu_cxx::__alloc_traits__Base_type;
    impl Default for __alloc_traits {
        fn default() -> Self {
            unsafe { zeroed() }
        }
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __aligned_membuf {
        pub _M_storage: *mut c_uchar,
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __aligned_membuf__Tp2<_Tp> {
        pub _M_t: _Tp,
        pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Tp>>,
    }
    impl<_Tp> Default for __aligned_membuf__Tp2<_Tp> {
        fn default() -> Self {
            unsafe { zeroed() }
        }
    }
    impl Default for __aligned_membuf {
        fn default() -> Self {
            unsafe { zeroed() }
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct __locale_struct {
    pub __locales: [*mut self::root::__locale_data; 13usize],
    pub __ctype_b: *const c_ushort,
    pub __ctype_tolower: *const c_int,
    pub __ctype_toupper: *const c_int,
    pub __names: [*const c_char; 13usize],
}
// #[test]
// fn bindgen_test_layout___locale_struct() {
//     assert_eq!(
//         size_of::<__locale_struct>(),
//         232usize,
//         concat!("Size of: ", stringify!(__locale_struct))
//     );
//     assert_eq!(
//         align_of::<__locale_struct>(),
//         8usize,
//         concat!("Alignment of ", stringify!(__locale_struct))
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<__locale_struct>())).__locales as *const _ as usize },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(__locale_struct),
//             "::",
//             stringify!(__locales)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<__locale_struct>())).__ctype_b as *const _ as usize },
//         104usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(__locale_struct),
//             "::",
//             stringify!(__ctype_b)
//         )
//     );
//     assert_eq!(
//         unsafe {
//             &(*(::std::ptr::null::<__locale_struct>())).__ctype_tolower as *const _ as usize
//         },
//         112usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(__locale_struct),
//             "::",
//             stringify!(__ctype_tolower)
//         )
//     );
//     assert_eq!(
//         unsafe {
//             &(*(::std::ptr::null::<__locale_struct>())).__ctype_toupper as *const _ as usize
//         },
//         120usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(__locale_struct),
//             "::",
//             stringify!(__ctype_toupper)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<__locale_struct>())).__names as *const _ as usize },
//         128usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(__locale_struct),
//             "::",
//             stringify!(__names)
//         )
//     );
// }
// impl Default for __locale_struct {
//     fn default() -> Self {
//         unsafe { zeroed() }
//     }
// }
// pub type __locale_t = *mut self::root::__locale_struct;
// pub type __off_t = c_long;
// pub type __off64_t = c_long;
// #[repr(C)]
// #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
// pub struct __pthread_internal_list {
//     pub __prev: *mut self::root::__pthread_internal_list,
//     pub __next: *mut self::root::__pthread_internal_list,
// }
// #[test]
// fn bindgen_test_layout___pthread_internal_list() {
//     assert_eq!(
//         size_of::<__pthread_internal_list>(),
//         16usize,
//         concat!("Size of: ", stringify!(__pthread_internal_list))
//     );
//     assert_eq!(
//         align_of::<__pthread_internal_list>(),
//         8usize,
//         concat!("Alignment of ", stringify!(__pthread_internal_list))
//     );
//     assert_eq!(
//         unsafe {
//             &(*(::std::ptr::null::<__pthread_internal_list>())).__prev as *const _ as usize
//         },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(__pthread_internal_list),
//             "::",
//             stringify!(__prev)
//         )
//     );
//     assert_eq!(
//         unsafe {
//             &(*(::std::ptr::null::<__pthread_internal_list>())).__next as *const _ as usize
//         },
//         8usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(__pthread_internal_list),
//             "::",
//             stringify!(__next)
//         )
//     );
// }
impl Default for __pthread_internal_list {
    fn default() -> Self {
        unsafe { zeroed() }
    }
}
pub type __pthread_list_t = self::root::__pthread_internal_list;
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct __pthread_mutex_s {
    pub __lock: c_int,
    pub __count: c_uint,
    pub __owner: c_int,
    pub __nusers: c_uint,
    pub __kind: c_int,
    pub __spins: c_short,
    pub __elision: c_short,
    pub __list: self::root::__pthread_list_t,
}
// #[test]
// fn bindgen_test_layout___pthread_mutex_s() {
//     assert_eq!(
//         size_of::<__pthread_mutex_s>(),
//         40usize,
//         concat!("Size of: ", stringify!(__pthread_mutex_s))
//     );
//     assert_eq!(
//         align_of::<__pthread_mutex_s>(),
//         8usize,
//         concat!("Alignment of ", stringify!(__pthread_mutex_s))
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__lock as *const _ as usize },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(__pthread_mutex_s),
//             "::",
//             stringify!(__lock)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__count as *const _ as usize },
//         4usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(__pthread_mutex_s),
//             "::",
//             stringify!(__count)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__owner as *const _ as usize },
//         8usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(__pthread_mutex_s),
//             "::",
//             stringify!(__owner)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__nusers as *const _ as usize },
//         12usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(__pthread_mutex_s),
//             "::",
//             stringify!(__nusers)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__kind as *const _ as usize },
//         16usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(__pthread_mutex_s),
//             "::",
//             stringify!(__kind)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__spins as *const _ as usize },
//         20usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(__pthread_mutex_s),
//             "::",
//             stringify!(__spins)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__elision as *const _ as usize },
//         22usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(__pthread_mutex_s),
//             "::",
//             stringify!(__elision)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<__pthread_mutex_s>())).__list as *const _ as usize },
//         24usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(__pthread_mutex_s),
//             "::",
//             stringify!(__list)
//         )
//     );
// }
impl Default for __pthread_mutex_s {
    fn default() -> Self {
        unsafe { zeroed() }
    }
}
pub type pthread_t = c_ulong;
pub type pthread_once_t = c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutex_t {
    pub __data: self::root::__pthread_mutex_s,
    pub __size: [c_char; 40usize],
    pub __align: c_long,
    _bindgen_union_align: [u64; 5usize],
}
// #[test]
// fn bindgen_test_layout_pthread_mutex_t() {
//     assert_eq!(
//         size_of::<pthread_mutex_t>(),
//         40usize,
//         concat!("Size of: ", stringify!(pthread_mutex_t))
//     );
//     assert_eq!(
//         align_of::<pthread_mutex_t>(),
//         8usize,
//         concat!("Alignment of ", stringify!(pthread_mutex_t))
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<pthread_mutex_t>())).__data as *const _ as usize },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(pthread_mutex_t),
//             "::",
//             stringify!(__data)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<pthread_mutex_t>())).__size as *const _ as usize },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(pthread_mutex_t),
//             "::",
//             stringify!(__size)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<pthread_mutex_t>())).__align as *const _ as usize },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(pthread_mutex_t),
//             "::",
//             stringify!(__align)
//         )
//     );
// }
// impl Default for pthread_mutex_t {
//     fn default() -> Self {
//         unsafe { zeroed() }
//     }
// }
// impl ::std::fmt::Debug for pthread_mutex_t {
//     fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
//         write!(f, "pthread_mutex_t {{ union }}")
//     }
// }
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialOrd, PartialEq)]
pub struct t_CKCOMPLEX {
    pub re: f64,
    pub im: f64,
}
// #[test]
// fn bindgen_test_layout_t_CKCOMPLEX() {
//     assert_eq!(
//         size_of::<t_CKCOMPLEX>(),
//         16usize,
//         concat!("Size of: ", stringify!(t_CKCOMPLEX))
//     );
//     assert_eq!(
//         align_of::<t_CKCOMPLEX>(),
//         8usize,
//         concat!("Alignment of ", stringify!(t_CKCOMPLEX))
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<t_CKCOMPLEX>())).re as *const _ as usize },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(t_CKCOMPLEX),
//             "::",
//             stringify!(re)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<t_CKCOMPLEX>())).im as *const _ as usize },
//         8usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(t_CKCOMPLEX),
//             "::",
//             stringify!(im)
//         )
//     );
// }
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialOrd, PartialEq)]
pub struct t_CKPOLAR {
    pub modulus: f64,
    pub phase: f64,
}
// #[test]
// fn bindgen_test_layout_t_CKPOLAR() {
//     assert_eq!(
//         size_of::<t_CKPOLAR>(),
//         16usize,
//         concat!("Size of: ", stringify!(t_CKPOLAR))
//     );
//     assert_eq!(
//         align_of::<t_CKPOLAR>(),
//         8usize,
//         concat!("Alignment of ", stringify!(t_CKPOLAR))
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<t_CKPOLAR>())).modulus as *const _ as usize },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(t_CKPOLAR),
//             "::",
//             stringify!(modulus)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<t_CKPOLAR>())).phase as *const _ as usize },
//         8usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(t_CKPOLAR),
//             "::",
//             stringify!(phase)
//         )
//     );
// }
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialOrd, PartialEq)]
pub struct t_CKVEC3 {
    pub x: f64,
    pub y: f64,
    pub z: f64,
}
// #[test]
// fn bindgen_test_layout_t_CKVEC3() {
//     assert_eq!(
//         size_of::<t_CKVEC3>(),
//         24usize,
//         concat!("Size of: ", stringify!(t_CKVEC3))
//     );
//     assert_eq!(
//         align_of::<t_CKVEC3>(),
//         8usize,
//         concat!("Alignment of ", stringify!(t_CKVEC3))
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<t_CKVEC3>())).x as *const _ as usize },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(t_CKVEC3),
//             "::",
//             stringify!(x)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<t_CKVEC3>())).y as *const _ as usize },
//         8usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(t_CKVEC3),
//             "::",
//             stringify!(y)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<t_CKVEC3>())).z as *const _ as usize },
//         16usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(t_CKVEC3),
//             "::",
//             stringify!(z)
//         )
//     );
// }
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialOrd, PartialEq)]
pub struct t_CKVEC4 {
    pub x: f64,
    pub y: f64,
    pub z: f64,
    pub w: f64,
}
// #[test]
// fn bindgen_test_layout_t_CKVEC4() {
//     assert_eq!(
//         size_of::<t_CKVEC4>(),
//         32usize,
//         concat!("Size of: ", stringify!(t_CKVEC4))
//     );
//     assert_eq!(
//         align_of::<t_CKVEC4>(),
//         8usize,
//         concat!("Alignment of ", stringify!(t_CKVEC4))
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<t_CKVEC4>())).x as *const _ as usize },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(t_CKVEC4),
//             "::",
//             stringify!(x)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<t_CKVEC4>())).y as *const _ as usize },
//         8usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(t_CKVEC4),
//             "::",
//             stringify!(y)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<t_CKVEC4>())).z as *const _ as usize },
//         16usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(t_CKVEC4),
//             "::",
//             stringify!(z)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<t_CKVEC4>())).w as *const _ as usize },
//         24usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(t_CKVEC4),
//             "::",
//             stringify!(w)
//         )
//     );
// }
pub type c_str = *mut c_char;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct S_Symbol_ {
    _unused: [u8; 0],
}
pub type S_Symbol = *mut self::root::S_Symbol_;
pub const ae_Operator_ae_op_plus: self::root::ae_Operator = 0;
pub const ae_Operator_ae_op_minus: self::root::ae_Operator = 1;
pub const ae_Operator_ae_op_times: self::root::ae_Operator = 2;
pub const ae_Operator_ae_op_divide: self::root::ae_Operator = 3;
pub const ae_Operator_ae_op_eq: self::root::ae_Operator = 4;
pub const ae_Operator_ae_op_neq: self::root::ae_Operator = 5;
pub const ae_Operator_ae_op_lt: self::root::ae_Operator = 6;
pub const ae_Operator_ae_op_le: self::root::ae_Operator = 7;
pub const ae_Operator_ae_op_gt: self::root::ae_Operator = 8;
pub const ae_Operator_ae_op_ge: self::root::ae_Operator = 9;
pub const ae_Operator_ae_op_and: self::root::ae_Operator = 10;
pub const ae_Operator_ae_op_or: self::root::ae_Operator = 11;
pub const ae_Operator_ae_op_s_or: self::root::ae_Operator = 12;
pub const ae_Operator_ae_op_s_and: self::root::ae_Operator = 13;
pub const ae_Operator_ae_op_shift_left: self::root::ae_Operator = 14;
pub const ae_Operator_ae_op_shift_right: self::root::ae_Operator = 15;
pub const ae_Operator_ae_op_percent: self::root::ae_Operator = 16;
pub const ae_Operator_ae_op_s_xor: self::root::ae_Operator = 17;
pub const ae_Operator_ae_op_chuck: self::root::ae_Operator = 18;
pub const ae_Operator_ae_op_plus_chuck: self::root::ae_Operator = 19;
pub const ae_Operator_ae_op_minus_chuck: self::root::ae_Operator = 20;
pub const ae_Operator_ae_op_times_chuck: self::root::ae_Operator = 21;
pub const ae_Operator_ae_op_divide_chuck: self::root::ae_Operator = 22;
pub const ae_Operator_ae_op_s_and_chuck: self::root::ae_Operator = 23;
pub const ae_Operator_ae_op_s_or_chuck: self::root::ae_Operator = 24;
pub const ae_Operator_ae_op_s_xor_chuck: self::root::ae_Operator = 25;
pub const ae_Operator_ae_op_shift_right_chuck: self::root::ae_Operator = 26;
pub const ae_Operator_ae_op_shift_left_chuck: self::root::ae_Operator = 27;
pub const ae_Operator_ae_op_percent_chuck: self::root::ae_Operator = 28;
pub const ae_Operator_ae_op_s_chuck: self::root::ae_Operator = 29;
pub const ae_Operator_ae_op_plusplus: self::root::ae_Operator = 30;
pub const ae_Operator_ae_op_minusminus: self::root::ae_Operator = 31;
pub const ae_Operator_ae_op_tilda: self::root::ae_Operator = 32;
pub const ae_Operator_ae_op_exclamation: self::root::ae_Operator = 33;
pub const ae_Operator_ae_op_at_chuck: self::root::ae_Operator = 34;
pub const ae_Operator_ae_op_unchuck: self::root::ae_Operator = 35;
pub const ae_Operator_ae_op_upchuck: self::root::ae_Operator = 36;
pub const ae_Operator_ae_op_spork: self::root::ae_Operator = 37;
pub const ae_Operator_ae_op_typeof: self::root::ae_Operator = 38;
pub const ae_Operator_ae_op_sizeof: self::root::ae_Operator = 39;
pub const ae_Operator_ae_op_new: self::root::ae_Operator = 40;
pub const ae_Operator_ae_op_arrow_left: self::root::ae_Operator = 41;
pub const ae_Operator_ae_op_arrow_right: self::root::ae_Operator = 42;
pub type ae_Operator = u32;
pub const ae_Keyword_ae_key_this: self::root::ae_Keyword = 0;
pub const ae_Keyword_ae_key_me: self::root::ae_Keyword = 1;
pub const ae_Keyword_ae_key_func: self::root::ae_Keyword = 2;
pub const ae_Keyword_ae_key_public: self::root::ae_Keyword = 3;
pub const ae_Keyword_ae_key_protected: self::root::ae_Keyword = 4;
pub const ae_Keyword_ae_key_private: self::root::ae_Keyword = 5;
pub const ae_Keyword_ae_key_static: self::root::ae_Keyword = 6;
pub const ae_Keyword_ae_key_instance: self::root::ae_Keyword = 7;
pub const ae_Keyword_ae_key_abstract: self::root::ae_Keyword = 8;
pub type ae_Keyword = u32;
pub type a_Program = *mut self::root::a_Program_;
pub type a_Section = *mut self::root::a_Section_;
pub type a_Stmt_List = *mut self::root::a_Stmt_List_;
pub type a_Class_Def = *mut self::root::a_Class_Def_;
pub type a_Func_Def = *mut self::root::a_Func_Def_;
pub type a_Stmt = *mut self::root::a_Stmt_;
pub type a_Exp = *mut self::root::a_Exp_;
pub type a_Var_Decl = *mut self::root::a_Var_Decl_;
pub type a_Var_Decl_List = *mut self::root::a_Var_Decl_List_;
pub type a_Type_Decl = *mut self::root::a_Type_Decl_;
pub type a_Arg_List = *mut self::root::a_Arg_List_;
pub type a_Id_List = *mut self::root::a_Id_List_;
pub type a_Class_Ext = *mut self::root::a_Class_Ext_;
pub type a_Class_Body = *mut self::root::a_Class_Body_;
pub type a_Array_Sub = *mut self::root::a_Array_Sub_;
pub type a_Complex = *mut self::root::a_Complex_;
pub type a_Polar = *mut self::root::a_Polar_;
pub type a_Vec = *mut self::root::a_Vec_;
pub type t_CKTYPE = *mut self::root::Chuck_Type;
pub type t_CKVALUE = *mut self::root::Chuck_Value;
pub type t_CKFUNC = *mut self::root::Chuck_Func;
pub type t_CKNSPC = *mut self::root::Chuck_Namespace;
pub type t_CKVMCODE = *mut self::root::Chuck_VM_Code;
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct a_Exp_Binary_ {
    pub lhs: self::root::a_Exp,
    pub op: self::root::ae_Operator,
    pub rhs: self::root::a_Exp,
    pub ck_func: self::root::t_CKFUNC,
    pub linepos: c_int,
    pub self_: self::root::a_Exp,
}
// #[test]
// fn bindgen_test_layout_a_Exp_Binary_() {
//     assert_eq!(
//         size_of::<a_Exp_Binary_>(),
//         48usize,
//         concat!("Size of: ", stringify!(a_Exp_Binary_))
//     );
//     assert_eq!(
//         align_of::<a_Exp_Binary_>(),
//         8usize,
//         concat!("Alignment of ", stringify!(a_Exp_Binary_))
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Exp_Binary_>())).lhs as *const _ as usize },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp_Binary_),
//             "::",
//             stringify!(lhs)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Exp_Binary_>())).op as *const _ as usize },
//         8usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp_Binary_),
//             "::",
//             stringify!(op)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Exp_Binary_>())).rhs as *const _ as usize },
//         16usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp_Binary_),
//             "::",
//             stringify!(rhs)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Exp_Binary_>())).ck_func as *const _ as usize },
//         24usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp_Binary_),
//             "::",
//             stringify!(ck_func)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Exp_Binary_>())).linepos as *const _ as usize },
//         32usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp_Binary_),
//             "::",
//             stringify!(linepos)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Exp_Binary_>())).self_ as *const _ as usize },
//         40usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp_Binary_),
//             "::",
//             stringify!(self_)
//         )
//     );
// }
impl Default for a_Exp_Binary_ {
    fn default() -> Self {
        unsafe { zeroed() }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct a_Exp_Cast_ {
    pub type_: self::root::a_Type_Decl,
    pub exp: self::root::a_Exp,
    pub linepos: c_int,
    pub self_: self::root::a_Exp,
}
// #[test]
// fn bindgen_test_layout_a_Exp_Cast_() {
//     assert_eq!(
//         size_of::<a_Exp_Cast_>(),
//         32usize,
//         concat!("Size of: ", stringify!(a_Exp_Cast_))
//     );
//     assert_eq!(
//         align_of::<a_Exp_Cast_>(),
//         8usize,
//         concat!("Alignment of ", stringify!(a_Exp_Cast_))
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Exp_Cast_>())).type_ as *const _ as usize },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp_Cast_),
//             "::",
//             stringify!(type_)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Exp_Cast_>())).exp as *const _ as usize },
//         8usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp_Cast_),
//             "::",
//             stringify!(exp)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Exp_Cast_>())).linepos as *const _ as usize },
//         16usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp_Cast_),
//             "::",
//             stringify!(linepos)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Exp_Cast_>())).self_ as *const _ as usize },
//         24usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp_Cast_),
//             "::",
//             stringify!(self_)
//         )
//     );
// }
impl Default for a_Exp_Cast_ {
    fn default() -> Self {
        unsafe { zeroed() }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct a_Exp_Unary_ {
    pub op: self::root::ae_Operator,
    pub exp: self::root::a_Exp,
    pub type_: self::root::a_Type_Decl,
    pub array: self::root::a_Array_Sub,
    pub code: self::root::a_Stmt,
    pub linepos: c_int,
    pub self_: self::root::a_Exp,
}
// #[test]
// fn bindgen_test_layout_a_Exp_Unary_() {
//     assert_eq!(
//         size_of::<a_Exp_Unary_>(),
//         56usize,
//         concat!("Size of: ", stringify!(a_Exp_Unary_))
//     );
//     assert_eq!(
//         align_of::<a_Exp_Unary_>(),
//         8usize,
//         concat!("Alignment of ", stringify!(a_Exp_Unary_))
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Exp_Unary_>())).op as *const _ as usize },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp_Unary_),
//             "::",
//             stringify!(op)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Exp_Unary_>())).exp as *const _ as usize },
//         8usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp_Unary_),
//             "::",
//             stringify!(exp)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Exp_Unary_>())).type_ as *const _ as usize },
//         16usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp_Unary_),
//             "::",
//             stringify!(type_)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Exp_Unary_>())).array as *const _ as usize },
//         24usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp_Unary_),
//             "::",
//             stringify!(array)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Exp_Unary_>())).code as *const _ as usize },
//         32usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp_Unary_),
//             "::",
//             stringify!(code)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Exp_Unary_>())).linepos as *const _ as usize },
//         40usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp_Unary_),
//             "::",
//             stringify!(linepos)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Exp_Unary_>())).self_ as *const _ as usize },
//         48usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp_Unary_),
//             "::",
//             stringify!(self_)
//         )
//     );
// }
impl Default for a_Exp_Unary_ {
    fn default() -> Self {
        unsafe { zeroed() }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct a_Exp_Postfix_ {
    pub exp: self::root::a_Exp,
    pub op: self::root::ae_Operator,
    pub linepos: c_int,
    pub self_: self::root::a_Exp,
}
// 3
impl Default for a_Exp_Postfix_ {
    fn default() -> Self {
        unsafe { zeroed() }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct a_Exp_Dur_ {
    pub base: self::root::a_Exp,
    pub unit: self::root::a_Exp,
    pub linepos: c_int,
    pub self_: self::root::a_Exp,
}
// #[test]
// fn bindgen_test_layout_a_Exp_Dur_() {
//     assert_eq!(
//         size_of::<a_Exp_Dur_>(),
//         32usize,
//         concat!("Size of: ", stringify!(a_Exp_Dur_))
//     );
//     assert_eq!(
//         align_of::<a_Exp_Dur_>(),
//         8usize,
//         concat!("Alignment of ", stringify!(a_Exp_Dur_))
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Exp_Dur_>())).base as *const _ as usize },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp_Dur_),
//             "::",
//             stringify!(base)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Exp_Dur_>())).unit as *const _ as usize },
//         8usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp_Dur_),
//             "::",
//             stringify!(unit)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Exp_Dur_>())).linepos as *const _ as usize },
//         16usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp_Dur_),
//             "::",
//             stringify!(linepos)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Exp_Dur_>())).self_ as *const _ as usize },
//         24usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp_Dur_),
//             "::",
//             stringify!(self_)
//         )
//     );
// }
impl Default for a_Exp_Dur_ {
    fn default() -> Self {
        unsafe { zeroed() }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct a_Exp_Array_ {
    pub base: self::root::a_Exp,
    pub indices: self::root::a_Array_Sub,
    pub linepos: c_int,
    pub self_: self::root::a_Exp,
}
// #[test]
// fn bindgen_test_layout_a_Exp_Array_() {
//     assert_eq!(
//         size_of::<a_Exp_Array_>(),
//         32usize,
//         concat!("Size of: ", stringify!(a_Exp_Array_))
//     );
//     assert_eq!(
//         align_of::<a_Exp_Array_>(),
//         8usize,
//         concat!("Alignment of ", stringify!(a_Exp_Array_))
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Exp_Array_>())).base as *const _ as usize },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp_Array_),
//             "::",
//             stringify!(base)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Exp_Array_>())).indices as *const _ as usize },
//         8usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp_Array_),
//             "::",
//             stringify!(indices)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Exp_Array_>())).linepos as *const _ as usize },
//         16usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp_Array_),
//             "::",
//             stringify!(linepos)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Exp_Array_>())).self_ as *const _ as usize },
//         24usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp_Array_),
//             "::",
//             stringify!(self_)
//         )
//     );
// }
impl Default for a_Exp_Array_ {
    fn default() -> Self {
        unsafe { zeroed() }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct a_Exp_Func_Call_ {
    pub func: self::root::a_Exp,
    pub args: self::root::a_Exp,
    pub ret_type: self::root::t_CKTYPE,
    pub ck_func: self::root::t_CKFUNC,
    pub ck_vm_code: self::root::t_CKVMCODE,
    pub linepos: c_int,
    pub self_: self::root::a_Exp,
}
// #[test]
// fn bindgen_test_layout_a_Exp_Func_Call_() {
//     assert_eq!(
//         size_of::<a_Exp_Func_Call_>(),
//         56usize,
//         concat!("Size of: ", stringify!(a_Exp_Func_Call_))
//     );
//     assert_eq!(
//         align_of::<a_Exp_Func_Call_>(),
//         8usize,
//         concat!("Alignment of ", stringify!(a_Exp_Func_Call_))
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Exp_Func_Call_>())).func as *const _ as usize },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp_Func_Call_),
//             "::",
//             stringify!(func)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Exp_Func_Call_>())).args as *const _ as usize },
//         8usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp_Func_Call_),
//             "::",
//             stringify!(args)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Exp_Func_Call_>())).ret_type as *const _ as usize },
//         16usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp_Func_Call_),
//             "::",
//             stringify!(ret_type)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Exp_Func_Call_>())).ck_func as *const _ as usize },
//         24usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp_Func_Call_),
//             "::",
//             stringify!(ck_func)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Exp_Func_Call_>())).ck_vm_code as *const _ as usize },
//         32usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp_Func_Call_),
//             "::",
//             stringify!(ck_vm_code)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Exp_Func_Call_>())).linepos as *const _ as usize },
//         40usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp_Func_Call_),
//             "::",
//             stringify!(linepos)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Exp_Func_Call_>())).self_ as *const _ as usize },
//         48usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp_Func_Call_),
//             "::",
//             stringify!(self_)
//         )
//     );
// }
impl Default for a_Exp_Func_Call_ {
    fn default() -> Self {
        unsafe { zeroed() }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct a_Exp_Dot_Member_ {
    pub base: self::root::a_Exp,
    pub t_base: self::root::t_CKTYPE,
    pub xid: self::root::S_Symbol,
    pub linepos: c_int,
    pub self_: self::root::a_Exp,
}
// #[test]
// fn bindgen_test_layout_a_Exp_Dot_Member_() {
//     assert_eq!(
//         size_of::<a_Exp_Dot_Member_>(),
//         40usize,
//         concat!("Size of: ", stringify!(a_Exp_Dot_Member_))
//     );
//     assert_eq!(
//         align_of::<a_Exp_Dot_Member_>(),
//         8usize,
//         concat!("Alignment of ", stringify!(a_Exp_Dot_Member_))
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Exp_Dot_Member_>())).base as *const _ as usize },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp_Dot_Member_),
//             "::",
//             stringify!(base)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Exp_Dot_Member_>())).t_base as *const _ as usize },
//         8usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp_Dot_Member_),
//             "::",
//             stringify!(t_base)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Exp_Dot_Member_>())).xid as *const _ as usize },
//         16usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp_Dot_Member_),
//             "::",
//             stringify!(xid)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Exp_Dot_Member_>())).linepos as *const _ as usize },
//         24usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp_Dot_Member_),
//             "::",
//             stringify!(linepos)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Exp_Dot_Member_>())).self_ as *const _ as usize },
//         32usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp_Dot_Member_),
//             "::",
//             stringify!(self_)
//         )
//     );
// }
impl Default for a_Exp_Dot_Member_ {
    fn default() -> Self {
        unsafe { zeroed() }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct a_Exp_If_ {
    pub cond: self::root::a_Exp,
    pub if_exp: self::root::a_Exp,
    pub else_exp: self::root::a_Exp,
    pub linepos: c_int,
    pub self_: self::root::a_Exp,
}
// #[test]
// fn bindgen_test_layout_a_Exp_If_() {
//     assert_eq!(
//         size_of::<a_Exp_If_>(),
//         40usize,
//         concat!("Size of: ", stringify!(a_Exp_If_))
//     );
//     assert_eq!(
//         align_of::<a_Exp_If_>(),
//         8usize,
//         concat!("Alignment of ", stringify!(a_Exp_If_))
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Exp_If_>())).cond as *const _ as usize },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp_If_),
//             "::",
//             stringify!(cond)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Exp_If_>())).if_exp as *const _ as usize },
//         8usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp_If_),
//             "::",
//             stringify!(if_exp)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Exp_If_>())).else_exp as *const _ as usize },
//         16usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp_If_),
//             "::",
//             stringify!(else_exp)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Exp_If_>())).linepos as *const _ as usize },
//         24usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp_If_),
//             "::",
//             stringify!(linepos)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Exp_If_>())).self_ as *const _ as usize },
//         32usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp_If_),
//             "::",
//             stringify!(self_)
//         )
//     );
// }
impl Default for a_Exp_If_ {
    fn default() -> Self {
        unsafe { zeroed() }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct a_Exp_Decl_ {
    pub type_: self::root::a_Type_Decl,
    pub var_decl_list: self::root::a_Var_Decl_List,
    pub num_var_decls: c_int,
    pub is_static: c_int,
    pub is_global: c_int,
    pub ck_type: self::root::t_CKTYPE,
    pub linepos: c_int,
    pub self_: self::root::a_Exp,
}
// #[test]
// fn bindgen_test_layout_a_Exp_Decl_() {
//     assert_eq!(
//         size_of::<a_Exp_Decl_>(),
//         56usize,
//         concat!("Size of: ", stringify!(a_Exp_Decl_))
//     );
//     assert_eq!(
//         align_of::<a_Exp_Decl_>(),
//         8usize,
//         concat!("Alignment of ", stringify!(a_Exp_Decl_))
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Exp_Decl_>())).type_ as *const _ as usize },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp_Decl_),
//             "::",
//             stringify!(type_)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Exp_Decl_>())).var_decl_list as *const _ as usize },
//         8usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp_Decl_),
//             "::",
//             stringify!(var_decl_list)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Exp_Decl_>())).num_var_decls as *const _ as usize },
//         16usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp_Decl_),
//             "::",
//             stringify!(num_var_decls)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Exp_Decl_>())).is_static as *const _ as usize },
//         20usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp_Decl_),
//             "::",
//             stringify!(is_static)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Exp_Decl_>())).is_global as *const _ as usize },
//         24usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp_Decl_),
//             "::",
//             stringify!(is_global)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Exp_Decl_>())).ck_type as *const _ as usize },
//         32usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp_Decl_),
//             "::",
//             stringify!(ck_type)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Exp_Decl_>())).linepos as *const _ as usize },
//         40usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp_Decl_),
//             "::",
//             stringify!(linepos)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Exp_Decl_>())).self_ as *const _ as usize },
//         48usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp_Decl_),
//             "::",
//             stringify!(self_)
//         )
//     );
// }
impl Default for a_Exp_Decl_ {
    fn default() -> Self {
        unsafe { zeroed() }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct a_Var_Decl_List_ {
    pub var_decl: self::root::a_Var_Decl,
    pub next: self::root::a_Var_Decl_List,
    pub linepos: c_int,
    pub self_: self::root::a_Exp,
}
// #[test]
// fn bindgen_test_layout_a_Var_Decl_List_() {
//     assert_eq!(
//         size_of::<a_Var_Decl_List_>(),
//         32usize,
//         concat!("Size of: ", stringify!(a_Var_Decl_List_))
//     );
//     assert_eq!(
//         align_of::<a_Var_Decl_List_>(),
//         8usize,
//         concat!("Alignment of ", stringify!(a_Var_Decl_List_))
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Var_Decl_List_>())).var_decl as *const _ as usize },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Var_Decl_List_),
//             "::",
//             stringify!(var_decl)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Var_Decl_List_>())).next as *const _ as usize },
//         8usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Var_Decl_List_),
//             "::",
//             stringify!(next)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Var_Decl_List_>())).linepos as *const _ as usize },
//         16usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Var_Decl_List_),
//             "::",
//             stringify!(linepos)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Var_Decl_List_>())).self_ as *const _ as usize },
//         24usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Var_Decl_List_),
//             "::",
//             stringify!(self_)
//         )
//     );
// }
impl Default for a_Var_Decl_List_ {
    fn default() -> Self {
        unsafe { zeroed() }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct a_Var_Decl_ {
    pub xid: self::root::S_Symbol,
    pub var_decl: self::root::a_Var_Decl,
    pub array: self::root::a_Array_Sub,
    pub value: self::root::t_CKVALUE,
    pub addr: *mut c_void,
    pub linepos: c_int,
    pub self_: self::root::a_Exp,
}
// #[test]
// fn bindgen_test_layout_a_Var_Decl_() {
//     assert_eq!(
//         size_of::<a_Var_Decl_>(),
//         56usize,
//         concat!("Size of: ", stringify!(a_Var_Decl_))
//     );
//     assert_eq!(
//         align_of::<a_Var_Decl_>(),
//         8usize,
//         concat!("Alignment of ", stringify!(a_Var_Decl_))
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Var_Decl_>())).xid as *const _ as usize },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Var_Decl_),
//             "::",
//             stringify!(xid)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Var_Decl_>())).var_decl as *const _ as usize },
//         8usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Var_Decl_),
//             "::",
//             stringify!(var_decl)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Var_Decl_>())).array as *const _ as usize },
//         16usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Var_Decl_),
//             "::",
//             stringify!(array)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Var_Decl_>())).value as *const _ as usize },
//         24usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Var_Decl_),
//             "::",
//             stringify!(value)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Var_Decl_>())).addr as *const _ as usize },
//         32usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Var_Decl_),
//             "::",
//             stringify!(addr)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Var_Decl_>())).linepos as *const _ as usize },
//         40usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Var_Decl_),
//             "::",
//             stringify!(linepos)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Var_Decl_>())).self_ as *const _ as usize },
//         48usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Var_Decl_),
//             "::",
//             stringify!(self_)
//         )
//     );
// }
impl Default for a_Var_Decl_ {
    fn default() -> Self {
        unsafe { zeroed() }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct a_Type_Decl_ {
    pub xid: self::root::a_Id_List,
    pub array: self::root::a_Array_Sub,
    pub ref_: c_int,
    pub linepos: c_int,
}
// #[test]
// fn bindgen_test_layout_a_Type_Decl_() {
//     assert_eq!(
//         size_of::<a_Type_Decl_>(),
//         24usize,
//         concat!("Size of: ", stringify!(a_Type_Decl_))
//     );
//     assert_eq!(
//         align_of::<a_Type_Decl_>(),
//         8usize,
//         concat!("Alignment of ", stringify!(a_Type_Decl_))
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Type_Decl_>())).xid as *const _ as usize },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Type_Decl_),
//             "::",
//             stringify!(xid)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Type_Decl_>())).array as *const _ as usize },
//         8usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Type_Decl_),
//             "::",
//             stringify!(array)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Type_Decl_>())).ref_ as *const _ as usize },
//         16usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Type_Decl_),
//             "::",
//             stringify!(ref_)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Type_Decl_>())).linepos as *const _ as usize },
//         20usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Type_Decl_),
//             "::",
//             stringify!(linepos)
//         )
//     );
// }
impl Default for a_Type_Decl_ {
    fn default() -> Self {
        unsafe { zeroed() }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct a_Array_Sub_ {
    pub depth: c_ulong,
    pub exp_list: self::root::a_Exp,
    pub linepos: c_int,
    pub self_: self::root::a_Exp,
    pub err_num: c_int,
    pub err_pos: c_int,
}
// #[test]
// fn bindgen_test_layout_a_Array_Sub_() {
//     assert_eq!(
//         size_of::<a_Array_Sub_>(),
//         40usize,
//         concat!("Size of: ", stringify!(a_Array_Sub_))
//     );
//     assert_eq!(
//         align_of::<a_Array_Sub_>(),
//         8usize,
//         concat!("Alignment of ", stringify!(a_Array_Sub_))
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Array_Sub_>())).depth as *const _ as usize },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Array_Sub_),
//             "::",
//             stringify!(depth)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Array_Sub_>())).exp_list as *const _ as usize },
//         8usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Array_Sub_),
//             "::",
//             stringify!(exp_list)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Array_Sub_>())).linepos as *const _ as usize },
//         16usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Array_Sub_),
//             "::",
//             stringify!(linepos)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Array_Sub_>())).self_ as *const _ as usize },
//         24usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Array_Sub_),
//             "::",
//             stringify!(self_)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Array_Sub_>())).err_num as *const _ as usize },
//         32usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Array_Sub_),
//             "::",
//             stringify!(err_num)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Array_Sub_>())).err_pos as *const _ as usize },
//         36usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Array_Sub_),
//             "::",
//             stringify!(err_pos)
//         )
//     );
// }
impl Default for a_Array_Sub_ {
    fn default() -> Self {
        unsafe { zeroed() }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct a_Arg_List_ {
    pub type_decl: self::root::a_Type_Decl,
    pub var_decl: self::root::a_Var_Decl,
    pub type_: self::root::t_CKTYPE,
    pub next: self::root::a_Arg_List,
    pub linepos: c_int,
    pub self_: self::root::a_Exp,
}
// #[test]
// fn bindgen_test_layout_a_Arg_List_() {
//     assert_eq!(
//         size_of::<a_Arg_List_>(),
//         48usize,
//         concat!("Size of: ", stringify!(a_Arg_List_))
//     );
//     assert_eq!(
//         align_of::<a_Arg_List_>(),
//         8usize,
//         concat!("Alignment of ", stringify!(a_Arg_List_))
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Arg_List_>())).type_decl as *const _ as usize },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Arg_List_),
//             "::",
//             stringify!(type_decl)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Arg_List_>())).var_decl as *const _ as usize },
//         8usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Arg_List_),
//             "::",
//             stringify!(var_decl)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Arg_List_>())).type_ as *const _ as usize },
//         16usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Arg_List_),
//             "::",
//             stringify!(type_)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Arg_List_>())).next as *const _ as usize },
//         24usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Arg_List_),
//             "::",
//             stringify!(next)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Arg_List_>())).linepos as *const _ as usize },
//         32usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Arg_List_),
//             "::",
//             stringify!(linepos)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Arg_List_>())).self_ as *const _ as usize },
//         40usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Arg_List_),
//             "::",
//             stringify!(self_)
//         )
//     );
// }
impl Default for a_Arg_List_ {
    fn default() -> Self {
        unsafe { zeroed() }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct a_Complex_ {
    pub re: self::root::a_Exp,
    pub im: self::root::a_Exp,
    pub linepos: c_int,
    pub self_: self::root::a_Exp,
}
// #[test]
// fn bindgen_test_layout_a_Complex_() {
//     assert_eq!(
//         size_of::<a_Complex_>(),
//         32usize,
//         concat!("Size of: ", stringify!(a_Complex_))
//     );
//     assert_eq!(
//         align_of::<a_Complex_>(),
//         8usize,
//         concat!("Alignment of ", stringify!(a_Complex_))
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Complex_>())).re as *const _ as usize },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Complex_),
//             "::",
//             stringify!(re)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Complex_>())).im as *const _ as usize },
//         8usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Complex_),
//             "::",
//             stringify!(im)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Complex_>())).linepos as *const _ as usize },
//         16usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Complex_),
//             "::",
//             stringify!(linepos)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Complex_>())).self_ as *const _ as usize },
//         24usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Complex_),
//             "::",
//             stringify!(self_)
//         )
//     );
// }
impl Default for a_Complex_ {
    fn default() -> Self {
        unsafe { zeroed() }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct a_Polar_ {
    pub mod_: self::root::a_Exp,
    pub phase: self::root::a_Exp,
    pub linepos: c_int,
    pub self_: self::root::a_Exp,
}
// #[test]
// fn bindgen_test_layout_a_Polar_() {
//     assert_eq!(
//         size_of::<a_Polar_>(),
//         32usize,
//         concat!("Size of: ", stringify!(a_Polar_))
//     );
//     assert_eq!(
//         align_of::<a_Polar_>(),
//         8usize,
//         concat!("Alignment of ", stringify!(a_Polar_))
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Polar_>())).mod_ as *const _ as usize },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Polar_),
//             "::",
//             stringify!(mod_)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Polar_>())).phase as *const _ as usize },
//         8usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Polar_),
//             "::",
//             stringify!(phase)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Polar_>())).linepos as *const _ as usize },
//         16usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Polar_),
//             "::",
//             stringify!(linepos)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Polar_>())).self_ as *const _ as usize },
//         24usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Polar_),
//             "::",
//             stringify!(self_)
//         )
//     );
// }
impl Default for a_Polar_ {
    fn default() -> Self {
        unsafe { zeroed() }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct a_Vec_ {
    pub args: self::root::a_Exp,
    pub numdims: c_int,
    pub linepos: c_int,
    pub self_: self::root::a_Exp,
}
// #[test]
// fn bindgen_test_layout_a_Vec_() {
//     assert_eq!(
//         size_of::<a_Vec_>(),
//         24usize,
//         concat!("Size of: ", stringify!(a_Vec_))
//     );
//     assert_eq!(
//         align_of::<a_Vec_>(),
//         8usize,
//         concat!("Alignment of ", stringify!(a_Vec_))
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Vec_>())).args as *const _ as usize },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Vec_),
//             "::",
//             stringify!(args)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Vec_>())).numdims as *const _ as usize },
//         8usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Vec_),
//             "::",
//             stringify!(numdims)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Vec_>())).linepos as *const _ as usize },
//         12usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Vec_),
//             "::",
//             stringify!(linepos)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Vec_>())).self_ as *const _ as usize },
//         16usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Vec_),
//             "::",
//             stringify!(self_)
//         )
//     );
// }
impl Default for a_Vec_ {
    fn default() -> Self {
        unsafe { zeroed() }
    }
}
pub const ae_Exp_Primary_Type_ae_primary_var: self::root::ae_Exp_Primary_Type = 0;
pub const ae_Exp_Primary_Type_ae_primary_num: self::root::ae_Exp_Primary_Type = 1;
pub const ae_Exp_Primary_Type_ae_primary_float: self::root::ae_Exp_Primary_Type = 2;
pub const ae_Exp_Primary_Type_ae_primary_str: self::root::ae_Exp_Primary_Type = 3;
pub const ae_Exp_Primary_Type_ae_primary_array: self::root::ae_Exp_Primary_Type = 4;
pub const ae_Exp_Primary_Type_ae_primary_exp: self::root::ae_Exp_Primary_Type = 5;
pub const ae_Exp_Primary_Type_ae_primary_hack: self::root::ae_Exp_Primary_Type = 6;
pub const ae_Exp_Primary_Type_ae_primary_complex: self::root::ae_Exp_Primary_Type = 7;
pub const ae_Exp_Primary_Type_ae_primary_polar: self::root::ae_Exp_Primary_Type = 8;
pub const ae_Exp_Primary_Type_ae_primary_vec: self::root::ae_Exp_Primary_Type = 9;
pub const ae_Exp_Primary_Type_ae_primary_char: self::root::ae_Exp_Primary_Type = 10;
pub const ae_Exp_Primary_Type_ae_primary_nil: self::root::ae_Exp_Primary_Type = 11;
pub type ae_Exp_Primary_Type = u32;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct a_Exp_Primary_ {
    pub s_type: self::root::ae_Exp_Primary_Type,
    pub value: self::root::t_CKVALUE,
    pub __bindgen_anon_1: self::root::a_Exp_Primary___bindgen_ty_1,
    pub linepos: c_int,
    pub self_: self::root::a_Exp,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union a_Exp_Primary___bindgen_ty_1 {
    pub var: self::root::S_Symbol,
    pub num: c_long,
    pub fnum: f64,
    pub str: self::root::c_str,
    pub chr: self::root::c_str,
    pub array: self::root::a_Array_Sub,
    pub exp: self::root::a_Exp,
    pub complex: self::root::a_Complex,
    pub polar: self::root::a_Polar,
    pub vec: self::root::a_Vec,
    _bindgen_union_align: u64,
}
// #[test]
// fn bindgen_test_layout_a_Exp_Primary___bindgen_ty_1() {
//     assert_eq!(
//         size_of::<a_Exp_Primary___bindgen_ty_1>(),
//         8usize,
//         concat!("Size of: ", stringify!(a_Exp_Primary___bindgen_ty_1))
//     );
//     assert_eq!(
//         align_of::<a_Exp_Primary___bindgen_ty_1>(),
//         8usize,
//         concat!("Alignment of ", stringify!(a_Exp_Primary___bindgen_ty_1))
//     );
//     assert_eq!(
//         unsafe {
//             &(*(::std::ptr::null::<a_Exp_Primary___bindgen_ty_1>())).var as *const _ as usize
//         },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp_Primary___bindgen_ty_1),
//             "::",
//             stringify!(var)
//         )
//     );
//     assert_eq!(
//         unsafe {
//             &(*(::std::ptr::null::<a_Exp_Primary___bindgen_ty_1>())).num as *const _ as usize
//         },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp_Primary___bindgen_ty_1),
//             "::",
//             stringify!(num)
//         )
//     );
//     assert_eq!(
//         unsafe {
//             &(*(::std::ptr::null::<a_Exp_Primary___bindgen_ty_1>())).fnum as *const _ as usize
//         },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp_Primary___bindgen_ty_1),
//             "::",
//             stringify!(fnum)
//         )
//     );
//     assert_eq!(
//         unsafe {
//             &(*(::std::ptr::null::<a_Exp_Primary___bindgen_ty_1>())).str as *const _ as usize
//         },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp_Primary___bindgen_ty_1),
//             "::",
//             stringify!(str)
//         )
//     );
//     assert_eq!(
//         unsafe {
//             &(*(::std::ptr::null::<a_Exp_Primary___bindgen_ty_1>())).chr as *const _ as usize
//         },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp_Primary___bindgen_ty_1),
//             "::",
//             stringify!(chr)
//         )
//     );
//     assert_eq!(
//         unsafe {
//             &(*(::std::ptr::null::<a_Exp_Primary___bindgen_ty_1>())).array as *const _ as usize
//         },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp_Primary___bindgen_ty_1),
//             "::",
//             stringify!(array)
//         )
//     );
//     assert_eq!(
//         unsafe {
//             &(*(::std::ptr::null::<a_Exp_Primary___bindgen_ty_1>())).exp as *const _ as usize
//         },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp_Primary___bindgen_ty_1),
//             "::",
//             stringify!(exp)
//         )
//     );
//     assert_eq!(
//         unsafe {
//             &(*(::std::ptr::null::<a_Exp_Primary___bindgen_ty_1>())).complex as *const _
//                 as usize
//         },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp_Primary___bindgen_ty_1),
//             "::",
//             stringify!(complex)
//         )
//     );
//     assert_eq!(
//         unsafe {
//             &(*(::std::ptr::null::<a_Exp_Primary___bindgen_ty_1>())).polar as *const _ as usize
//         },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp_Primary___bindgen_ty_1),
//             "::",
//             stringify!(polar)
//         )
//     );
//     assert_eq!(
//         unsafe {
//             &(*(::std::ptr::null::<a_Exp_Primary___bindgen_ty_1>())).vec as *const _ as usize
//         },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp_Primary___bindgen_ty_1),
//             "::",
//             stringify!(vec)
//         )
//     );
// }
impl Default for a_Exp_Primary___bindgen_ty_1 {
    fn default() -> Self {
        unsafe { zeroed() }
    }
}
impl ::std::fmt::Debug for a_Exp_Primary___bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "a_Exp_Primary___bindgen_ty_1 {{ union }}")
    }
}
// #[test]
// fn bindgen_test_layout_a_Exp_Primary_() {
//     assert_eq!(
//         size_of::<a_Exp_Primary_>(),
//         40usize,
//         concat!("Size of: ", stringify!(a_Exp_Primary_))
//     );
//     assert_eq!(
//         align_of::<a_Exp_Primary_>(),
//         8usize,
//         concat!("Alignment of ", stringify!(a_Exp_Primary_))
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Exp_Primary_>())).s_type as *const _ as usize },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp_Primary_),
//             "::",
//             stringify!(s_type)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Exp_Primary_>())).value as *const _ as usize },
//         8usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp_Primary_),
//             "::",
//             stringify!(value)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Exp_Primary_>())).linepos as *const _ as usize },
//         24usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp_Primary_),
//             "::",
//             stringify!(linepos)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Exp_Primary_>())).self_ as *const _ as usize },
//         32usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp_Primary_),
//             "::",
//             stringify!(self_)
//         )
//     );
// }
impl Default for a_Exp_Primary_ {
    fn default() -> Self {
        unsafe { zeroed() }
    }
}
impl ::std::fmt::Debug for a_Exp_Primary_ {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write ! ( f , "a_Exp_Primary_ {{ s_type: {:?}, value: {:?}, __bindgen_anon_1: {:?}, linepos: {:?}, self: {:?} }}" , self . s_type , self . value , self . __bindgen_anon_1 , self . linepos , self . self_ )
    }
}
pub const ae_Exp_Type_ae_exp_binary: self::root::ae_Exp_Type = 0;
pub const ae_Exp_Type_ae_exp_unary: self::root::ae_Exp_Type = 1;
pub const ae_Exp_Type_ae_exp_cast: self::root::ae_Exp_Type = 2;
pub const ae_Exp_Type_ae_exp_postfix: self::root::ae_Exp_Type = 3;
pub const ae_Exp_Type_ae_exp_dur: self::root::ae_Exp_Type = 4;
pub const ae_Exp_Type_ae_exp_primary: self::root::ae_Exp_Type = 5;
pub const ae_Exp_Type_ae_exp_array: self::root::ae_Exp_Type = 6;
pub const ae_Exp_Type_ae_exp_func_call: self::root::ae_Exp_Type = 7;
pub const ae_Exp_Type_ae_exp_dot_member: self::root::ae_Exp_Type = 8;
pub const ae_Exp_Type_ae_exp_if: self::root::ae_Exp_Type = 9;
pub const ae_Exp_Type_ae_exp_decl: self::root::ae_Exp_Type = 10;
pub type ae_Exp_Type = u32;
pub const ae_Exp_Meta_ae_meta_value: self::root::ae_Exp_Meta = 0;
pub const ae_Exp_Meta_ae_meta_var: self::root::ae_Exp_Meta = 1;
pub type ae_Exp_Meta = u32;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct a_Exp_ {
    pub s_type: self::root::ae_Exp_Type,
    pub s_meta: self::root::ae_Exp_Meta,
    pub type_: self::root::t_CKTYPE,
    pub owner: self::root::t_CKNSPC,
    pub next: self::root::a_Exp,
    pub group_size: c_ulong,
    pub cast_to: self::root::t_CKTYPE,
    pub emit_var: c_ulong,
    pub __bindgen_anon_1: self::root::a_Exp___bindgen_ty_1,
    pub linepos: c_int,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union a_Exp___bindgen_ty_1 {
    pub binary: self::root::a_Exp_Binary_,
    pub unary: self::root::a_Exp_Unary_,
    pub cast: self::root::a_Exp_Cast_,
    pub postfix: self::root::a_Exp_Postfix_,
    pub dur: self::root::a_Exp_Dur_,
    pub primary: self::root::a_Exp_Primary_,
    pub array: self::root::a_Exp_Array_,
    pub func_call: self::root::a_Exp_Func_Call_,
    pub dot_member: self::root::a_Exp_Dot_Member_,
    pub exp_if: self::root::a_Exp_If_,
    pub decl: self::root::a_Exp_Decl_,
    _bindgen_union_align: [u64; 7usize],
}
// #[test]
// fn bindgen_test_layout_a_Exp___bindgen_ty_1() {
//     assert_eq!(
//         size_of::<a_Exp___bindgen_ty_1>(),
//         56usize,
//         concat!("Size of: ", stringify!(a_Exp___bindgen_ty_1))
//     );
//     assert_eq!(
//         align_of::<a_Exp___bindgen_ty_1>(),
//         8usize,
//         concat!("Alignment of ", stringify!(a_Exp___bindgen_ty_1))
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Exp___bindgen_ty_1>())).binary as *const _ as usize },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp___bindgen_ty_1),
//             "::",
//             stringify!(binary)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Exp___bindgen_ty_1>())).unary as *const _ as usize },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp___bindgen_ty_1),
//             "::",
//             stringify!(unary)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Exp___bindgen_ty_1>())).cast as *const _ as usize },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp___bindgen_ty_1),
//             "::",
//             stringify!(cast)
//         )
//     );
//     assert_eq!(
//         unsafe {
//             &(*(::std::ptr::null::<a_Exp___bindgen_ty_1>())).postfix as *const _ as usize
//         },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp___bindgen_ty_1),
//             "::",
//             stringify!(postfix)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Exp___bindgen_ty_1>())).dur as *const _ as usize },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp___bindgen_ty_1),
//             "::",
//             stringify!(dur)
//         )
//     );
//     assert_eq!(
//         unsafe {
//             &(*(::std::ptr::null::<a_Exp___bindgen_ty_1>())).primary as *const _ as usize
//         },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp___bindgen_ty_1),
//             "::",
//             stringify!(primary)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Exp___bindgen_ty_1>())).array as *const _ as usize },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp___bindgen_ty_1),
//             "::",
//             stringify!(array)
//         )
//     );
//     assert_eq!(
//         unsafe {
//             &(*(::std::ptr::null::<a_Exp___bindgen_ty_1>())).func_call as *const _ as usize
//         },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp___bindgen_ty_1),
//             "::",
//             stringify!(func_call)
//         )
//     );
//     assert_eq!(
//         unsafe {
//             &(*(::std::ptr::null::<a_Exp___bindgen_ty_1>())).dot_member as *const _ as usize
//         },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp___bindgen_ty_1),
//             "::",
//             stringify!(dot_member)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Exp___bindgen_ty_1>())).exp_if as *const _ as usize },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp___bindgen_ty_1),
//             "::",
//             stringify!(exp_if)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Exp___bindgen_ty_1>())).decl as *const _ as usize },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp___bindgen_ty_1),
//             "::",
//             stringify!(decl)
//         )
//     );
// }
impl Default for a_Exp___bindgen_ty_1 {
    fn default() -> Self {
        unsafe { zeroed() }
    }
}
impl ::std::fmt::Debug for a_Exp___bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "a_Exp___bindgen_ty_1 {{ union }}")
    }
}
// #[test]
// fn bindgen_test_layout_a_Exp_() {
//     assert_eq!(
//         size_of::<a_Exp_>(),
//         120usize,
//         concat!("Size of: ", stringify!(a_Exp_))
//     );
//     assert_eq!(
//         align_of::<a_Exp_>(),
//         8usize,
//         concat!("Alignment of ", stringify!(a_Exp_))
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Exp_>())).s_type as *const _ as usize },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp_),
//             "::",
//             stringify!(s_type)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Exp_>())).s_meta as *const _ as usize },
//         4usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp_),
//             "::",
//             stringify!(s_meta)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Exp_>())).type_ as *const _ as usize },
//         8usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp_),
//             "::",
//             stringify!(type_)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Exp_>())).owner as *const _ as usize },
//         16usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp_),
//             "::",
//             stringify!(owner)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Exp_>())).next as *const _ as usize },
//         24usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp_),
//             "::",
//             stringify!(next)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Exp_>())).group_size as *const _ as usize },
//         32usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp_),
//             "::",
//             stringify!(group_size)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Exp_>())).cast_to as *const _ as usize },
//         40usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp_),
//             "::",
//             stringify!(cast_to)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Exp_>())).emit_var as *const _ as usize },
//         48usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp_),
//             "::",
//             stringify!(emit_var)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Exp_>())).linepos as *const _ as usize },
//         112usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Exp_),
//             "::",
//             stringify!(linepos)
//         )
//     );
// }
impl Default for a_Exp_ {
    fn default() -> Self {
        unsafe { zeroed() }
    }
}
impl ::std::fmt::Debug for a_Exp_ {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write ! ( f , "a_Exp_ {{ s_type: {:?}, s_meta: {:?}, type: {:?}, owner: {:?}, next: {:?}, group_size: {:?}, cast_to: {:?}, emit_var: {:?}, __bindgen_anon_1: {:?}, linepos: {:?} }}" , self . s_type , self . s_meta , self . type_ , self . owner , self . next , self . group_size , self . cast_to , self . emit_var , self . __bindgen_anon_1 , self . linepos )
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct a_Stmt_While_ {
    pub is_do: c_int,
    pub cond: self::root::a_Exp,
    pub body: self::root::a_Stmt,
    pub linepos: c_int,
    pub self_: self::root::a_Stmt,
}
// #[test]
// fn bindgen_test_layout_a_Stmt_While_() {
//     assert_eq!(
//         size_of::<a_Stmt_While_>(),
//         40usize,
//         concat!("Size of: ", stringify!(a_Stmt_While_))
//     );
//     assert_eq!(
//         align_of::<a_Stmt_While_>(),
//         8usize,
//         concat!("Alignment of ", stringify!(a_Stmt_While_))
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Stmt_While_>())).is_do as *const _ as usize },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Stmt_While_),
//             "::",
//             stringify!(is_do)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Stmt_While_>())).cond as *const _ as usize },
//         8usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Stmt_While_),
//             "::",
//             stringify!(cond)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Stmt_While_>())).body as *const _ as usize },
//         16usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Stmt_While_),
//             "::",
//             stringify!(body)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Stmt_While_>())).linepos as *const _ as usize },
//         24usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Stmt_While_),
//             "::",
//             stringify!(linepos)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Stmt_While_>())).self_ as *const _ as usize },
//         32usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Stmt_While_),
//             "::",
//             stringify!(self_)
//         )
//     );
// }
impl Default for a_Stmt_While_ {
    fn default() -> Self {
        unsafe { zeroed() }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct a_Stmt_Until_ {
    pub is_do: c_int,
    pub cond: self::root::a_Exp,
    pub body: self::root::a_Stmt,
    pub linepos: c_int,
    pub self_: self::root::a_Stmt,
}
// #[test]
// fn bindgen_test_layout_a_Stmt_Until_() {
//     assert_eq!(
//         size_of::<a_Stmt_Until_>(),
//         40usize,
//         concat!("Size of: ", stringify!(a_Stmt_Until_))
//     );
//     assert_eq!(
//         align_of::<a_Stmt_Until_>(),
//         8usize,
//         concat!("Alignment of ", stringify!(a_Stmt_Until_))
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Stmt_Until_>())).is_do as *const _ as usize },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Stmt_Until_),
//             "::",
//             stringify!(is_do)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Stmt_Until_>())).cond as *const _ as usize },
//         8usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Stmt_Until_),
//             "::",
//             stringify!(cond)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Stmt_Until_>())).body as *const _ as usize },
//         16usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Stmt_Until_),
//             "::",
//             stringify!(body)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Stmt_Until_>())).linepos as *const _ as usize },
//         24usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Stmt_Until_),
//             "::",
//             stringify!(linepos)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Stmt_Until_>())).self_ as *const _ as usize },
//         32usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Stmt_Until_),
//             "::",
//             stringify!(self_)
//         )
//     );
// }
impl Default for a_Stmt_Until_ {
    fn default() -> Self {
        unsafe { zeroed() }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct a_Stmt_For_ {
    pub c1: self::root::a_Stmt,
    pub c2: self::root::a_Stmt,
    pub c3: self::root::a_Exp,
    pub body: self::root::a_Stmt,
    pub linepos: c_int,
    pub self_: self::root::a_Stmt,
}
// #[test]
// fn bindgen_test_layout_a_Stmt_For_() {
//     assert_eq!(
//         size_of::<a_Stmt_For_>(),
//         48usize,
//         concat!("Size of: ", stringify!(a_Stmt_For_))
//     );
//     assert_eq!(
//         align_of::<a_Stmt_For_>(),
//         8usize,
//         concat!("Alignment of ", stringify!(a_Stmt_For_))
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Stmt_For_>())).c1 as *const _ as usize },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Stmt_For_),
//             "::",
//             stringify!(c1)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Stmt_For_>())).c2 as *const _ as usize },
//         8usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Stmt_For_),
//             "::",
//             stringify!(c2)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Stmt_For_>())).c3 as *const _ as usize },
//         16usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Stmt_For_),
//             "::",
//             stringify!(c3)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Stmt_For_>())).body as *const _ as usize },
//         24usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Stmt_For_),
//             "::",
//             stringify!(body)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Stmt_For_>())).linepos as *const _ as usize },
//         32usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Stmt_For_),
//             "::",
//             stringify!(linepos)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Stmt_For_>())).self_ as *const _ as usize },
//         40usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Stmt_For_),
//             "::",
//             stringify!(self_)
//         )
//     );
// }
impl Default for a_Stmt_For_ {
    fn default() -> Self {
        unsafe { zeroed() }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct a_Stmt_Loop_ {
    pub cond: self::root::a_Exp,
    pub body: self::root::a_Stmt,
    pub linepos: c_int,
    pub self_: self::root::a_Stmt,
}
// #[test]
// fn bindgen_test_layout_a_Stmt_Loop_() {
//     assert_eq!(
//         size_of::<a_Stmt_Loop_>(),
//         32usize,
//         concat!("Size of: ", stringify!(a_Stmt_Loop_))
//     );
//     assert_eq!(
//         align_of::<a_Stmt_Loop_>(),
//         8usize,
//         concat!("Alignment of ", stringify!(a_Stmt_Loop_))
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Stmt_Loop_>())).cond as *const _ as usize },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Stmt_Loop_),
//             "::",
//             stringify!(cond)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Stmt_Loop_>())).body as *const _ as usize },
//         8usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Stmt_Loop_),
//             "::",
//             stringify!(body)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Stmt_Loop_>())).linepos as *const _ as usize },
//         16usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Stmt_Loop_),
//             "::",
//             stringify!(linepos)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Stmt_Loop_>())).self_ as *const _ as usize },
//         24usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Stmt_Loop_),
//             "::",
//             stringify!(self_)
//         )
//     );
// }
impl Default for a_Stmt_Loop_ {
    fn default() -> Self {
        unsafe { zeroed() }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct a_Stmt_Code_ {
    pub stmt_list: self::root::a_Stmt_List,
    pub linepos: c_int,
    pub self_: self::root::a_Stmt,
}
// #[test]
// fn bindgen_test_layout_a_Stmt_Code_() {
//     assert_eq!(
//         size_of::<a_Stmt_Code_>(),
//         24usize,
//         concat!("Size of: ", stringify!(a_Stmt_Code_))
//     );
//     assert_eq!(
//         align_of::<a_Stmt_Code_>(),
//         8usize,
//         concat!("Alignment of ", stringify!(a_Stmt_Code_))
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Stmt_Code_>())).stmt_list as *const _ as usize },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Stmt_Code_),
//             "::",
//             stringify!(stmt_list)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Stmt_Code_>())).linepos as *const _ as usize },
//         8usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Stmt_Code_),
//             "::",
//             stringify!(linepos)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Stmt_Code_>())).self_ as *const _ as usize },
//         16usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Stmt_Code_),
//             "::",
//             stringify!(self_)
//         )
//     );
// }
impl Default for a_Stmt_Code_ {
    fn default() -> Self {
        unsafe { zeroed() }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct a_Stmt_If_ {
    pub cond: self::root::a_Exp,
    pub if_body: self::root::a_Stmt,
    pub else_body: self::root::a_Stmt,
    pub linepos: c_int,
    pub self_: self::root::a_Stmt,
}
// #[test]
// fn bindgen_test_layout_a_Stmt_If_() {
//     assert_eq!(
//         size_of::<a_Stmt_If_>(),
//         40usize,
//         concat!("Size of: ", stringify!(a_Stmt_If_))
//     );
//     assert_eq!(
//         align_of::<a_Stmt_If_>(),
//         8usize,
//         concat!("Alignment of ", stringify!(a_Stmt_If_))
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Stmt_If_>())).cond as *const _ as usize },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Stmt_If_),
//             "::",
//             stringify!(cond)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Stmt_If_>())).if_body as *const _ as usize },
//         8usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Stmt_If_),
//             "::",
//             stringify!(if_body)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Stmt_If_>())).else_body as *const _ as usize },
//         16usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Stmt_If_),
//             "::",
//             stringify!(else_body)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Stmt_If_>())).linepos as *const _ as usize },
//         24usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Stmt_If_),
//             "::",
//             stringify!(linepos)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Stmt_If_>())).self_ as *const _ as usize },
//         32usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Stmt_If_),
//             "::",
//             stringify!(self_)
//         )
//     );
// }
impl Default for a_Stmt_If_ {
    fn default() -> Self {
        unsafe { zeroed() }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct a_Stmt_Switch_ {
    pub val: self::root::a_Exp,
    pub linepos: c_int,
    pub self_: self::root::a_Stmt,
}
// #[test]
// fn bindgen_test_layout_a_Stmt_Switch_() {
//     assert_eq!(
//         size_of::<a_Stmt_Switch_>(),
//         24usize,
//         concat!("Size of: ", stringify!(a_Stmt_Switch_))
//     );
//     assert_eq!(
//         align_of::<a_Stmt_Switch_>(),
//         8usize,
//         concat!("Alignment of ", stringify!(a_Stmt_Switch_))
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Stmt_Switch_>())).val as *const _ as usize },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Stmt_Switch_),
//             "::",
//             stringify!(val)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Stmt_Switch_>())).linepos as *const _ as usize },
//         8usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Stmt_Switch_),
//             "::",
//             stringify!(linepos)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Stmt_Switch_>())).self_ as *const _ as usize },
//         16usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Stmt_Switch_),
//             "::",
//             stringify!(self_)
//         )
//     );
// }
impl Default for a_Stmt_Switch_ {
    fn default() -> Self {
        unsafe { zeroed() }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct a_Stmt_Break_ {
    pub linepos: c_int,
    pub self_: self::root::a_Stmt,
}
// #[test]
// fn bindgen_test_layout_a_Stmt_Break_() {
//     assert_eq!(
//         size_of::<a_Stmt_Break_>(),
//         16usize,
//         concat!("Size of: ", stringify!(a_Stmt_Break_))
//     );
//     assert_eq!(
//         align_of::<a_Stmt_Break_>(),
//         8usize,
//         concat!("Alignment of ", stringify!(a_Stmt_Break_))
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Stmt_Break_>())).linepos as *const _ as usize },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Stmt_Break_),
//             "::",
//             stringify!(linepos)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Stmt_Break_>())).self_ as *const _ as usize },
//         8usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Stmt_Break_),
//             "::",
//             stringify!(self_)
//         )
//     );
// }
impl Default for a_Stmt_Break_ {
    fn default() -> Self {
        unsafe { zeroed() }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct a_Stmt_Continue_ {
    pub linepos: c_int,
    pub self_: self::root::a_Stmt,
}
// #[test]
// fn bindgen_test_layout_a_Stmt_Continue_() {
//     assert_eq!(
//         size_of::<a_Stmt_Continue_>(),
//         16usize,
//         concat!("Size of: ", stringify!(a_Stmt_Continue_))
//     );
//     assert_eq!(
//         align_of::<a_Stmt_Continue_>(),
//         8usize,
//         concat!("Alignment of ", stringify!(a_Stmt_Continue_))
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Stmt_Continue_>())).linepos as *const _ as usize },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Stmt_Continue_),
//             "::",
//             stringify!(linepos)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Stmt_Continue_>())).self_ as *const _ as usize },
//         8usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Stmt_Continue_),
//             "::",
//             stringify!(self_)
//         )
//     );
// }
impl Default for a_Stmt_Continue_ {
    fn default() -> Self {
        unsafe { zeroed() }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct a_Stmt_Return_ {
    pub val: self::root::a_Exp,
    pub linepos: c_int,
    pub self_: self::root::a_Stmt,
}
// #[test]
// fn bindgen_test_layout_a_Stmt_Return_() {
//     assert_eq!(
//         size_of::<a_Stmt_Return_>(),
//         24usize,
//         concat!("Size of: ", stringify!(a_Stmt_Return_))
//     );
//     assert_eq!(
//         align_of::<a_Stmt_Return_>(),
//         8usize,
//         concat!("Alignment of ", stringify!(a_Stmt_Return_))
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Stmt_Return_>())).val as *const _ as usize },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Stmt_Return_),
//             "::",
//             stringify!(val)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Stmt_Return_>())).linepos as *const _ as usize },
//         8usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Stmt_Return_),
//             "::",
//             stringify!(linepos)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Stmt_Return_>())).self_ as *const _ as usize },
//         16usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Stmt_Return_),
//             "::",
//             stringify!(self_)
//         )
//     );
// }
impl Default for a_Stmt_Return_ {
    fn default() -> Self {
        unsafe { zeroed() }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct a_Stmt_Case_ {
    pub exp: self::root::a_Exp,
    pub linepos: c_int,
    pub self_: self::root::a_Stmt,
}
// #[test]
// fn bindgen_test_layout_a_Stmt_Case_() {
//     assert_eq!(
//         size_of::<a_Stmt_Case_>(),
//         24usize,
//         concat!("Size of: ", stringify!(a_Stmt_Case_))
//     );
//     assert_eq!(
//         align_of::<a_Stmt_Case_>(),
//         8usize,
//         concat!("Alignment of ", stringify!(a_Stmt_Case_))
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Stmt_Case_>())).exp as *const _ as usize },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Stmt_Case_),
//             "::",
//             stringify!(exp)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Stmt_Case_>())).linepos as *const _ as usize },
//         8usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Stmt_Case_),
//             "::",
//             stringify!(linepos)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Stmt_Case_>())).self_ as *const _ as usize },
//         16usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Stmt_Case_),
//             "::",
//             stringify!(self_)
//         )
//     );
// }
impl Default for a_Stmt_Case_ {
    fn default() -> Self {
        unsafe { zeroed() }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct a_Stmt_GotoLabel_ {
    pub name: self::root::S_Symbol,
    pub linepos: c_int,
    pub self_: self::root::a_Stmt,
}
// #[test]
// fn bindgen_test_layout_a_Stmt_GotoLabel_() {
//     assert_eq!(
//         size_of::<a_Stmt_GotoLabel_>(),
//         24usize,
//         concat!("Size of: ", stringify!(a_Stmt_GotoLabel_))
//     );
//     assert_eq!(
//         align_of::<a_Stmt_GotoLabel_>(),
//         8usize,
//         concat!("Alignment of ", stringify!(a_Stmt_GotoLabel_))
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Stmt_GotoLabel_>())).name as *const _ as usize },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Stmt_GotoLabel_),
//             "::",
//             stringify!(name)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Stmt_GotoLabel_>())).linepos as *const _ as usize },
//         8usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Stmt_GotoLabel_),
//             "::",
//             stringify!(linepos)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Stmt_GotoLabel_>())).self_ as *const _ as usize },
//         16usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Stmt_GotoLabel_),
//             "::",
//             stringify!(self_)
//         )
//     );
// }
impl Default for a_Stmt_GotoLabel_ {
    fn default() -> Self {
        unsafe { zeroed() }
    }
}
pub const ae_Stmt_Type_ae_stmt_exp: self::root::ae_Stmt_Type = 0;
pub const ae_Stmt_Type_ae_stmt_while: self::root::ae_Stmt_Type = 1;
pub const ae_Stmt_Type_ae_stmt_until: self::root::ae_Stmt_Type = 2;
pub const ae_Stmt_Type_ae_stmt_for: self::root::ae_Stmt_Type = 3;
pub const ae_Stmt_Type_ae_stmt_loop: self::root::ae_Stmt_Type = 4;
pub const ae_Stmt_Type_ae_stmt_if: self::root::ae_Stmt_Type = 5;
pub const ae_Stmt_Type_ae_stmt_code: self::root::ae_Stmt_Type = 6;
pub const ae_Stmt_Type_ae_stmt_switch: self::root::ae_Stmt_Type = 7;
pub const ae_Stmt_Type_ae_stmt_break: self::root::ae_Stmt_Type = 8;
pub const ae_Stmt_Type_ae_stmt_continue: self::root::ae_Stmt_Type = 9;
pub const ae_Stmt_Type_ae_stmt_return: self::root::ae_Stmt_Type = 10;
pub const ae_Stmt_Type_ae_stmt_case: self::root::ae_Stmt_Type = 11;
pub const ae_Stmt_Type_ae_stmt_gotolabel: self::root::ae_Stmt_Type = 12;
pub type ae_Stmt_Type = u32;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct a_Stmt_ {
    pub s_type: self::root::ae_Stmt_Type,
    pub skip: c_int,
    pub __bindgen_anon_1: self::root::a_Stmt___bindgen_ty_1,
    pub linepos: c_int,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union a_Stmt___bindgen_ty_1 {
    pub stmt_exp: self::root::a_Exp,
    pub stmt_code: self::root::a_Stmt_Code_,
    pub stmt_while: self::root::a_Stmt_While_,
    pub stmt_until: self::root::a_Stmt_Until_,
    pub stmt_loop: self::root::a_Stmt_Loop_,
    pub stmt_for: self::root::a_Stmt_For_,
    pub stmt_if: self::root::a_Stmt_If_,
    pub stmt_switch: self::root::a_Stmt_Switch_,
    pub stmt_break: self::root::a_Stmt_Break_,
    pub stmt_continue: self::root::a_Stmt_Continue_,
    pub stmt_return: self::root::a_Stmt_Return_,
    pub stmt_case: self::root::a_Stmt_Case_,
    pub stmt_gotolabel: self::root::a_Stmt_GotoLabel_,
    _bindgen_union_align: [u64; 6usize],
}
// #[test]
// fn bindgen_test_layout_a_Stmt___bindgen_ty_1() {
//     assert_eq!(
//         size_of::<a_Stmt___bindgen_ty_1>(),
//         48usize,
//         concat!("Size of: ", stringify!(a_Stmt___bindgen_ty_1))
//     );
//     assert_eq!(
//         align_of::<a_Stmt___bindgen_ty_1>(),
//         8usize,
//         concat!("Alignment of ", stringify!(a_Stmt___bindgen_ty_1))
//     );
//     assert_eq!(
//         unsafe {
//             &(*(::std::ptr::null::<a_Stmt___bindgen_ty_1>())).stmt_exp as *const _ as usize
//         },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Stmt___bindgen_ty_1),
//             "::",
//             stringify!(stmt_exp)
//         )
//     );
//     assert_eq!(
//         unsafe {
//             &(*(::std::ptr::null::<a_Stmt___bindgen_ty_1>())).stmt_code as *const _ as usize
//         },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Stmt___bindgen_ty_1),
//             "::",
//             stringify!(stmt_code)
//         )
//     );
//     assert_eq!(
//         unsafe {
//             &(*(::std::ptr::null::<a_Stmt___bindgen_ty_1>())).stmt_while as *const _ as usize
//         },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Stmt___bindgen_ty_1),
//             "::",
//             stringify!(stmt_while)
//         )
//     );
//     assert_eq!(
//         unsafe {
//             &(*(::std::ptr::null::<a_Stmt___bindgen_ty_1>())).stmt_until as *const _ as usize
//         },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Stmt___bindgen_ty_1),
//             "::",
//             stringify!(stmt_until)
//         )
//     );
//     assert_eq!(
//         unsafe {
//             &(*(::std::ptr::null::<a_Stmt___bindgen_ty_1>())).stmt_loop as *const _ as usize
//         },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Stmt___bindgen_ty_1),
//             "::",
//             stringify!(stmt_loop)
//         )
//     );
//     assert_eq!(
//         unsafe {
//             &(*(::std::ptr::null::<a_Stmt___bindgen_ty_1>())).stmt_for as *const _ as usize
//         },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Stmt___bindgen_ty_1),
//             "::",
//             stringify!(stmt_for)
//         )
//     );
//     assert_eq!(
//         unsafe {
//             &(*(::std::ptr::null::<a_Stmt___bindgen_ty_1>())).stmt_if as *const _ as usize
//         },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Stmt___bindgen_ty_1),
//             "::",
//             stringify!(stmt_if)
//         )
//     );
//     assert_eq!(
//         unsafe {
//             &(*(::std::ptr::null::<a_Stmt___bindgen_ty_1>())).stmt_switch as *const _ as usize
//         },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Stmt___bindgen_ty_1),
//             "::",
//             stringify!(stmt_switch)
//         )
//     );
//     assert_eq!(
//         unsafe {
//             &(*(::std::ptr::null::<a_Stmt___bindgen_ty_1>())).stmt_break as *const _ as usize
//         },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Stmt___bindgen_ty_1),
//             "::",
//             stringify!(stmt_break)
//         )
//     );
//     assert_eq!(
//         unsafe {
//             &(*(::std::ptr::null::<a_Stmt___bindgen_ty_1>())).stmt_continue as *const _ as usize
//         },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Stmt___bindgen_ty_1),
//             "::",
//             stringify!(stmt_continue)
//         )
//     );
//     assert_eq!(
//         unsafe {
//             &(*(::std::ptr::null::<a_Stmt___bindgen_ty_1>())).stmt_return as *const _ as usize
//         },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Stmt___bindgen_ty_1),
//             "::",
//             stringify!(stmt_return)
//         )
//     );
//     assert_eq!(
//         unsafe {
//             &(*(::std::ptr::null::<a_Stmt___bindgen_ty_1>())).stmt_case as *const _ as usize
//         },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Stmt___bindgen_ty_1),
//             "::",
//             stringify!(stmt_case)
//         )
//     );
//     assert_eq!(
//         unsafe {
//             &(*(::std::ptr::null::<a_Stmt___bindgen_ty_1>())).stmt_gotolabel as *const _
//                 as usize
//         },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Stmt___bindgen_ty_1),
//             "::",
//             stringify!(stmt_gotolabel)
//         )
//     );
// }
impl Default for a_Stmt___bindgen_ty_1 {
    fn default() -> Self {
        unsafe { zeroed() }
    }
}
impl ::std::fmt::Debug for a_Stmt___bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "a_Stmt___bindgen_ty_1 {{ union }}")
    }
}
// #[test]
// fn bindgen_test_layout_a_Stmt_() {
//     assert_eq!(
//         size_of::<a_Stmt_>(),
//         64usize,
//         concat!("Size of: ", stringify!(a_Stmt_))
//     );
//     assert_eq!(
//         align_of::<a_Stmt_>(),
//         8usize,
//         concat!("Alignment of ", stringify!(a_Stmt_))
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Stmt_>())).s_type as *const _ as usize },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Stmt_),
//             "::",
//             stringify!(s_type)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Stmt_>())).skip as *const _ as usize },
//         4usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Stmt_),
//             "::",
//             stringify!(skip)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Stmt_>())).linepos as *const _ as usize },
//         56usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Stmt_),
//             "::",
//             stringify!(linepos)
//         )
//     );
// }
impl Default for a_Stmt_ {
    fn default() -> Self {
        unsafe { zeroed() }
    }
}
impl ::std::fmt::Debug for a_Stmt_ {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "a_Stmt_ {{ s_type: {:?}, skip: {:?}, __bindgen_anon_1: {:?}, linepos: {:?} }}",
            self.s_type, self.skip, self.__bindgen_anon_1, self.linepos
        )
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct a_Stmt_List_ {
    pub stmt: self::root::a_Stmt,
    pub next: self::root::a_Stmt_List,
    pub linepos: c_int,
}
// #[test]
// fn bindgen_test_layout_a_Stmt_List_() {
//     assert_eq!(
//         size_of::<a_Stmt_List_>(),
//         24usize,
//         concat!("Size of: ", stringify!(a_Stmt_List_))
//     );
//     assert_eq!(
//         align_of::<a_Stmt_List_>(),
//         8usize,
//         concat!("Alignment of ", stringify!(a_Stmt_List_))
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Stmt_List_>())).stmt as *const _ as usize },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Stmt_List_),
//             "::",
//             stringify!(stmt)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Stmt_List_>())).next as *const _ as usize },
//         8usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Stmt_List_),
//             "::",
//             stringify!(next)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Stmt_List_>())).linepos as *const _ as usize },
//         16usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Stmt_List_),
//             "::",
//             stringify!(linepos)
//         )
//     );
// }
impl Default for a_Stmt_List_ {
    fn default() -> Self {
        unsafe { zeroed() }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct a_Class_Def_ {
    pub decl: self::root::ae_Keyword,
    pub name: self::root::a_Id_List,
    pub ext: self::root::a_Class_Ext,
    pub body: self::root::a_Class_Body,
    pub type_: self::root::t_CKTYPE,
    pub iface: c_int,
    pub home: self::root::t_CKNSPC,
    pub linepos: c_int,
}
// #[test]
// fn bindgen_test_layout_a_Class_Def_() {
//     assert_eq!(
//         size_of::<a_Class_Def_>(),
//         64usize,
//         concat!("Size of: ", stringify!(a_Class_Def_))
//     );
//     assert_eq!(
//         align_of::<a_Class_Def_>(),
//         8usize,
//         concat!("Alignment of ", stringify!(a_Class_Def_))
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Class_Def_>())).decl as *const _ as usize },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Class_Def_),
//             "::",
//             stringify!(decl)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Class_Def_>())).name as *const _ as usize },
//         8usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Class_Def_),
//             "::",
//             stringify!(name)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Class_Def_>())).ext as *const _ as usize },
//         16usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Class_Def_),
//             "::",
//             stringify!(ext)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Class_Def_>())).body as *const _ as usize },
//         24usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Class_Def_),
//             "::",
//             stringify!(body)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Class_Def_>())).type_ as *const _ as usize },
//         32usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Class_Def_),
//             "::",
//             stringify!(type_)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Class_Def_>())).iface as *const _ as usize },
//         40usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Class_Def_),
//             "::",
//             stringify!(iface)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Class_Def_>())).home as *const _ as usize },
//         48usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Class_Def_),
//             "::",
//             stringify!(home)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Class_Def_>())).linepos as *const _ as usize },
//         56usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Class_Def_),
//             "::",
//             stringify!(linepos)
//         )
//     );
// }
impl Default for a_Class_Def_ {
    fn default() -> Self {
        unsafe { zeroed() }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct a_Class_Ext_ {
    pub extend_id: self::root::a_Id_List,
    pub impl_list: self::root::a_Id_List,
    pub linepos: c_int,
}
// #[test]
// fn bindgen_test_layout_a_Class_Ext_() {
//     assert_eq!(
//         size_of::<a_Class_Ext_>(),
//         24usize,
//         concat!("Size of: ", stringify!(a_Class_Ext_))
//     );
//     assert_eq!(
//         align_of::<a_Class_Ext_>(),
//         8usize,
//         concat!("Alignment of ", stringify!(a_Class_Ext_))
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Class_Ext_>())).extend_id as *const _ as usize },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Class_Ext_),
//             "::",
//             stringify!(extend_id)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Class_Ext_>())).impl_list as *const _ as usize },
//         8usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Class_Ext_),
//             "::",
//             stringify!(impl_list)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Class_Ext_>())).linepos as *const _ as usize },
//         16usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Class_Ext_),
//             "::",
//             stringify!(linepos)
//         )
//     );
// }
impl Default for a_Class_Ext_ {
    fn default() -> Self {
        unsafe { zeroed() }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct a_Class_Body_ {
    pub section: self::root::a_Section,
    pub next: self::root::a_Class_Body,
    pub linepos: c_int,
}
// #[test]
// fn bindgen_test_layout_a_Class_Body_() {
//     assert_eq!(
//         size_of::<a_Class_Body_>(),
//         24usize,
//         concat!("Size of: ", stringify!(a_Class_Body_))
//     );
//     assert_eq!(
//         align_of::<a_Class_Body_>(),
//         8usize,
//         concat!("Alignment of ", stringify!(a_Class_Body_))
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Class_Body_>())).section as *const _ as usize },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Class_Body_),
//             "::",
//             stringify!(section)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Class_Body_>())).next as *const _ as usize },
//         8usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Class_Body_),
//             "::",
//             stringify!(next)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Class_Body_>())).linepos as *const _ as usize },
//         16usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Class_Body_),
//             "::",
//             stringify!(linepos)
//         )
//     );
// }
impl Default for a_Class_Body_ {
    fn default() -> Self {
        unsafe { zeroed() }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct a_Id_List_ {
    pub xid: self::root::S_Symbol,
    pub next: self::root::a_Id_List,
    pub linepos: c_int,
}
// #[test]
// fn bindgen_test_layout_a_Id_List_() {
//     assert_eq!(
//         size_of::<a_Id_List_>(),
//         24usize,
//         concat!("Size of: ", stringify!(a_Id_List_))
//     );
//     assert_eq!(
//         align_of::<a_Id_List_>(),
//         8usize,
//         concat!("Alignment of ", stringify!(a_Id_List_))
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Id_List_>())).xid as *const _ as usize },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Id_List_),
//             "::",
//             stringify!(xid)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Id_List_>())).next as *const _ as usize },
//         8usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Id_List_),
//             "::",
//             stringify!(next)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Id_List_>())).linepos as *const _ as usize },
//         16usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Id_List_),
//             "::",
//             stringify!(linepos)
//         )
//     );
// }
impl Default for a_Id_List_ {
    fn default() -> Self {
        unsafe { zeroed() }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct a_Func_Def_ {
    pub func_decl: self::root::ae_Keyword,
    pub static_decl: self::root::ae_Keyword,
    pub type_decl: self::root::a_Type_Decl,
    pub ret_type: self::root::t_CKTYPE,
    pub name: self::root::S_Symbol,
    pub arg_list: self::root::a_Arg_List,
    pub code: self::root::a_Stmt,
    pub ck_func: self::root::t_CKFUNC,
    pub global: c_uint,
    pub s_type: c_uint,
    pub stack_depth: c_uint,
    pub dl_func_ptr: *mut c_void,
    pub linepos: c_int,
}
// #[test]
// fn bindgen_test_layout_a_Func_Def_() {
//     assert_eq!(
//         size_of::<a_Func_Def_>(),
//         88usize,
//         concat!("Size of: ", stringify!(a_Func_Def_))
//     );
//     assert_eq!(
//         align_of::<a_Func_Def_>(),
//         8usize,
//         concat!("Alignment of ", stringify!(a_Func_Def_))
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Func_Def_>())).func_decl as *const _ as usize },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Func_Def_),
//             "::",
//             stringify!(func_decl)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Func_Def_>())).static_decl as *const _ as usize },
//         4usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Func_Def_),
//             "::",
//             stringify!(static_decl)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Func_Def_>())).type_decl as *const _ as usize },
//         8usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Func_Def_),
//             "::",
//             stringify!(type_decl)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Func_Def_>())).ret_type as *const _ as usize },
//         16usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Func_Def_),
//             "::",
//             stringify!(ret_type)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Func_Def_>())).name as *const _ as usize },
//         24usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Func_Def_),
//             "::",
//             stringify!(name)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Func_Def_>())).arg_list as *const _ as usize },
//         32usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Func_Def_),
//             "::",
//             stringify!(arg_list)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Func_Def_>())).code as *const _ as usize },
//         40usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Func_Def_),
//             "::",
//             stringify!(code)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Func_Def_>())).ck_func as *const _ as usize },
//         48usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Func_Def_),
//             "::",
//             stringify!(ck_func)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Func_Def_>())).global as *const _ as usize },
//         56usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Func_Def_),
//             "::",
//             stringify!(global)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Func_Def_>())).s_type as *const _ as usize },
//         60usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Func_Def_),
//             "::",
//             stringify!(s_type)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Func_Def_>())).stack_depth as *const _ as usize },
//         64usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Func_Def_),
//             "::",
//             stringify!(stack_depth)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Func_Def_>())).dl_func_ptr as *const _ as usize },
//         72usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Func_Def_),
//             "::",
//             stringify!(dl_func_ptr)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Func_Def_>())).linepos as *const _ as usize },
//         80usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Func_Def_),
//             "::",
//             stringify!(linepos)
//         )
//     );
// }
impl Default for a_Func_Def_ {
    fn default() -> Self {
        unsafe { zeroed() }
    }
}
pub const ae_Section_Type_ae_section_stmt: self::root::ae_Section_Type = 0;
pub const ae_Section_Type_ae_section_func: self::root::ae_Section_Type = 1;
pub const ae_Section_Type_ae_section_class: self::root::ae_Section_Type = 2;
pub type ae_Section_Type = u32;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct a_Section_ {
    pub s_type: self::root::ae_Section_Type,
    pub __bindgen_anon_1: self::root::a_Section___bindgen_ty_1,
    pub linepos: c_int,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union a_Section___bindgen_ty_1 {
    pub stmt_list: self::root::a_Stmt_List,
    pub class_def: self::root::a_Class_Def,
    pub func_def: self::root::a_Func_Def,
    _bindgen_union_align: u64,
}
// #[test]
// fn bindgen_test_layout_a_Section___bindgen_ty_1() {
//     assert_eq!(
//         size_of::<a_Section___bindgen_ty_1>(),
//         8usize,
//         concat!("Size of: ", stringify!(a_Section___bindgen_ty_1))
//     );
//     assert_eq!(
//         align_of::<a_Section___bindgen_ty_1>(),
//         8usize,
//         concat!("Alignment of ", stringify!(a_Section___bindgen_ty_1))
//     );
//     assert_eq!(
//         unsafe {
//             &(*(::std::ptr::null::<a_Section___bindgen_ty_1>())).stmt_list as *const _ as usize
//         },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Section___bindgen_ty_1),
//             "::",
//             stringify!(stmt_list)
//         )
//     );
//     assert_eq!(
//         unsafe {
//             &(*(::std::ptr::null::<a_Section___bindgen_ty_1>())).class_def as *const _ as usize
//         },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Section___bindgen_ty_1),
//             "::",
//             stringify!(class_def)
//         )
//     );
//     assert_eq!(
//         unsafe {
//             &(*(::std::ptr::null::<a_Section___bindgen_ty_1>())).func_def as *const _ as usize
//         },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Section___bindgen_ty_1),
//             "::",
//             stringify!(func_def)
//         )
//     );
// }
impl Default for a_Section___bindgen_ty_1 {
    fn default() -> Self {
        unsafe { zeroed() }
    }
}
impl ::std::fmt::Debug for a_Section___bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "a_Section___bindgen_ty_1 {{ union }}")
    }
}
// #[test]
// fn bindgen_test_layout_a_Section_() {
//     assert_eq!(
//         size_of::<a_Section_>(),
//         24usize,
//         concat!("Size of: ", stringify!(a_Section_))
//     );
//     assert_eq!(
//         align_of::<a_Section_>(),
//         8usize,
//         concat!("Alignment of ", stringify!(a_Section_))
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Section_>())).s_type as *const _ as usize },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Section_),
//             "::",
//             stringify!(s_type)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Section_>())).linepos as *const _ as usize },
//         16usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Section_),
//             "::",
//             stringify!(linepos)
//         )
//     );
// }
impl Default for a_Section_ {
    fn default() -> Self {
        unsafe { zeroed() }
    }
}
impl ::std::fmt::Debug for a_Section_ {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "a_Section_ {{ s_type: {:?}, __bindgen_anon_1: {:?}, linepos: {:?} }}",
            self.s_type, self.__bindgen_anon_1, self.linepos
        )
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct a_Program_ {
    pub section: self::root::a_Section,
    pub next: self::root::a_Program,
    pub linepos: c_int,
}
// #[test]
// fn bindgen_test_layout_a_Program_() {
//     assert_eq!(
//         size_of::<a_Program_>(),
//         24usize,
//         concat!("Size of: ", stringify!(a_Program_))
//     );
//     assert_eq!(
//         align_of::<a_Program_>(),
//         8usize,
//         concat!("Alignment of ", stringify!(a_Program_))
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Program_>())).section as *const _ as usize },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Program_),
//             "::",
//             stringify!(section)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Program_>())).next as *const _ as usize },
//         8usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Program_),
//             "::",
//             stringify!(next)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<a_Program_>())).linepos as *const _ as usize },
//         16usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(a_Program_),
//             "::",
//             stringify!(linepos)
//         )
//     );
// }
impl Default for a_Program_ {
    fn default() -> Self {
        unsafe { zeroed() }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __mbstate_t {
    pub __count: c_int,
    pub __value: self::root::__mbstate_t__bindgen_ty_1,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union __mbstate_t__bindgen_ty_1 {
    pub __wch: c_uint,
    pub __wchb: [c_char; 4usize],
    _bindgen_union_align: u32,
}
// #[test]
// fn bindgen_test_layout___mbstate_t__bindgen_ty_1() {
//     assert_eq!(
//         size_of::<__mbstate_t__bindgen_ty_1>(),
//         4usize,
//         concat!("Size of: ", stringify!(__mbstate_t__bindgen_ty_1))
//     );
//     assert_eq!(
//         align_of::<__mbstate_t__bindgen_ty_1>(),
//         4usize,
//         concat!("Alignment of ", stringify!(__mbstate_t__bindgen_ty_1))
//     );
//     assert_eq!(
//         unsafe {
//             &(*(::std::ptr::null::<__mbstate_t__bindgen_ty_1>())).__wch as *const _ as usize
//         },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(__mbstate_t__bindgen_ty_1),
//             "::",
//             stringify!(__wch)
//         )
//     );
//     assert_eq!(
//         unsafe {
//             &(*(::std::ptr::null::<__mbstate_t__bindgen_ty_1>())).__wchb as *const _ as usize
//         },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(__mbstate_t__bindgen_ty_1),
//             "::",
//             stringify!(__wchb)
//         )
//     );
// }
impl Default for __mbstate_t__bindgen_ty_1 {
    fn default() -> Self {
        unsafe { zeroed() }
    }
}
impl ::std::fmt::Debug for __mbstate_t__bindgen_ty_1 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "__mbstate_t__bindgen_ty_1 {{ union }}")
    }
}
// #[test]
// fn bindgen_test_layout___mbstate_t() {
//     assert_eq!(
//         size_of::<__mbstate_t>(),
//         8usize,
//         concat!("Size of: ", stringify!(__mbstate_t))
//     );
//     assert_eq!(
//         align_of::<__mbstate_t>(),
//         4usize,
//         concat!("Alignment of ", stringify!(__mbstate_t))
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<__mbstate_t>())).__count as *const _ as usize },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(__mbstate_t),
//             "::",
//             stringify!(__count)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<__mbstate_t>())).__value as *const _ as usize },
//         4usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(__mbstate_t),
//             "::",
//             stringify!(__value)
//         )
//     );
// }
impl Default for __mbstate_t {
    fn default() -> Self {
        unsafe { zeroed() }
    }
}
impl ::std::fmt::Debug for __mbstate_t {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "__mbstate_t {{ __count: {:?}, __value: {:?} }}",
            self.__count, self.__value
        )
    }
}
pub type FILE = self::root::_IO_FILE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_marker {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_codecvt {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_wide_data {
    _unused: [u8; 0],
}
pub type _IO_lock_t = c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct _IO_FILE {
    pub _flags: c_int,
    pub _IO_read_ptr: *mut c_char,
    pub _IO_read_end: *mut c_char,
    pub _IO_read_base: *mut c_char,
    pub _IO_write_base: *mut c_char,
    pub _IO_write_ptr: *mut c_char,
    pub _IO_write_end: *mut c_char,
    pub _IO_buf_base: *mut c_char,
    pub _IO_buf_end: *mut c_char,
    pub _IO_save_base: *mut c_char,
    pub _IO_backup_base: *mut c_char,
    pub _IO_save_end: *mut c_char,
    pub _markers: *mut self::root::_IO_marker,
    pub _chain: *mut self::root::_IO_FILE,
    pub _fileno: c_int,
    pub _flags2: c_int,
    pub _old_offset: self::root::__off_t,
    pub _cur_column: c_ushort,
    pub _vtable_offset: c_schar,
    pub _shortbuf: [c_char; 1usize],
    pub _lock: *mut self::root::_IO_lock_t,
    pub _offset: self::root::__off64_t,
    pub _codecvt: *mut self::root::_IO_codecvt,
    pub _wide_data: *mut self::root::_IO_wide_data,
    pub _freeres_list: *mut self::root::_IO_FILE,
    pub _freeres_buf: *mut c_void,
    pub __pad5: usize,
    pub _mode: c_int,
    pub _unused2: [c_char; 20usize],
}
// #[test]
// fn bindgen_test_layout__IO_FILE() {
//     assert_eq!(
//         size_of::<_IO_FILE>(),
//         216usize,
//         concat!("Size of: ", stringify!(_IO_FILE))
//     );
//     assert_eq!(
//         align_of::<_IO_FILE>(),
//         8usize,
//         concat!("Alignment of ", stringify!(_IO_FILE))
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._flags as *const _ as usize },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(_IO_FILE),
//             "::",
//             stringify!(_flags)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_read_ptr as *const _ as usize },
//         8usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(_IO_FILE),
//             "::",
//             stringify!(_IO_read_ptr)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_read_end as *const _ as usize },
//         16usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(_IO_FILE),
//             "::",
//             stringify!(_IO_read_end)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_read_base as *const _ as usize },
//         24usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(_IO_FILE),
//             "::",
//             stringify!(_IO_read_base)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_write_base as *const _ as usize },
//         32usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(_IO_FILE),
//             "::",
//             stringify!(_IO_write_base)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_write_ptr as *const _ as usize },
//         40usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(_IO_FILE),
//             "::",
//             stringify!(_IO_write_ptr)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_write_end as *const _ as usize },
//         48usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(_IO_FILE),
//             "::",
//             stringify!(_IO_write_end)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_buf_base as *const _ as usize },
//         56usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(_IO_FILE),
//             "::",
//             stringify!(_IO_buf_base)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_buf_end as *const _ as usize },
//         64usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(_IO_FILE),
//             "::",
//             stringify!(_IO_buf_end)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_save_base as *const _ as usize },
//         72usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(_IO_FILE),
//             "::",
//             stringify!(_IO_save_base)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_backup_base as *const _ as usize },
//         80usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(_IO_FILE),
//             "::",
//             stringify!(_IO_backup_base)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_save_end as *const _ as usize },
//         88usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(_IO_FILE),
//             "::",
//             stringify!(_IO_save_end)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._markers as *const _ as usize },
//         96usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(_IO_FILE),
//             "::",
//             stringify!(_markers)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._chain as *const _ as usize },
//         104usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(_IO_FILE),
//             "::",
//             stringify!(_chain)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._fileno as *const _ as usize },
//         112usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(_IO_FILE),
//             "::",
//             stringify!(_fileno)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._flags2 as *const _ as usize },
//         116usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(_IO_FILE),
//             "::",
//             stringify!(_flags2)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._old_offset as *const _ as usize },
//         120usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(_IO_FILE),
//             "::",
//             stringify!(_old_offset)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._cur_column as *const _ as usize },
//         128usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(_IO_FILE),
//             "::",
//             stringify!(_cur_column)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._vtable_offset as *const _ as usize },
//         130usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(_IO_FILE),
//             "::",
//             stringify!(_vtable_offset)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._shortbuf as *const _ as usize },
//         131usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(_IO_FILE),
//             "::",
//             stringify!(_shortbuf)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._lock as *const _ as usize },
//         136usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(_IO_FILE),
//             "::",
//             stringify!(_lock)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._offset as *const _ as usize },
//         144usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(_IO_FILE),
//             "::",
//             stringify!(_offset)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._codecvt as *const _ as usize },
//         152usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(_IO_FILE),
//             "::",
//             stringify!(_codecvt)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._wide_data as *const _ as usize },
//         160usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(_IO_FILE),
//             "::",
//             stringify!(_wide_data)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._freeres_list as *const _ as usize },
//         168usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(_IO_FILE),
//             "::",
//             stringify!(_freeres_list)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._freeres_buf as *const _ as usize },
//         176usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(_IO_FILE),
//             "::",
//             stringify!(_freeres_buf)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<_IO_FILE>())).__pad5 as *const _ as usize },
//         184usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(_IO_FILE),
//             "::",
//             stringify!(__pad5)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._mode as *const _ as usize },
//         192usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(_IO_FILE),
//             "::",
//             stringify!(_mode)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._unused2 as *const _ as usize },
//         196usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(_IO_FILE),
//             "::",
//             stringify!(_unused2)
//         )
//     );
// }
impl Default for _IO_FILE {
    fn default() -> Self {
        unsafe { zeroed() }
    }
}
pub type mbstate_t = self::root::__mbstate_t;
pub type __gthread_once_t = self::root::pthread_once_t;
pub type __gthread_mutex_t = self::root::pthread_mutex_t;
pub type _Atomic_word = c_int;
pub type THREAD_HANDLE = self::root::pthread_t;
pub type THREAD_RETURN = *mut c_void;
pub type THREAD_FUNCTION =
    ::std::option::Option<unsafe extern "C" fn(arg1: *mut c_void) -> *mut c_void>;
pub type MUTEX = self::root::pthread_mutex_t;
#[repr(C)]
#[derive(Debug, Default, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct XThread {
    pub thread: self::root::THREAD_HANDLE,
}
// #[test]
// fn bindgen_test_layout_XThread() {
//     assert_eq!(
//         size_of::<XThread>(),
//         8usize,
//         concat!("Size of: ", stringify!(XThread))
//     );
//     assert_eq!(
//         align_of::<XThread>(),
//         8usize,
//         concat!("Alignment of ", stringify!(XThread))
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<XThread>())).thread as *const _ as usize },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(XThread),
//             "::",
//             stringify!(thread)
//         )
//     );
// }
extern "C" {
    #[link_name = "\u{1}start"]
    pub fn XThread_start(
        this: *mut self::root::XThread,
        routine: self::root::THREAD_FUNCTION,
        ptr: *mut c_void,
    ) -> bool;
}
extern "C" {
    #[link_name = "\u{1}wait"]
    pub fn XThread_wait(this: *mut self::root::XThread, milliseconds: c_long, cancel: bool)
        -> bool;
}
extern "C" {
    #[link_name = "\u{1}test"]
    pub fn XThread_test();
}
extern "C" {
    #[link_name = "\u{1}XThread"]
    pub fn XThread_XThread(this: *mut self::root::XThread);
}
extern "C" {
    #[link_name = "\u{1}XThread_destructor"]
    pub fn XThread_XThread_destructor(this: *mut self::root::XThread);
}
impl XThread {
    #[inline]
    pub unsafe fn start(&mut self, routine: self::root::THREAD_FUNCTION, ptr: *mut c_void) -> bool {
        XThread_start(self, routine, ptr)
    }
    #[inline]
    pub unsafe fn wait(&mut self, milliseconds: c_long, cancel: bool) -> bool {
        XThread_wait(self, milliseconds, cancel)
    }
    #[inline]
    pub unsafe fn test() {
        XThread_test()
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = uninitialized();
        XThread_XThread(&mut __bindgen_tmp);
        __bindgen_tmp
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        XThread_XThread_destructor(self)
    }
}
#[repr(C)]
pub struct XMutex {
    pub mutex: self::root::MUTEX,
}
// #[test]
// fn bindgen_test_layout_XMutex() {
//     assert_eq!(
//         size_of::<XMutex>(),
//         40usize,
//         concat!("Size of: ", stringify!(XMutex))
//     );
//     assert_eq!(
//         align_of::<XMutex>(),
//         8usize,
//         concat!("Alignment of ", stringify!(XMutex))
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<XMutex>())).mutex as *const _ as usize },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(XMutex),
//             "::",
//             stringify!(mutex)
//         )
//     );
// }
extern "C" {
    #[link_name = "\u{1}acquire"]
    pub fn XMutex_acquire(this: *mut self::root::XMutex);
}
extern "C" {
    #[link_name = "\u{1}release"]
    pub fn XMutex_release(this: *mut self::root::XMutex);
}
extern "C" {
    #[link_name = "\u{1}XMutex"]
    pub fn XMutex_XMutex(this: *mut self::root::XMutex);
}
extern "C" {
    #[link_name = "\u{1}XMutex_destructor"]
    pub fn XMutex_XMutex_destructor(this: *mut self::root::XMutex);
}
impl Default for XMutex {
    fn default() -> Self {
        unsafe { zeroed() }
    }
}
impl ::std::fmt::Debug for XMutex {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "XMutex {{ mutex: {:?} }}", self.mutex)
    }
}
impl XMutex {
    #[inline]
    pub unsafe fn acquire(&mut self) {
        XMutex_acquire(self)
    }
    #[inline]
    pub unsafe fn release(&mut self) {
        XMutex_release(self)
    }
    #[inline]
    pub unsafe fn new() -> Self {
        let mut __bindgen_tmp = uninitialized();
        XMutex_XMutex(&mut __bindgen_tmp);
        __bindgen_tmp
    }
    #[inline]
    pub unsafe fn destruct(&mut self) {
        XMutex_XMutex_destructor(self)
    }
}
#[repr(C)]
#[derive(Debug, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct XWriteThread {
    pub m_thread_exit: c_ulong,
    pub m_thread: self::root::XThread,
    pub m_data_buffer: *mut self::root::FastCircularBuffer,
    pub m_bytes_in_buffer: usize,
    pub m_thread_buffer: *mut c_uchar,
    pub m_stream: *mut self::root::FILE,
    pub m_msg_buffer: *mut self::root::CircularBuffer<self::root::XWriteThread_Message>,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct XWriteThread_Message {
    pub operation: self::root::XWriteThread_Message__bindgen_ty_1,
    pub file: *mut self::root::FILE,
    pub __bindgen_anon_1: self::root::XWriteThread_Message__bindgen_ty_2,
}
pub const XWriteThread_Message_WRITE: self::root::XWriteThread_Message__bindgen_ty_1 = 0;
pub const XWriteThread_Message_SEEK: self::root::XWriteThread_Message__bindgen_ty_1 = 1;
pub const XWriteThread_Message_FLUSH: self::root::XWriteThread_Message__bindgen_ty_1 = 2;
pub const XWriteThread_Message_CLOSE: self::root::XWriteThread_Message__bindgen_ty_1 = 3;
pub const XWriteThread_Message_SHUTDOWN: self::root::XWriteThread_Message__bindgen_ty_1 = 4;
pub type XWriteThread_Message__bindgen_ty_1 = u32;
#[repr(C)]
#[derive(Copy, Clone)]
pub union XWriteThread_Message__bindgen_ty_2 {
    pub write: self::root::XWriteThread_Message__bindgen_ty_2__bindgen_ty_1,
    pub seek: self::root::XWriteThread_Message__bindgen_ty_2__bindgen_ty_2,
    _bindgen_union_align: [u64; 2usize],
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct XWriteThread_Message__bindgen_ty_2__bindgen_ty_1 {
    pub data_size: usize,
}
// #[test]
// fn bindgen_test_layout_XWriteThread_Message__bindgen_ty_2__bindgen_ty_1() {
//     assert_eq!(
//         size_of::<XWriteThread_Message__bindgen_ty_2__bindgen_ty_1>(),
//         8usize,
//         concat!(
//             "Size of: ",
//             stringify!(XWriteThread_Message__bindgen_ty_2__bindgen_ty_1)
//         )
//     );
//     assert_eq!(
//         align_of::<XWriteThread_Message__bindgen_ty_2__bindgen_ty_1>(),
//         8usize,
//         concat!(
//             "Alignment of ",
//             stringify!(XWriteThread_Message__bindgen_ty_2__bindgen_ty_1)
//         )
//     );
//     assert_eq!(
//         unsafe {
//             &(*(::std::ptr::null::<XWriteThread_Message__bindgen_ty_2__bindgen_ty_1>()))
//                 .data_size as *const _ as usize
//         },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(XWriteThread_Message__bindgen_ty_2__bindgen_ty_1),
//             "::",
//             stringify!(data_size)
//         )
//     );
// }
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct XWriteThread_Message__bindgen_ty_2__bindgen_ty_2 {
    pub offset: c_long,
    pub whence: c_int,
}
// #[test]
// fn bindgen_test_layout_XWriteThread_Message__bindgen_ty_2__bindgen_ty_2() {
//     assert_eq!(
//         size_of::<XWriteThread_Message__bindgen_ty_2__bindgen_ty_2>(),
//         16usize,
//         concat!(
//             "Size of: ",
//             stringify!(XWriteThread_Message__bindgen_ty_2__bindgen_ty_2)
//         )
//     );
//     assert_eq!(
//         align_of::<XWriteThread_Message__bindgen_ty_2__bindgen_ty_2>(),
//         8usize,
//         concat!(
//             "Alignment of ",
//             stringify!(XWriteThread_Message__bindgen_ty_2__bindgen_ty_2)
//         )
//     );
//     assert_eq!(
//         unsafe {
//             &(*(::std::ptr::null::<XWriteThread_Message__bindgen_ty_2__bindgen_ty_2>())).offset
//                 as *const _ as usize
//         },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(XWriteThread_Message__bindgen_ty_2__bindgen_ty_2),
//             "::",
//             stringify!(offset)
//         )
//     );
//     assert_eq!(
//         unsafe {
//             &(*(::std::ptr::null::<XWriteThread_Message__bindgen_ty_2__bindgen_ty_2>())).whence
//                 as *const _ as usize
//         },
//         8usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(XWriteThread_Message__bindgen_ty_2__bindgen_ty_2),
//             "::",
//             stringify!(whence)
//         )
//     );
// }
// #[test]
// fn bindgen_test_layout_XWriteThread_Message__bindgen_ty_2() {
//     assert_eq!(
//         size_of::<XWriteThread_Message__bindgen_ty_2>(),
//         16usize,
//         concat!("Size of: ", stringify!(XWriteThread_Message__bindgen_ty_2))
//     );
//     assert_eq!(
//         align_of::<XWriteThread_Message__bindgen_ty_2>(),
//         8usize,
//         concat!(
//             "Alignment of ",
//             stringify!(XWriteThread_Message__bindgen_ty_2)
//         )
//     );
//     assert_eq!(
//         unsafe {
//             &(*(::std::ptr::null::<XWriteThread_Message__bindgen_ty_2>())).write as *const _
//                 as usize
//         },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(XWriteThread_Message__bindgen_ty_2),
//             "::",
//             stringify!(write)
//         )
//     );
//     assert_eq!(
//         unsafe {
//             &(*(::std::ptr::null::<XWriteThread_Message__bindgen_ty_2>())).seek as *const _
//                 as usize
//         },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(XWriteThread_Message__bindgen_ty_2),
//             "::",
//             stringify!(seek)
//         )
//     );
// }
impl Default for XWriteThread_Message__bindgen_ty_2 {
    fn default() -> Self {
        unsafe { zeroed() }
    }
}
impl ::std::fmt::Debug for XWriteThread_Message__bindgen_ty_2 {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(f, "XWriteThread_Message__bindgen_ty_2 {{ union }}")
    }
}
// #[test]
// fn bindgen_test_layout_XWriteThread_Message() {
//     assert_eq!(
//         size_of::<XWriteThread_Message>(),
//         32usize,
//         concat!("Size of: ", stringify!(XWriteThread_Message))
//     );
//     assert_eq!(
//         align_of::<XWriteThread_Message>(),
//         8usize,
//         concat!("Alignment of ", stringify!(XWriteThread_Message))
//     );
//     assert_eq!(
//         unsafe {
//             &(*(::std::ptr::null::<XWriteThread_Message>())).operation as *const _ as usize
//         },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(XWriteThread_Message),
//             "::",
//             stringify!(operation)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<XWriteThread_Message>())).file as *const _ as usize },
//         8usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(XWriteThread_Message),
//             "::",
//             stringify!(file)
//         )
//     );
// }
impl Default for XWriteThread_Message {
    fn default() -> Self {
        unsafe { zeroed() }
    }
}
impl ::std::fmt::Debug for XWriteThread_Message {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write!(
            f,
            "XWriteThread_Message {{ operation: {:?}, file: {:?}, __bindgen_anon_1: {:?} }}",
            self.operation, self.file, self.__bindgen_anon_1
        )
    }
}
extern "C" {
    #[link_name = "\u{1}PRODUCER_BUFFER_SIZE"]
    pub static XWriteThread_PRODUCER_BUFFER_SIZE: usize;
}
extern "C" {
    #[link_name = "\u{1}o_defaultWriteThread"]
    pub static mut XWriteThread_o_defaultWriteThread: *mut self::root::XWriteThread;
}
// #[test]
// fn bindgen_test_layout_XWriteThread() {
//     assert_eq!(
//         size_of::<XWriteThread>(),
//         56usize,
//         concat!("Size of: ", stringify!(XWriteThread))
//     );
//     assert_eq!(
//         align_of::<XWriteThread>(),
//         8usize,
//         concat!("Alignment of ", stringify!(XWriteThread))
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<XWriteThread>())).m_thread_exit as *const _ as usize },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(XWriteThread),
//             "::",
//             stringify!(m_thread_exit)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<XWriteThread>())).m_thread as *const _ as usize },
//         8usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(XWriteThread),
//             "::",
//             stringify!(m_thread)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<XWriteThread>())).m_data_buffer as *const _ as usize },
//         16usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(XWriteThread),
//             "::",
//             stringify!(m_data_buffer)
//         )
//     );
//     assert_eq!(
//         unsafe {
//             &(*(::std::ptr::null::<XWriteThread>())).m_bytes_in_buffer as *const _ as usize
//         },
//         24usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(XWriteThread),
//             "::",
//             stringify!(m_bytes_in_buffer)
//         )
//     );
//     assert_eq!(
//         unsafe {
//             &(*(::std::ptr::null::<XWriteThread>())).m_thread_buffer as *const _ as usize
//         },
//         32usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(XWriteThread),
//             "::",
//             stringify!(m_thread_buffer)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<XWriteThread>())).m_stream as *const _ as usize },
//         40usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(XWriteThread),
//             "::",
//             stringify!(m_stream)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<XWriteThread>())).m_msg_buffer as *const _ as usize },
//         48usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(XWriteThread),
//             "::",
//             stringify!(m_msg_buffer)
//         )
//     );
// }
extern "C" {
    #[link_name = "\u{1}shared"]
    pub fn XWriteThread_shared() -> *mut self::root::XWriteThread;
}
extern "C" {
    #[link_name = "\u{1}fwrite"]
    pub fn XWriteThread_fwrite(
        this: *mut self::root::XWriteThread,
        ptr: *const c_void,
        size: usize,
        nitems: usize,
        stream: *mut self::root::FILE,
    ) -> usize;
}
extern "C" {
    #[link_name = "\u{1}fseek"]
    pub fn XWriteThread_fseek(
        this: *mut self::root::XWriteThread,
        stream: *mut self::root::FILE,
        offset: c_long,
        whence: c_int,
    ) -> c_int;
}
extern "C" {
    #[link_name = "\u{1}fflush"]
    pub fn XWriteThread_fflush(
        this: *mut self::root::XWriteThread,
        stream: *mut self::root::FILE,
    ) -> c_int;
}
extern "C" {
    #[link_name = "\u{1}fclose"]
    pub fn XWriteThread_fclose(
        this: *mut self::root::XWriteThread,
        stream: *mut self::root::FILE,
    ) -> c_int;
}
extern "C" {
    #[link_name = "\u{1}shutdown"]
    pub fn XWriteThread_shutdown(this: *mut self::root::XWriteThread);
}
extern "C" {
    #[link_name = "\u{1}XWriteThread"]
    pub fn XWriteThread_XWriteThread(
        this: *mut self::root::XWriteThread,
        data_buffer_size: usize,
        msg_buffer_size: usize,
    );
}
impl Default for XWriteThread {
    fn default() -> Self {
        unsafe { zeroed() }
    }
}
impl XWriteThread {
    #[inline]
    pub unsafe fn shared() -> *mut self::root::XWriteThread {
        XWriteThread_shared()
    }
    #[inline]
    pub unsafe fn fwrite(
        &mut self,
        ptr: *const c_void,
        size: usize,
        nitems: usize,
        stream: *mut self::root::FILE,
    ) -> usize {
        XWriteThread_fwrite(self, ptr, size, nitems, stream)
    }
    #[inline]
    pub unsafe fn fseek(
        &mut self,
        stream: *mut self::root::FILE,
        offset: c_long,
        whence: c_int,
    ) -> c_int {
        XWriteThread_fseek(self, stream, offset, whence)
    }
    #[inline]
    pub unsafe fn fflush(&mut self, stream: *mut self::root::FILE) -> c_int {
        XWriteThread_fflush(self, stream)
    }
    #[inline]
    pub unsafe fn fclose(&mut self, stream: *mut self::root::FILE) -> c_int {
        XWriteThread_fclose(self, stream)
    }
    #[inline]
    pub unsafe fn shutdown(&mut self) {
        XWriteThread_shutdown(self)
    }
    #[inline]
    pub unsafe fn new(data_buffer_size: usize, msg_buffer_size: usize) -> Self {
        let mut __bindgen_tmp = uninitialized();
        XWriteThread_XWriteThread(&mut __bindgen_tmp, data_buffer_size, msg_buffer_size);
        __bindgen_tmp
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ck_socket_ {
    _unused: [u8; 0],
}
pub type ck_socket = *mut self::root::ck_socket_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct WvOut {
    _unused: [u8; 0],
}
#[repr(C)]
pub struct Chuck_Carrier {
    pub chuck: *mut self::root::ChucK,
    pub compiler: *mut self::root::Chuck_Compiler,
    pub env: *mut self::root::Chuck_Env,
    pub vm: *mut self::root::Chuck_VM,
    pub chout: *mut self::root::Chuck_IO_Chout,
    pub cherr: *mut self::root::Chuck_IO_Cherr,
    pub otf_socket: self::root::ck_socket,
    pub otf_port: c_long,
    pub otf_thread: self::root::pthread_t,
    pub stk_writeThread: *mut self::root::XWriteThread,
    pub stk_wvOutMap: self::root::std::map,
}
// #[test]
// fn bindgen_test_layout_Chuck_Carrier() {
//     assert_eq!(
//         size_of::<Chuck_Carrier>(),
//         128usize,
//         concat!("Size of: ", stringify!(Chuck_Carrier))
//     );
//     assert_eq!(
//         align_of::<Chuck_Carrier>(),
//         8usize,
//         concat!("Alignment of ", stringify!(Chuck_Carrier))
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<Chuck_Carrier>())).chuck as *const _ as usize },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(Chuck_Carrier),
//             "::",
//             stringify!(chuck)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<Chuck_Carrier>())).compiler as *const _ as usize },
//         8usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(Chuck_Carrier),
//             "::",
//             stringify!(compiler)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<Chuck_Carrier>())).env as *const _ as usize },
//         16usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(Chuck_Carrier),
//             "::",
//             stringify!(env)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<Chuck_Carrier>())).vm as *const _ as usize },
//         24usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(Chuck_Carrier),
//             "::",
//             stringify!(vm)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<Chuck_Carrier>())).chout as *const _ as usize },
//         32usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(Chuck_Carrier),
//             "::",
//             stringify!(chout)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<Chuck_Carrier>())).cherr as *const _ as usize },
//         40usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(Chuck_Carrier),
//             "::",
//             stringify!(cherr)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<Chuck_Carrier>())).otf_socket as *const _ as usize },
//         48usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(Chuck_Carrier),
//             "::",
//             stringify!(otf_socket)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<Chuck_Carrier>())).otf_port as *const _ as usize },
//         56usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(Chuck_Carrier),
//             "::",
//             stringify!(otf_port)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<Chuck_Carrier>())).otf_thread as *const _ as usize },
//         64usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(Chuck_Carrier),
//             "::",
//             stringify!(otf_thread)
//         )
//     );
//     assert_eq!(
//         unsafe {
//             &(*(::std::ptr::null::<Chuck_Carrier>())).stk_writeThread as *const _ as usize
//         },
//         72usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(Chuck_Carrier),
//             "::",
//             stringify!(stk_writeThread)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<Chuck_Carrier>())).stk_wvOutMap as *const _ as usize },
//         80usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(Chuck_Carrier),
//             "::",
//             stringify!(stk_wvOutMap)
//         )
//     );
// }
extern "C" {
    #[link_name = "\u{1}hintIsRealtimeAudio"]
    pub fn Chuck_Carrier_hintIsRealtimeAudio(this: *mut self::root::Chuck_Carrier) -> c_ulong;
}
impl Default for Chuck_Carrier {
    fn default() -> Self {
        unsafe { zeroed() }
    }
}
impl ::std::fmt::Debug for Chuck_Carrier {
    fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
        write ! ( f , "Chuck_Carrier {{ chuck: {:?}, compiler: {:?}, env: {:?}, vm: {:?}, chout: {:?}, cherr: {:?}, otf_socket: {:?}, otf_port: {:?}, otf_thread: {:?}, stk_writeThread: {:?}, stk_wvOutMap: {:?} }}" , self . chuck , self . compiler , self . env , self . vm , self . chout , self . cherr , self . otf_socket , self . otf_port , self . otf_thread , self . stk_writeThread , self . stk_wvOutMap )
    }
}
impl PartialEq for Chuck_Carrier {
    fn eq(&self, other: &Chuck_Carrier) -> bool {
        self.chuck == other.chuck
            && self.compiler == other.compiler
            && self.env == other.env
            && self.vm == other.vm
            && self.chout == other.chout
            && self.cherr == other.cherr
            && self.otf_socket == other.otf_socket
            && self.otf_port == other.otf_port
            && self.otf_thread == other.otf_thread
            && self.stk_writeThread == other.stk_writeThread
            && self.stk_wvOutMap == other.stk_wvOutMap
    }
}
impl Chuck_Carrier {
    #[inline]
    pub unsafe fn hintIsRealtimeAudio(&mut self) -> c_ulong {
        Chuck_Carrier_hintIsRealtimeAudio(self)
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __dirstream {
    _unused: [u8; 0],
}
pub type DIR = self::root::__dirstream;
#[repr(C)]
pub struct Chuck_VM_Object__bindgen_vtable(c_void);
#[repr(C)]
#[derive(Debug, Hash, PartialOrd, Ord, PartialEq, Eq)]
pub struct Chuck_VM_Object {
    pub vtable_: *const Chuck_VM_Object__bindgen_vtable,
    pub m_ref_count: c_ulong,
    pub m_pooled: c_ulong,
    pub m_locked: c_ulong,
    pub m_v_ref: *mut self::root::std::vector,
}
extern "C" {
    #[link_name = "\u{1}our_locks_in_effect"]
    pub static mut Chuck_VM_Object_our_locks_in_effect: c_ulong;
}
// #[test]
// fn bindgen_test_layout_Chuck_VM_Object() {
//     assert_eq!(
//         size_of::<Chuck_VM_Object>(),
//         40usize,
//         concat!("Size of: ", stringify!(Chuck_VM_Object))
//     );
//     assert_eq!(
//         align_of::<Chuck_VM_Object>(),
//         8usize,
//         concat!("Alignment of ", stringify!(Chuck_VM_Object))
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<Chuck_VM_Object>())).m_ref_count as *const _ as usize },
//         8usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(Chuck_VM_Object),
//             "::",
//             stringify!(m_ref_count)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<Chuck_VM_Object>())).m_pooled as *const _ as usize },
//         16usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(Chuck_VM_Object),
//             "::",
//             stringify!(m_pooled)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<Chuck_VM_Object>())).m_locked as *const _ as usize },
//         24usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(Chuck_VM_Object),
//             "::",
//             stringify!(m_locked)
//         )
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<Chuck_VM_Object>())).m_v_ref as *const _ as usize },
//         32usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(Chuck_VM_Object),
//             "::",
//             stringify!(m_v_ref)
//         )
//     );
// }
extern "C" {
    #[link_name = "\u{1}lock_all"]
    pub fn Chuck_VM_Object_lock_all();
}
extern "C" {
    #[link_name = "\u{1}unlock_all"]
    pub fn Chuck_VM_Object_unlock_all();
}
impl Default for Chuck_VM_Object {
    fn default() -> Self {
        unsafe { zeroed() }
    }
}
impl Chuck_VM_Object {
    #[inline]
    pub unsafe fn lock_all() {
        Chuck_VM_Object_lock_all()
    }
    #[inline]
    pub unsafe fn unlock_all() {
        Chuck_VM_Object_unlock_all()
    }
}
extern "C" {
    #[link_name = "\u{1}add_ref"]
    pub fn Chuck_VM_Object_add_ref(this: *mut c_void);
}
extern "C" {
    #[link_name = "\u{1}release"]
    pub fn Chuck_VM_Object_release(this: *mut c_void);
}
extern "C" {
    #[link_name = "\u{1}lock"]
    pub fn Chuck_VM_Object_lock(this: *mut c_void);
}
#[repr(C)]
pub struct Chuck_VTable {
    pub funcs: self::root::std::vector,
}
// #[test]
// fn bindgen_test_layout_Chuck_VTable() {
//     assert_eq!(
//         size_of::<Chuck_VTable>(),
//         24usize,
//         concat!("Size of: ", stringify!(Chuck_VTable))
//     );
//     assert_eq!(
//         align_of::<Chuck_VTable>(),
//         8usize,
//         concat!("Alignment of ", stringify!(Chuck_VTable))
//     );
//     assert_eq!(
//         unsafe { &(*(::std::ptr::null::<Chuck_VTable>())).funcs as *const _ as usize },
//         0usize,
//         concat!(
//             "Offset of field: ",
//             stringify!(Chuck_VTable),
//             "::",
//             stringify!(funcs)
//         )
//     );
// }
impl Default for Chuck_VTable {
    fn default() -> Self {
        unsafe { zeroed() }
    }
}
impl ::std::fmt::Debug for Chuck_VTable {
