/* automatically generated by rust-bindgen */

#[allow(non_snake_case, non_camel_case_types, non_upper_case_globals)]
pub mod root {
    #[repr(C)]
    #[derive(Default)]
    pub struct __IncompleteArrayField<T>(::std::marker::PhantomData<T>, [T; 0]);
    impl<T> __IncompleteArrayField<T> {
        #[inline]
        pub fn new() -> Self {
            __IncompleteArrayField(::std::marker::PhantomData, [])
        }
        #[inline]
        pub unsafe fn as_ptr(&self) -> *const T {
            ::std::mem::transmute(self)
        }
        #[inline]
        pub unsafe fn as_mut_ptr(&mut self) -> *mut T {
            ::std::mem::transmute(self)
        }
        #[inline]
        pub unsafe fn as_slice(&self, len: usize) -> &[T] {
            ::std::slice::from_raw_parts(self.as_ptr(), len)
        }
        #[inline]
        pub unsafe fn as_mut_slice(&mut self, len: usize) -> &mut [T] {
            ::std::slice::from_raw_parts_mut(self.as_mut_ptr(), len)
        }
    }
    impl<T> ::std::fmt::Debug for __IncompleteArrayField<T> {
        fn fmt(&self, fmt: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
            fmt.write_str("__IncompleteArrayField")
        }
    }
    impl<T> ::std::clone::Clone for __IncompleteArrayField<T> {
        #[inline]
        fn clone(&self) -> Self {
            Self::new()
        }
    }

    pub const __llvm__: u32 = 1;
    pub const __clang__: u32 = 1;
    pub const __clang_major__: u32 = 8;

    pub const TCP_NOTSENT_LOWAT: u32 = 25;
    pub const TCP_CC_INFO: u32 = 26;
    pub const TCP_SAVE_SYN: u32 = 27;
    pub const TCP_SAVED_SYN: u32 = 28;
    pub const TCP_REPAIR_WINDOW: u32 = 29;
    pub const TCP_FASTOPEN_CONNECT: u32 = 30;
    pub const TCP_ULP: u32 = 31;
    pub const TCP_MD5SIG_EXT: u32 = 32;
    pub const TCP_FASTOPEN_KEY: u32 = 33;
    pub const TCP_FASTOPEN_NO_COOKIE: u32 = 34;
    pub const _ARPA_INET_H: u32 = 1;
    pub const _NETDB_H: u32 = 1;
    pub const _PATH_HEQUIV: &'static [u8; 17usize] = b"/etc/hosts.equiv\0";
    pub const _PATH_HOSTS: &'static [u8; 11usize] = b"/etc/hosts\0";
    pub const _PATH_NETWORKS: &'static [u8; 14usize] = b"/etc/networks\0";
    pub const _PATH_NSSWITCH_CONF: &'static [u8; 19usize] = b"/etc/nsswitch.conf\0";
    pub const _PATH_PROTOCOLS: &'static [u8; 15usize] = b"/etc/protocols\0";
    pub const _PATH_SERVICES: &'static [u8; 14usize] = b"/etc/services\0";
    pub const HOST_NOT_FOUND: u32 = 1;
    pub const TRY_AGAIN: u32 = 2;
    pub const NO_RECOVERY: u32 = 3;
    pub const NO_DATA: u32 = 4;
    pub type __u_char = ::std::os::raw::c_uchar;
    pub type __u_short = ::std::os::raw::c_ushort;
    pub type __u_int = ::std::os::raw::c_uint;
    pub type __u_long = ::std::os::raw::c_ulong;
    pub type __int8_t = ::std::os::raw::c_schar;
    pub type __uint8_t = ::std::os::raw::c_uchar;
    pub type __int16_t = ::std::os::raw::c_short;
    pub type __uint16_t = ::std::os::raw::c_ushort;
    pub type __int32_t = ::std::os::raw::c_int;
    pub type __uint32_t = ::std::os::raw::c_uint;
    pub type __int64_t = ::std::os::raw::c_long;
    pub type __uint64_t = ::std::os::raw::c_ulong;
    pub type __int_least8_t = __int8_t;
    pub type __uint_least8_t = __uint8_t;
    pub type __int_least16_t = __int16_t;
    pub type __uint_least16_t = __uint16_t;
    pub type __int_least32_t = __int32_t;
    pub type __uint_least32_t = __uint32_t;
    pub type __int_least64_t = __int64_t;
    pub type __uint_least64_t = __uint64_t;
    pub type __quad_t = ::std::os::raw::c_long;
    pub type __u_quad_t = ::std::os::raw::c_ulong;
    pub type __intmax_t = ::std::os::raw::c_long;
    pub type __uintmax_t = ::std::os::raw::c_ulong;
    pub type __dev_t = ::std::os::raw::c_ulong;
    pub type __uid_t = ::std::os::raw::c_uint;
    pub type __gid_t = ::std::os::raw::c_uint;
    pub type __ino_t = ::std::os::raw::c_ulong;
    pub type __ino64_t = ::std::os::raw::c_ulong;
    pub type __mode_t = ::std::os::raw::c_uint;
    pub type __nlink_t = ::std::os::raw::c_ulong;
    pub type __off_t = ::std::os::raw::c_long;
    pub type __off64_t = ::std::os::raw::c_long;
    pub type __pid_t = ::std::os::raw::c_int;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __fsid_t {
        pub __val: [::std::os::raw::c_int; 2usize],
    }
    #[test]
    fn bindgen_test_layout___fsid_t() {
        assert_eq!(
            ::std::mem::size_of::<__fsid_t>(),
            8usize,
            concat!("Size of: ", stringify!(__fsid_t))
        );
        assert_eq!(
            ::std::mem::align_of::<__fsid_t>(),
            4usize,
            concat!("Alignment of ", stringify!(__fsid_t))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<__fsid_t>())).__val as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__fsid_t),
                "::",
                stringify!(__val)
            )
        );
    }
    pub type __clock_t = ::std::os::raw::c_long;
    pub type __rlim_t = ::std::os::raw::c_ulong;
    pub type __rlim64_t = ::std::os::raw::c_ulong;
    pub type __id_t = ::std::os::raw::c_uint;
    pub type __time_t = ::std::os::raw::c_long;
    pub type __useconds_t = ::std::os::raw::c_uint;
    pub type __suseconds_t = ::std::os::raw::c_long;
    pub type __daddr_t = ::std::os::raw::c_int;
    pub type __key_t = ::std::os::raw::c_int;
    pub type __clockid_t = ::std::os::raw::c_int;
    pub type __timer_t = *mut ::std::os::raw::c_void;
    pub type __blksize_t = ::std::os::raw::c_long;
    pub type __blkcnt_t = ::std::os::raw::c_long;
    pub type __blkcnt64_t = ::std::os::raw::c_long;
    pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
    pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
    pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
    pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
    pub type __fsword_t = ::std::os::raw::c_long;
    pub type __ssize_t = ::std::os::raw::c_long;
    pub type __syscall_slong_t = ::std::os::raw::c_long;
    pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
    pub type __loff_t = __off64_t;
    pub type __caddr_t = *mut ::std::os::raw::c_char;
    pub type __intptr_t = ::std::os::raw::c_long;
    pub type __socklen_t = ::std::os::raw::c_uint;
    pub type __sig_atomic_t = ::std::os::raw::c_int;
    pub type ino_t = __ino_t;
    pub type dev_t = __dev_t;
    pub type gid_t = __gid_t;
    pub type mode_t = __mode_t;
    pub type nlink_t = __nlink_t;
    pub type uid_t = __uid_t;
    pub type off_t = __off_t;
    pub type pid_t = __pid_t;
    pub type clockid_t = __clockid_t;
    pub type time_t = __time_t;
    pub type timer_t = __timer_t;
    pub type u_int8_t = ::std::os::raw::c_uchar;
    pub type u_int16_t = ::std::os::raw::c_ushort;
    pub type u_int32_t = ::std::os::raw::c_uint;
    pub type u_int64_t = ::std::os::raw::c_ulong;
    pub type register_t = ::std::os::raw::c_long;
    pub type blkcnt_t = __blkcnt_t;
    pub type fsblkcnt_t = __fsblkcnt_t;
    pub type fsfilcnt_t = __fsfilcnt_t;
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct iovec {
        pub iov_base: *mut ::std::os::raw::c_void,
        pub iov_len: usize,
    }
    #[test]
    fn bindgen_test_layout_iovec() {
        assert_eq!(
            ::std::mem::size_of::<iovec>(),
            16usize,
            concat!("Size of: ", stringify!(iovec))
        );
        assert_eq!(
            ::std::mem::align_of::<iovec>(),
            8usize,
            concat!("Alignment of ", stringify!(iovec))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<iovec>())).iov_base as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(iovec),
                "::",
                stringify!(iov_base)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<iovec>())).iov_len as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(iovec),
                "::",
                stringify!(iov_len)
            )
        );
    }
    impl Default for iovec {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    pub type socklen_t = __socklen_t;
    #[repr(u32)]
    #[derive(Debug, Copy, Clone, PartialEq, Eq, Hash, PartialOrd, Ord)]
    pub enum __socket_type {
        SOCK_STREAM = 1,
        SOCK_DGRAM = 2,
        SOCK_RAW = 3,
        SOCK_RDM = 4,
        SOCK_SEQPACKET = 5,
        SOCK_DCCP = 6,
        SOCK_PACKET = 10,
        SOCK_CLOEXEC = 524288,
        SOCK_NONBLOCK = 2048,
    }
    pub type sa_family_t = ::std::os::raw::c_ushort;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct sockaddr {
        pub sa_family: sa_family_t,
        pub sa_data: [::std::os::raw::c_char; 14usize],
    }
    #[test]
    fn bindgen_test_layout_sockaddr() {
        assert_eq!(
            ::std::mem::size_of::<sockaddr>(),
            16usize,
            concat!("Size of: ", stringify!(sockaddr))
        );
        assert_eq!(
            ::std::mem::align_of::<sockaddr>(),
            2usize,
            concat!("Alignment of ", stringify!(sockaddr))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<sockaddr>())).sa_family as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(sockaddr),
                "::",
                stringify!(sa_family)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<sockaddr>())).sa_data as *const _ as usize },
            2usize,
            concat!(
                "Offset of field: ",
                stringify!(sockaddr),
                "::",
                stringify!(sa_data)
            )
        );
    }
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub struct sockaddr_storage {
        pub ss_family: sa_family_t,
        pub __ss_padding: [::std::os::raw::c_char; 118usize],
        pub __ss_align: ::std::os::raw::c_ulong,
    }
    #[test]
    fn bindgen_test_layout_sockaddr_storage() {
        assert_eq!(
            ::std::mem::size_of::<sockaddr_storage>(),
            128usize,
            concat!("Size of: ", stringify!(sockaddr_storage))
        );
        assert_eq!(
            ::std::mem::align_of::<sockaddr_storage>(),
            8usize,
            concat!("Alignment of ", stringify!(sockaddr_storage))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<sockaddr_storage>())).ss_family as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(sockaddr_storage),
                "::",
                stringify!(ss_family)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<sockaddr_storage>())).__ss_padding as *const _ as usize
            },
            2usize,
            concat!(
                "Offset of field: ",
                stringify!(sockaddr_storage),
                "::",
                stringify!(__ss_padding)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<sockaddr_storage>())).__ss_align as *const _ as usize },
            120usize,
            concat!(
                "Offset of field: ",
                stringify!(sockaddr_storage),
                "::",
                stringify!(__ss_align)
            )
        );
    }
    impl Default for sockaddr_storage {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    impl ::std::fmt::Debug for sockaddr_storage {
        fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
            write!(
                f,
                "sockaddr_storage {{ ss_family: {:?}, __ss_padding: [{}], __ss_align: {:?} }}",
                self.ss_family,
                self.__ss_padding
                    .iter()
                    .enumerate()
                    .map(|(i, v)| format!("{}{:?}", if i > 0 { ", " } else { "" }, v))
                    .collect::<String>(),
                self.__ss_align
            )
        }
    }
    impl ::std::cmp::PartialEq for sockaddr_storage {
        fn eq(&self, other: &sockaddr_storage) -> bool {
            self.ss_family == other.ss_family
                && &self.__ss_padding[..] == &other.__ss_padding[..]
                && self.__ss_align == other.__ss_align
        }
    }
    pub const MSG_OOB: _bindgen_ty_1 = _bindgen_ty_1::MSG_OOB;
    pub const MSG_PEEK: _bindgen_ty_1 = _bindgen_ty_1::MSG_PEEK;
    pub const MSG_DONTROUTE: _bindgen_ty_1 = _bindgen_ty_1::MSG_DONTROUTE;
    pub const MSG_CTRUNC: _bindgen_ty_1 = _bindgen_ty_1::MSG_CTRUNC;
    pub const MSG_PROXY: _bindgen_ty_1 = _bindgen_ty_1::MSG_PROXY;
    pub const MSG_TRUNC: _bindgen_ty_1 = _bindgen_ty_1::MSG_TRUNC;
    pub const MSG_DONTWAIT: _bindgen_ty_1 = _bindgen_ty_1::MSG_DONTWAIT;
    pub const MSG_EOR: _bindgen_ty_1 = _bindgen_ty_1::MSG_EOR;
    pub const MSG_WAITALL: _bindgen_ty_1 = _bindgen_ty_1::MSG_WAITALL;
    pub const MSG_FIN: _bindgen_ty_1 = _bindgen_ty_1::MSG_FIN;
    pub const MSG_SYN: _bindgen_ty_1 = _bindgen_ty_1::MSG_SYN;
    pub const MSG_CONFIRM: _bindgen_ty_1 = _bindgen_ty_1::MSG_CONFIRM;
    pub const MSG_RST: _bindgen_ty_1 = _bindgen_ty_1::MSG_RST;
    pub const MSG_ERRQUEUE: _bindgen_ty_1 = _bindgen_ty_1::MSG_ERRQUEUE;
    pub const MSG_NOSIGNAL: _bindgen_ty_1 = _bindgen_ty_1::MSG_NOSIGNAL;
    pub const MSG_MORE: _bindgen_ty_1 = _bindgen_ty_1::MSG_MORE;
    pub const MSG_WAITFORONE: _bindgen_ty_1 = _bindgen_ty_1::MSG_WAITFORONE;
    pub const MSG_BATCH: _bindgen_ty_1 = _bindgen_ty_1::MSG_BATCH;
    pub const MSG_ZEROCOPY: _bindgen_ty_1 = _bindgen_ty_1::MSG_ZEROCOPY;
    pub const MSG_FASTOPEN: _bindgen_ty_1 = _bindgen_ty_1::MSG_FASTOPEN;
    pub const MSG_CMSG_CLOEXEC: _bindgen_ty_1 = _bindgen_ty_1::MSG_CMSG_CLOEXEC;
    #[repr(u32)]
    #[derive(Debug, Copy, Clone, PartialEq, Eq, Hash, PartialOrd, Ord)]
    pub enum _bindgen_ty_1 {
        MSG_OOB = 1,
        MSG_PEEK = 2,
        MSG_DONTROUTE = 4,
        MSG_CTRUNC = 8,
        MSG_PROXY = 16,
        MSG_TRUNC = 32,
        MSG_DONTWAIT = 64,
        MSG_EOR = 128,
        MSG_WAITALL = 256,
        MSG_FIN = 512,
        MSG_SYN = 1024,
        MSG_CONFIRM = 2048,
        MSG_RST = 4096,
        MSG_ERRQUEUE = 8192,
        MSG_NOSIGNAL = 16384,
        MSG_MORE = 32768,
        MSG_WAITFORONE = 65536,
        MSG_BATCH = 262144,
        MSG_ZEROCOPY = 67108864,
        MSG_FASTOPEN = 536870912,
        MSG_CMSG_CLOEXEC = 1073741824,
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct msghdr {
        pub msg_name: *mut ::std::os::raw::c_void,
        pub msg_namelen: socklen_t,
        pub msg_iov: *mut iovec,
        pub msg_iovlen: usize,
        pub msg_control: *mut ::std::os::raw::c_void,
        pub msg_controllen: usize,
        pub msg_flags: ::std::os::raw::c_int,
    }
    #[test]
    fn bindgen_test_layout_msghdr() {
        assert_eq!(
            ::std::mem::size_of::<msghdr>(),
            56usize,
            concat!("Size of: ", stringify!(msghdr))
        );
        assert_eq!(
            ::std::mem::align_of::<msghdr>(),
            8usize,
            concat!("Alignment of ", stringify!(msghdr))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<msghdr>())).msg_name as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(msghdr),
                "::",
                stringify!(msg_name)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<msghdr>())).msg_namelen as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(msghdr),
                "::",
                stringify!(msg_namelen)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<msghdr>())).msg_iov as *const _ as usize },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(msghdr),
                "::",
                stringify!(msg_iov)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<msghdr>())).msg_iovlen as *const _ as usize },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(msghdr),
                "::",
                stringify!(msg_iovlen)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<msghdr>())).msg_control as *const _ as usize },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(msghdr),
                "::",
                stringify!(msg_control)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<msghdr>())).msg_controllen as *const _ as usize },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(msghdr),
                "::",
                stringify!(msg_controllen)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<msghdr>())).msg_flags as *const _ as usize },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(msghdr),
                "::",
                stringify!(msg_flags)
            )
        );
    }
    impl Default for msghdr {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    #[repr(C)]
    #[derive(Debug, Default)]
    pub struct cmsghdr {
        pub cmsg_len: usize,
        pub cmsg_level: ::std::os::raw::c_int,
        pub cmsg_type: ::std::os::raw::c_int,
        pub __cmsg_data:
            crate::core::util::net::netc::root::__IncompleteArrayField<::std::os::raw::c_uchar>,
    }
    #[test]
    fn bindgen_test_layout_cmsghdr() {
        assert_eq!(
            ::std::mem::size_of::<cmsghdr>(),
            16usize,
            concat!("Size of: ", stringify!(cmsghdr))
        );
        assert_eq!(
            ::std::mem::align_of::<cmsghdr>(),
            8usize,
            concat!("Alignment of ", stringify!(cmsghdr))
        );
    }
    extern "C" {
        pub fn __cmsg_nxthdr(__mhdr: *mut msghdr, __cmsg: *mut cmsghdr) -> *mut cmsghdr;
    }
    pub const SCM_RIGHTS: _bindgen_ty_2 = _bindgen_ty_2::SCM_RIGHTS;
    #[repr(u32)]
    #[derive(Debug, Copy, Clone, PartialEq, Eq, Hash, PartialOrd, Ord)]
    pub enum _bindgen_ty_2 {
        SCM_RIGHTS = 1,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct linger {
        pub l_onoff: ::std::os::raw::c_int,
        pub l_linger: ::std::os::raw::c_int,
    }
    #[test]
    fn bindgen_test_layout_linger() {
        assert_eq!(
            ::std::mem::size_of::<linger>(),
            8usize,
            concat!("Size of: ", stringify!(linger))
        );
        assert_eq!(
            ::std::mem::align_of::<linger>(),
            4usize,
            concat!("Alignment of ", stringify!(linger))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<linger>())).l_onoff as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(linger),
                "::",
                stringify!(l_onoff)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<linger>())).l_linger as *const _ as usize },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(linger),
                "::",
                stringify!(l_linger)
            )
        );
    }
    pub const SHUT_RD: _bindgen_ty_3 = _bindgen_ty_3::SHUT_RD;
    pub const SHUT_WR: _bindgen_ty_3 = _bindgen_ty_3::SHUT_WR;
    pub const SHUT_RDWR: _bindgen_ty_3 = _bindgen_ty_3::SHUT_RDWR;
    #[repr(u32)]
    #[derive(Debug, Copy, Clone, PartialEq, Eq, Hash, PartialOrd, Ord)]
    pub enum _bindgen_ty_3 {
        SHUT_RD = 0,
        SHUT_WR = 1,
        SHUT_RDWR = 2,
    }
    extern "C" {
        pub fn socket(
            __domain: ::std::os::raw::c_int,
            __type: ::std::os::raw::c_int,
            __protocol: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn socketpair(
            __domain: ::std::os::raw::c_int,
            __type: ::std::os::raw::c_int,
            __protocol: ::std::os::raw::c_int,
            __fds: *mut ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn bind(
            __fd: ::std::os::raw::c_int,
            __addr: *const sockaddr,
            __len: socklen_t,
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn getsockname(
            __fd: ::std::os::raw::c_int,
            __addr: *mut sockaddr,
            __len: *mut socklen_t,
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn connect(
            __fd: ::std::os::raw::c_int,
            __addr: *const sockaddr,
            __len: socklen_t,
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn getpeername(
            __fd: ::std::os::raw::c_int,
            __addr: *mut sockaddr,
            __len: *mut socklen_t,
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn send(
            __fd: ::std::os::raw::c_int,
            __buf: *const ::std::os::raw::c_void,
            __n: usize,
            __flags: ::std::os::raw::c_int,
        ) -> isize;
    }
    extern "C" {
        pub fn recv(
            __fd: ::std::os::raw::c_int,
            __buf: *mut ::std::os::raw::c_void,
            __n: usize,
            __flags: ::std::os::raw::c_int,
        ) -> isize;
    }
    extern "C" {
        pub fn sendto(
            __fd: ::std::os::raw::c_int,
            __buf: *const ::std::os::raw::c_void,
            __n: usize,
            __flags: ::std::os::raw::c_int,
            __addr: *const sockaddr,
            __addr_len: socklen_t,
        ) -> isize;
    }
    extern "C" {
        pub fn recvfrom(
            __fd: ::std::os::raw::c_int,
            __buf: *mut ::std::os::raw::c_void,
            __n: usize,
            __flags: ::std::os::raw::c_int,
            __addr: *mut sockaddr,
            __addr_len: *mut socklen_t,
        ) -> isize;
    }
    extern "C" {
        pub fn sendmsg(
            __fd: ::std::os::raw::c_int,
            __message: *const msghdr,
            __flags: ::std::os::raw::c_int,
        ) -> isize;
    }
    extern "C" {
        pub fn recvmsg(
            __fd: ::std::os::raw::c_int,
            __message: *mut msghdr,
            __flags: ::std::os::raw::c_int,
        ) -> isize;
    }
    extern "C" {
        pub fn getsockopt(
            __fd: ::std::os::raw::c_int,
            __level: ::std::os::raw::c_int,
            __optname: ::std::os::raw::c_int,
            __optval: *mut ::std::os::raw::c_void,
            __optlen: *mut socklen_t,
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn setsockopt(
            __fd: ::std::os::raw::c_int,
            __level: ::std::os::raw::c_int,
            __optname: ::std::os::raw::c_int,
            __optval: *const ::std::os::raw::c_void,
            __optlen: socklen_t,
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn listen(
            __fd: ::std::os::raw::c_int,
            __n: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn accept(
            __fd: ::std::os::raw::c_int,
            __addr: *mut sockaddr,
            __addr_len: *mut socklen_t,
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn shutdown(
            __fd: ::std::os::raw::c_int,
            __how: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int;
    }
    pub type in_addr_t = u32;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct in_addr {
        pub s_addr: in_addr_t,
    }
    #[test]
    fn bindgen_test_layout_in_addr() {
        assert_eq!(
            ::std::mem::size_of::<in_addr>(),
            4usize,
            concat!("Size of: ", stringify!(in_addr))
        );
        assert_eq!(
            ::std::mem::align_of::<in_addr>(),
            4usize,
            concat!("Alignment of ", stringify!(in_addr))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<in_addr>())).s_addr as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(in_addr),
                "::",
                stringify!(s_addr)
            )
        );
    }
    pub const IPPROTO_IP: _bindgen_ty_4 = _bindgen_ty_4::IPPROTO_IP;
    pub const IPPROTO_ICMP: _bindgen_ty_4 = _bindgen_ty_4::IPPROTO_ICMP;
    pub const IPPROTO_IGMP: _bindgen_ty_4 = _bindgen_ty_4::IPPROTO_IGMP;
    pub const IPPROTO_IPIP: _bindgen_ty_4 = _bindgen_ty_4::IPPROTO_IPIP;
    pub const IPPROTO_TCP: _bindgen_ty_4 = _bindgen_ty_4::IPPROTO_TCP;
    pub const IPPROTO_EGP: _bindgen_ty_4 = _bindgen_ty_4::IPPROTO_EGP;
    pub const IPPROTO_PUP: _bindgen_ty_4 = _bindgen_ty_4::IPPROTO_PUP;
    pub const IPPROTO_UDP: _bindgen_ty_4 = _bindgen_ty_4::IPPROTO_UDP;
    pub const IPPROTO_IDP: _bindgen_ty_4 = _bindgen_ty_4::IPPROTO_IDP;
    pub const IPPROTO_TP: _bindgen_ty_4 = _bindgen_ty_4::IPPROTO_TP;
    pub const IPPROTO_DCCP: _bindgen_ty_4 = _bindgen_ty_4::IPPROTO_DCCP;
    pub const IPPROTO_IPV6: _bindgen_ty_4 = _bindgen_ty_4::IPPROTO_IPV6;
    pub const IPPROTO_RSVP: _bindgen_ty_4 = _bindgen_ty_4::IPPROTO_RSVP;
    pub const IPPROTO_GRE: _bindgen_ty_4 = _bindgen_ty_4::IPPROTO_GRE;
    pub const IPPROTO_ESP: _bindgen_ty_4 = _bindgen_ty_4::IPPROTO_ESP;
    pub const IPPROTO_AH: _bindgen_ty_4 = _bindgen_ty_4::IPPROTO_AH;
    pub const IPPROTO_MTP: _bindgen_ty_4 = _bindgen_ty_4::IPPROTO_MTP;
    pub const IPPROTO_BEETPH: _bindgen_ty_4 = _bindgen_ty_4::IPPROTO_BEETPH;
    pub const IPPROTO_ENCAP: _bindgen_ty_4 = _bindgen_ty_4::IPPROTO_ENCAP;
    pub const IPPROTO_PIM: _bindgen_ty_4 = _bindgen_ty_4::IPPROTO_PIM;
    pub const IPPROTO_COMP: _bindgen_ty_4 = _bindgen_ty_4::IPPROTO_COMP;
    pub const IPPROTO_SCTP: _bindgen_ty_4 = _bindgen_ty_4::IPPROTO_SCTP;
    pub const IPPROTO_UDPLITE: _bindgen_ty_4 = _bindgen_ty_4::IPPROTO_UDPLITE;
    pub const IPPROTO_MPLS: _bindgen_ty_4 = _bindgen_ty_4::IPPROTO_MPLS;
    pub const IPPROTO_RAW: _bindgen_ty_4 = _bindgen_ty_4::IPPROTO_RAW;
    pub const IPPROTO_MAX: _bindgen_ty_4 = _bindgen_ty_4::IPPROTO_MAX;
    #[repr(u32)]
    #[derive(Debug, Copy, Clone, PartialEq, Eq, Hash, PartialOrd, Ord)]
    pub enum _bindgen_ty_4 {
        IPPROTO_IP = 0,
        IPPROTO_ICMP = 1,
        IPPROTO_IGMP = 2,
        IPPROTO_IPIP = 4,
        IPPROTO_TCP = 6,
        IPPROTO_EGP = 8,
        IPPROTO_PUP = 12,
        IPPROTO_UDP = 17,
        IPPROTO_IDP = 22,
        IPPROTO_TP = 29,
        IPPROTO_DCCP = 33,
        IPPROTO_IPV6 = 41,
        IPPROTO_RSVP = 46,
        IPPROTO_GRE = 47,
        IPPROTO_ESP = 50,
        IPPROTO_AH = 51,
        IPPROTO_MTP = 92,
        IPPROTO_BEETPH = 94,
        IPPROTO_ENCAP = 98,
        IPPROTO_PIM = 103,
        IPPROTO_COMP = 108,
        IPPROTO_SCTP = 132,
        IPPROTO_UDPLITE = 136,
        IPPROTO_MPLS = 137,
        IPPROTO_RAW = 255,
        IPPROTO_MAX = 256,
    }
    pub const IPPROTO_HOPOPTS: _bindgen_ty_5 = _bindgen_ty_5::IPPROTO_HOPOPTS;
    pub const IPPROTO_ROUTING: _bindgen_ty_5 = _bindgen_ty_5::IPPROTO_ROUTING;
    pub const IPPROTO_FRAGMENT: _bindgen_ty_5 = _bindgen_ty_5::IPPROTO_FRAGMENT;
    pub const IPPROTO_ICMPV6: _bindgen_ty_5 = _bindgen_ty_5::IPPROTO_ICMPV6;
    pub const IPPROTO_NONE: _bindgen_ty_5 = _bindgen_ty_5::IPPROTO_NONE;
    pub const IPPROTO_DSTOPTS: _bindgen_ty_5 = _bindgen_ty_5::IPPROTO_DSTOPTS;
    pub const IPPROTO_MH: _bindgen_ty_5 = _bindgen_ty_5::IPPROTO_MH;
    #[repr(u32)]
    #[derive(Debug, Copy, Clone, PartialEq, Eq, Hash, PartialOrd, Ord)]
    pub enum _bindgen_ty_5 {
        IPPROTO_HOPOPTS = 0,
        IPPROTO_ROUTING = 43,
        IPPROTO_FRAGMENT = 44,
        IPPROTO_ICMPV6 = 58,
        IPPROTO_NONE = 59,
        IPPROTO_DSTOPTS = 60,
        IPPROTO_MH = 135,
    }
    pub type in_port_t = u16;
    pub const IPPORT_ECHO: _bindgen_ty_6 = _bindgen_ty_6::IPPORT_ECHO;
    pub const IPPORT_DISCARD: _bindgen_ty_6 = _bindgen_ty_6::IPPORT_DISCARD;
    pub const IPPORT_SYSTAT: _bindgen_ty_6 = _bindgen_ty_6::IPPORT_SYSTAT;
    pub const IPPORT_DAYTIME: _bindgen_ty_6 = _bindgen_ty_6::IPPORT_DAYTIME;
    pub const IPPORT_NETSTAT: _bindgen_ty_6 = _bindgen_ty_6::IPPORT_NETSTAT;
    pub const IPPORT_FTP: _bindgen_ty_6 = _bindgen_ty_6::IPPORT_FTP;
    pub const IPPORT_TELNET: _bindgen_ty_6 = _bindgen_ty_6::IPPORT_TELNET;
    pub const IPPORT_SMTP: _bindgen_ty_6 = _bindgen_ty_6::IPPORT_SMTP;
    pub const IPPORT_TIMESERVER: _bindgen_ty_6 = _bindgen_ty_6::IPPORT_TIMESERVER;
    pub const IPPORT_NAMESERVER: _bindgen_ty_6 = _bindgen_ty_6::IPPORT_NAMESERVER;
    pub const IPPORT_WHOIS: _bindgen_ty_6 = _bindgen_ty_6::IPPORT_WHOIS;
    pub const IPPORT_MTP: _bindgen_ty_6 = _bindgen_ty_6::IPPORT_MTP;
    pub const IPPORT_TFTP: _bindgen_ty_6 = _bindgen_ty_6::IPPORT_TFTP;
    pub const IPPORT_RJE: _bindgen_ty_6 = _bindgen_ty_6::IPPORT_RJE;
    pub const IPPORT_FINGER: _bindgen_ty_6 = _bindgen_ty_6::IPPORT_FINGER;
    pub const IPPORT_TTYLINK: _bindgen_ty_6 = _bindgen_ty_6::IPPORT_TTYLINK;
    pub const IPPORT_SUPDUP: _bindgen_ty_6 = _bindgen_ty_6::IPPORT_SUPDUP;
    pub const IPPORT_EXECSERVER: _bindgen_ty_6 = _bindgen_ty_6::IPPORT_EXECSERVER;
    pub const IPPORT_LOGINSERVER: _bindgen_ty_6 = _bindgen_ty_6::IPPORT_LOGINSERVER;
    pub const IPPORT_CMDSERVER: _bindgen_ty_6 = _bindgen_ty_6::IPPORT_CMDSERVER;
    pub const IPPORT_EFSSERVER: _bindgen_ty_6 = _bindgen_ty_6::IPPORT_EFSSERVER;
    pub const IPPORT_BIFFUDP: _bindgen_ty_6 = _bindgen_ty_6::IPPORT_EXECSERVER;
    pub const IPPORT_WHOSERVER: _bindgen_ty_6 = _bindgen_ty_6::IPPORT_LOGINSERVER;
    pub const IPPORT_ROUTESERVER: _bindgen_ty_6 = _bindgen_ty_6::IPPORT_EFSSERVER;
    pub const IPPORT_RESERVED: _bindgen_ty_6 = _bindgen_ty_6::IPPORT_RESERVED;
    pub const IPPORT_USERRESERVED: _bindgen_ty_6 = _bindgen_ty_6::IPPORT_USERRESERVED;
    #[repr(u32)]
    #[derive(Debug, Copy, Clone, PartialEq, Eq, Hash, PartialOrd, Ord)]
    pub enum _bindgen_ty_6 {
        IPPORT_ECHO = 7,
        IPPORT_DISCARD = 9,
        IPPORT_SYSTAT = 11,
        IPPORT_DAYTIME = 13,
        IPPORT_NETSTAT = 15,
        IPPORT_FTP = 21,
        IPPORT_TELNET = 23,
        IPPORT_SMTP = 25,
        IPPORT_TIMESERVER = 37,
        IPPORT_NAMESERVER = 42,
        IPPORT_WHOIS = 43,
        IPPORT_MTP = 57,
        IPPORT_TFTP = 69,
        IPPORT_RJE = 77,
        IPPORT_FINGER = 79,
        IPPORT_TTYLINK = 87,
        IPPORT_SUPDUP = 95,
        IPPORT_EXECSERVER = 512,
        IPPORT_LOGINSERVER = 513,
        IPPORT_CMDSERVER = 514,
        IPPORT_EFSSERVER = 520,
        IPPORT_RESERVED = 1024,
        IPPORT_USERRESERVED = 5000,
    }
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub struct in6_addr {
        pub __in6_u: in6_addr__bindgen_ty_1,
    }
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub union in6_addr__bindgen_ty_1 {
        pub __u6_addr8: [u8; 16usize],
        pub __u6_addr16: [u16; 8usize],
        pub __u6_addr32: [u32; 4usize],
        _bindgen_union_align: [u32; 4usize],
    }
    #[test]
    fn bindgen_test_layout_in6_addr__bindgen_ty_1() {
        assert_eq!(
            ::std::mem::size_of::<in6_addr__bindgen_ty_1>(),
            16usize,
            concat!("Size of: ", stringify!(in6_addr__bindgen_ty_1))
        );
        assert_eq!(
            ::std::mem::align_of::<in6_addr__bindgen_ty_1>(),
            4usize,
            concat!("Alignment of ", stringify!(in6_addr__bindgen_ty_1))
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<in6_addr__bindgen_ty_1>())).__u6_addr8 as *const _ as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(in6_addr__bindgen_ty_1),
                "::",
                stringify!(__u6_addr8)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<in6_addr__bindgen_ty_1>())).__u6_addr16 as *const _ as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(in6_addr__bindgen_ty_1),
                "::",
                stringify!(__u6_addr16)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<in6_addr__bindgen_ty_1>())).__u6_addr32 as *const _ as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(in6_addr__bindgen_ty_1),
                "::",
                stringify!(__u6_addr32)
            )
        );
    }
    impl Default for in6_addr__bindgen_ty_1 {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    impl ::std::fmt::Debug for in6_addr__bindgen_ty_1 {
        fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
            write!(f, "in6_addr__bindgen_ty_1 {{ union }}")
        }
    }
    #[test]
    fn bindgen_test_layout_in6_addr() {
        assert_eq!(
            ::std::mem::size_of::<in6_addr>(),
            16usize,
            concat!("Size of: ", stringify!(in6_addr))
        );
        assert_eq!(
            ::std::mem::align_of::<in6_addr>(),
            4usize,
            concat!("Alignment of ", stringify!(in6_addr))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<in6_addr>())).__in6_u as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(in6_addr),
                "::",
                stringify!(__in6_u)
            )
        );
    }
    impl Default for in6_addr {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    impl ::std::fmt::Debug for in6_addr {
        fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
            write!(f, "in6_addr {{ __in6_u: {:?} }}", self.__in6_u)
        }
    }
    extern "C" {
        pub static in6addr_any: in6_addr;
    }
    extern "C" {
        pub static in6addr_loopback: in6_addr;
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct sockaddr_in {
        pub sin_family: sa_family_t,
        pub sin_port: in_port_t,
        pub sin_addr: in_addr,
        pub sin_zero: [::std::os::raw::c_uchar; 8usize],
    }
    #[test]
    fn bindgen_test_layout_sockaddr_in() {
        assert_eq!(
            ::std::mem::size_of::<sockaddr_in>(),
            16usize,
            concat!("Size of: ", stringify!(sockaddr_in))
        );
        assert_eq!(
            ::std::mem::align_of::<sockaddr_in>(),
            4usize,
            concat!("Alignment of ", stringify!(sockaddr_in))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<sockaddr_in>())).sin_family as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(sockaddr_in),
                "::",
                stringify!(sin_family)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<sockaddr_in>())).sin_port as *const _ as usize },
            2usize,
            concat!(
                "Offset of field: ",
                stringify!(sockaddr_in),
                "::",
                stringify!(sin_port)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<sockaddr_in>())).sin_addr as *const _ as usize },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(sockaddr_in),
                "::",
                stringify!(sin_addr)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<sockaddr_in>())).sin_zero as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(sockaddr_in),
                "::",
                stringify!(sin_zero)
            )
        );
    }
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub struct sockaddr_in6 {
        pub sin6_family: sa_family_t,
        pub sin6_port: in_port_t,
        pub sin6_flowinfo: u32,
        pub sin6_addr: in6_addr,
        pub sin6_scope_id: u32,
    }
    #[test]
    fn bindgen_test_layout_sockaddr_in6() {
        assert_eq!(
            ::std::mem::size_of::<sockaddr_in6>(),
            28usize,
            concat!("Size of: ", stringify!(sockaddr_in6))
        );
        assert_eq!(
            ::std::mem::align_of::<sockaddr_in6>(),
            4usize,
            concat!("Alignment of ", stringify!(sockaddr_in6))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<sockaddr_in6>())).sin6_family as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(sockaddr_in6),
                "::",
                stringify!(sin6_family)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<sockaddr_in6>())).sin6_port as *const _ as usize },
            2usize,
            concat!(
                "Offset of field: ",
                stringify!(sockaddr_in6),
                "::",
                stringify!(sin6_port)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<sockaddr_in6>())).sin6_flowinfo as *const _ as usize },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(sockaddr_in6),
                "::",
                stringify!(sin6_flowinfo)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<sockaddr_in6>())).sin6_addr as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(sockaddr_in6),
                "::",
                stringify!(sin6_addr)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<sockaddr_in6>())).sin6_scope_id as *const _ as usize },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(sockaddr_in6),
                "::",
                stringify!(sin6_scope_id)
            )
        );
    }
    impl Default for sockaddr_in6 {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    impl ::std::fmt::Debug for sockaddr_in6 {
        fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
            write ! ( f , "sockaddr_in6 {{ sin6_family: {:?}, sin6_port: {:?}, sin6_flowinfo: {:?}, sin6_addr: {:?}, sin6_scope_id: {:?} }}" , self . sin6_family , self . sin6_port , self . sin6_flowinfo , self . sin6_addr , self . sin6_scope_id )
        }
    }
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub struct ipv6_mreq {
        pub ipv6mr_multiaddr: in6_addr,
        pub ipv6mr_interface: ::std::os::raw::c_uint,
    }
    #[test]
    fn bindgen_test_layout_ipv6_mreq() {
        assert_eq!(
            ::std::mem::size_of::<ipv6_mreq>(),
            20usize,
            concat!("Size of: ", stringify!(ipv6_mreq))
        );
        assert_eq!(
            ::std::mem::align_of::<ipv6_mreq>(),
            4usize,
            concat!("Alignment of ", stringify!(ipv6_mreq))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<ipv6_mreq>())).ipv6mr_multiaddr as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ipv6_mreq),
                "::",
                stringify!(ipv6mr_multiaddr)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<ipv6_mreq>())).ipv6mr_interface as *const _ as usize },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(ipv6_mreq),
                "::",
                stringify!(ipv6mr_interface)
            )
        );
    }
    impl Default for ipv6_mreq {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    impl ::std::fmt::Debug for ipv6_mreq {
        fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
            write!(
                f,
                "ipv6_mreq {{ ipv6mr_multiaddr: {:?}, ipv6mr_interface: {:?} }}",
                self.ipv6mr_multiaddr, self.ipv6mr_interface
            )
        }
    }
    extern "C" {
        pub fn ntohl(__netlong: u32) -> u32;
    }
    extern "C" {
        pub fn ntohs(__netshort: u16) -> u16;
    }
    extern "C" {
        pub fn htonl(__hostlong: u32) -> u32;
    }
    extern "C" {
        pub fn htons(__hostshort: u16) -> u16;
    }
    pub type wchar_t = ::std::os::raw::c_int;
    pub type _Float32 = f32;
    pub type _Float64 = f64;
    pub type _Float32x = f64;
    pub type _Float64x = u128;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct div_t {
        pub quot: ::std::os::raw::c_int,
        pub rem: ::std::os::raw::c_int,
    }
    #[test]
    fn bindgen_test_layout_div_t() {
        assert_eq!(
            ::std::mem::size_of::<div_t>(),
            8usize,
            concat!("Size of: ", stringify!(div_t))
        );
        assert_eq!(
            ::std::mem::align_of::<div_t>(),
            4usize,
            concat!("Alignment of ", stringify!(div_t))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<div_t>())).quot as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(div_t),
                "::",
                stringify!(quot)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<div_t>())).rem as *const _ as usize },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(div_t),
                "::",
                stringify!(rem)
            )
        );
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct ldiv_t {
        pub quot: ::std::os::raw::c_long,
        pub rem: ::std::os::raw::c_long,
    }
    #[test]
    fn bindgen_test_layout_ldiv_t() {
        assert_eq!(
            ::std::mem::size_of::<ldiv_t>(),
            16usize,
            concat!("Size of: ", stringify!(ldiv_t))
        );
        assert_eq!(
            ::std::mem::align_of::<ldiv_t>(),
            8usize,
            concat!("Alignment of ", stringify!(ldiv_t))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<ldiv_t>())).quot as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ldiv_t),
                "::",
                stringify!(quot)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<ldiv_t>())).rem as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ldiv_t),
                "::",
                stringify!(rem)
            )
        );
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct lldiv_t {
        pub quot: ::std::os::raw::c_longlong,
        pub rem: ::std::os::raw::c_longlong,
    }
    #[test]
    fn bindgen_test_layout_lldiv_t() {
        assert_eq!(
            ::std::mem::size_of::<lldiv_t>(),
            16usize,
            concat!("Size of: ", stringify!(lldiv_t))
        );
        assert_eq!(
            ::std::mem::align_of::<lldiv_t>(),
            8usize,
            concat!("Alignment of ", stringify!(lldiv_t))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<lldiv_t>())).quot as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(lldiv_t),
                "::",
                stringify!(quot)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<lldiv_t>())).rem as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(lldiv_t),
                "::",
                stringify!(rem)
            )
        );
    }
    extern "C" {
        pub fn __ctype_get_mb_cur_max() -> usize;
    }
    extern "C" {
        pub fn atof(__nptr: *const ::std::os::raw::c_char) -> f64;
    }
    extern "C" {
        pub fn atoi(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn atol(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_long;
    }
    extern "C" {
        pub fn atoll(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_longlong;
    }
    extern "C" {
        pub fn strtod(
            __nptr: *const ::std::os::raw::c_char,
            __endptr: *mut *mut ::std::os::raw::c_char,
        ) -> f64;
    }
    extern "C" {
        pub fn strtof(
            __nptr: *const ::std::os::raw::c_char,
            __endptr: *mut *mut ::std::os::raw::c_char,
        ) -> f32;
    }
    extern "C" {
        pub fn strtold(
            __nptr: *const ::std::os::raw::c_char,
            __endptr: *mut *mut ::std::os::raw::c_char,
        ) -> u128;
    }
    extern "C" {
        pub fn strtol(
            __nptr: *const ::std::os::raw::c_char,
            __endptr: *mut *mut ::std::os::raw::c_char,
            __base: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_long;
    }
    extern "C" {
        pub fn strtoul(
            __nptr: *const ::std::os::raw::c_char,
            __endptr: *mut *mut ::std::os::raw::c_char,
            __base: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_ulong;
    }
    extern "C" {
        pub fn strtoll(
            __nptr: *const ::std::os::raw::c_char,
            __endptr: *mut *mut ::std::os::raw::c_char,
            __base: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_longlong;
    }
    extern "C" {
        pub fn strtoull(
            __nptr: *const ::std::os::raw::c_char,
            __endptr: *mut *mut ::std::os::raw::c_char,
            __base: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_ulonglong;
    }
    extern "C" {
        pub fn rand() -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn srand(__seed: ::std::os::raw::c_uint);
    }
    extern "C" {
        pub fn malloc(__size: ::std::os::raw::c_ulong) -> *mut ::std::os::raw::c_void;
    }
    extern "C" {
        pub fn calloc(
            __nmemb: ::std::os::raw::c_ulong,
            __size: ::std::os::raw::c_ulong,
        ) -> *mut ::std::os::raw::c_void;
    }
    extern "C" {
        pub fn realloc(
            __ptr: *mut ::std::os::raw::c_void,
            __size: ::std::os::raw::c_ulong,
        ) -> *mut ::std::os::raw::c_void;
    }
    extern "C" {
        pub fn free(__ptr: *mut ::std::os::raw::c_void);
    }
    extern "C" {
        pub fn aligned_alloc(__alignment: usize, __size: usize) -> *mut ::std::os::raw::c_void;
    }
    extern "C" {
        pub fn abort();
    }
    extern "C" {
        pub fn atexit(
            __func: ::std::option::Option<unsafe extern "C" fn()>,
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn at_quick_exit(
            __func: ::std::option::Option<unsafe extern "C" fn()>,
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn exit(__status: ::std::os::raw::c_int);
    }
    extern "C" {
        pub fn quick_exit(__status: ::std::os::raw::c_int);
    }
    extern "C" {
        pub fn _Exit(__status: ::std::os::raw::c_int);
    }
    extern "C" {
        pub fn getenv(__name: *const ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
    }
    extern "C" {
        pub fn system(__command: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
    }
    pub type __compar_fn_t = ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *const ::std::os::raw::c_void,
            arg2: *const ::std::os::raw::c_void,
        ) -> ::std::os::raw::c_int,
    >;
    extern "C" {
        pub fn bsearch(
            __key: *const ::std::os::raw::c_void,
            __base: *const ::std::os::raw::c_void,
            __nmemb: usize,
            __size: usize,
            __compar: __compar_fn_t,
        ) -> *mut ::std::os::raw::c_void;
    }
    extern "C" {
        pub fn qsort(
            __base: *mut ::std::os::raw::c_void,
            __nmemb: usize,
            __size: usize,
            __compar: __compar_fn_t,
        );
    }
    extern "C" {
        pub fn abs(__x: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn labs(__x: ::std::os::raw::c_long) -> ::std::os::raw::c_long;
    }
    extern "C" {
        pub fn llabs(__x: ::std::os::raw::c_longlong) -> ::std::os::raw::c_longlong;
    }
    extern "C" {
        pub fn div(__numer: ::std::os::raw::c_int, __denom: ::std::os::raw::c_int) -> div_t;
    }
    extern "C" {
        pub fn ldiv(__numer: ::std::os::raw::c_long, __denom: ::std::os::raw::c_long) -> ldiv_t;
    }
    extern "C" {
        pub fn lldiv(
            __numer: ::std::os::raw::c_longlong,
            __denom: ::std::os::raw::c_longlong,
        ) -> lldiv_t;
    }
    extern "C" {
        pub fn mblen(__s: *const ::std::os::raw::c_char, __n: usize) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn mbtowc(
            __pwc: *mut wchar_t,
            __s: *const ::std::os::raw::c_char,
            __n: usize,
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn wctomb(__s: *mut ::std::os::raw::c_char, __wchar: wchar_t) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn mbstowcs(
            __pwcs: *mut wchar_t,
            __s: *const ::std::os::raw::c_char,
            __n: usize,
        ) -> usize;
    }
    extern "C" {
        pub fn wcstombs(
            __s: *mut ::std::os::raw::c_char,
            __pwcs: *const wchar_t,
            __n: usize,
        ) -> usize;
    }
    extern "C" {
        pub fn memcpy(
            __dest: *mut ::std::os::raw::c_void,
            __src: *const ::std::os::raw::c_void,
            __n: ::std::os::raw::c_ulong,
        ) -> *mut ::std::os::raw::c_void;
    }
    extern "C" {
        pub fn memmove(
            __dest: *mut ::std::os::raw::c_void,
            __src: *const ::std::os::raw::c_void,
            __n: ::std::os::raw::c_ulong,
        ) -> *mut ::std::os::raw::c_void;
    }
    extern "C" {
        pub fn memset(
            __s: *mut ::std::os::raw::c_void,
            __c: ::std::os::raw::c_int,
            __n: ::std::os::raw::c_ulong,
        ) -> *mut ::std::os::raw::c_void;
    }
    extern "C" {
        pub fn memcmp(
            __s1: *const ::std::os::raw::c_void,
            __s2: *const ::std::os::raw::c_void,
            __n: ::std::os::raw::c_ulong,
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn memchr(
            __s: *const ::std::os::raw::c_void,
            __c: ::std::os::raw::c_int,
            __n: ::std::os::raw::c_ulong,
        ) -> *mut ::std::os::raw::c_void;
    }
    extern "C" {
        pub fn strcpy(
            __dest: *mut ::std::os::raw::c_char,
            __src: *const ::std::os::raw::c_char,
        ) -> *mut ::std::os::raw::c_char;
    }
    extern "C" {
        pub fn strncpy(
            __dest: *mut ::std::os::raw::c_char,
            __src: *const ::std::os::raw::c_char,
            __n: ::std::os::raw::c_ulong,
        ) -> *mut ::std::os::raw::c_char;
    }
    extern "C" {
        pub fn strcat(
            __dest: *mut ::std::os::raw::c_char,
            __src: *const ::std::os::raw::c_char,
        ) -> *mut ::std::os::raw::c_char;
    }
    extern "C" {
        pub fn strncat(
            __dest: *mut ::std::os::raw::c_char,
            __src: *const ::std::os::raw::c_char,
            __n: ::std::os::raw::c_ulong,
        ) -> *mut ::std::os::raw::c_char;
    }
    extern "C" {
        pub fn strcmp(
            __s1: *const ::std::os::raw::c_char,
            __s2: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn strncmp(
            __s1: *const ::std::os::raw::c_char,
            __s2: *const ::std::os::raw::c_char,
            __n: ::std::os::raw::c_ulong,
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn strcoll(
            __s1: *const ::std::os::raw::c_char,
            __s2: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn strxfrm(
            __dest: *mut ::std::os::raw::c_char,
            __src: *const ::std::os::raw::c_char,
            __n: ::std::os::raw::c_ulong,
        ) -> ::std::os::raw::c_ulong;
    }
    extern "C" {
        pub fn strchr(
            __s: *const ::std::os::raw::c_char,
            __c: ::std::os::raw::c_int,
        ) -> *mut ::std::os::raw::c_char;
    }
    extern "C" {
        pub fn strrchr(
            __s: *const ::std::os::raw::c_char,
            __c: ::std::os::raw::c_int,
        ) -> *mut ::std::os::raw::c_char;
    }
    extern "C" {
        pub fn strcspn(
            __s: *const ::std::os::raw::c_char,
            __reject: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_ulong;
    }
    extern "C" {
        pub fn strspn(
            __s: *const ::std::os::raw::c_char,
            __accept: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_ulong;
    }
    extern "C" {
        pub fn strpbrk(
            __s: *const ::std::os::raw::c_char,
            __accept: *const ::std::os::raw::c_char,
        ) -> *mut ::std::os::raw::c_char;
    }
    extern "C" {
        pub fn strstr(
            __haystack: *const ::std::os::raw::c_char,
            __needle: *const ::std::os::raw::c_char,
        ) -> *mut ::std::os::raw::c_char;
    }
    extern "C" {
        pub fn strtok(
            __s: *mut ::std::os::raw::c_char,
            __delim: *const ::std::os::raw::c_char,
        ) -> *mut ::std::os::raw::c_char;
    }
    extern "C" {
        pub fn __strtok_r(
            __s: *mut ::std::os::raw::c_char,
            __delim: *const ::std::os::raw::c_char,
            __save_ptr: *mut *mut ::std::os::raw::c_char,
        ) -> *mut ::std::os::raw::c_char;
    }
    extern "C" {
        pub fn strlen(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_ulong;
    }
    extern "C" {
        pub fn strerror(__errnum: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
    }
    extern "C" {
        pub fn __assert_fail(
            __assertion: *const ::std::os::raw::c_char,
            __file: *const ::std::os::raw::c_char,
            __line: ::std::os::raw::c_uint,
            __function: *const ::std::os::raw::c_char,
        );
    }
    extern "C" {
        pub fn __assert_perror_fail(
            __errnum: ::std::os::raw::c_int,
            __file: *const ::std::os::raw::c_char,
            __line: ::std::os::raw::c_uint,
            __function: *const ::std::os::raw::c_char,
        );
    }
    extern "C" {
        pub fn __assert(
            __assertion: *const ::std::os::raw::c_char,
            __file: *const ::std::os::raw::c_char,
            __line: ::std::os::raw::c_int,
        );
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, PartialOrd, PartialEq)]
    pub struct t_CKCOMPLEX {
        pub re: f64,
        pub im: f64,
    }
    #[test]
    fn bindgen_test_layout_t_CKCOMPLEX() {
        assert_eq!(
            ::std::mem::size_of::<t_CKCOMPLEX>(),
            16usize,
            concat!("Size of: ", stringify!(t_CKCOMPLEX))
        );
        assert_eq!(
            ::std::mem::align_of::<t_CKCOMPLEX>(),
            8usize,
            concat!("Alignment of ", stringify!(t_CKCOMPLEX))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<t_CKCOMPLEX>())).re as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(t_CKCOMPLEX),
                "::",
                stringify!(re)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<t_CKCOMPLEX>())).im as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(t_CKCOMPLEX),
                "::",
                stringify!(im)
            )
        );
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, PartialOrd, PartialEq)]
    pub struct t_CKPOLAR {
        pub modulus: f64,
        pub phase: f64,
    }
    #[test]
    fn bindgen_test_layout_t_CKPOLAR() {
        assert_eq!(
            ::std::mem::size_of::<t_CKPOLAR>(),
            16usize,
            concat!("Size of: ", stringify!(t_CKPOLAR))
        );
        assert_eq!(
            ::std::mem::align_of::<t_CKPOLAR>(),
            8usize,
            concat!("Alignment of ", stringify!(t_CKPOLAR))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<t_CKPOLAR>())).modulus as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(t_CKPOLAR),
                "::",
                stringify!(modulus)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<t_CKPOLAR>())).phase as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(t_CKPOLAR),
                "::",
                stringify!(phase)
            )
        );
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, PartialOrd, PartialEq)]
    pub struct t_CKVEC3 {
        pub x: f64,
        pub y: f64,
        pub z: f64,
    }
    #[test]
    fn bindgen_test_layout_t_CKVEC3() {
        assert_eq!(
            ::std::mem::size_of::<t_CKVEC3>(),
            24usize,
            concat!("Size of: ", stringify!(t_CKVEC3))
        );
        assert_eq!(
            ::std::mem::align_of::<t_CKVEC3>(),
            8usize,
            concat!("Alignment of ", stringify!(t_CKVEC3))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<t_CKVEC3>())).x as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(t_CKVEC3),
                "::",
                stringify!(x)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<t_CKVEC3>())).y as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(t_CKVEC3),
                "::",
                stringify!(y)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<t_CKVEC3>())).z as *const _ as usize },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(t_CKVEC3),
                "::",
                stringify!(z)
            )
        );
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, PartialOrd, PartialEq)]
    pub struct t_CKVEC4 {
        pub x: f64,
        pub y: f64,
        pub z: f64,
        pub w: f64,
    }
    #[test]
    fn bindgen_test_layout_t_CKVEC4() {
        assert_eq!(
            ::std::mem::size_of::<t_CKVEC4>(),
            32usize,
            concat!("Size of: ", stringify!(t_CKVEC4))
        );
        assert_eq!(
            ::std::mem::align_of::<t_CKVEC4>(),
            8usize,
            concat!("Alignment of ", stringify!(t_CKVEC4))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<t_CKVEC4>())).x as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(t_CKVEC4),
                "::",
                stringify!(x)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<t_CKVEC4>())).y as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(t_CKVEC4),
                "::",
                stringify!(y)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<t_CKVEC4>())).z as *const _ as usize },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(t_CKVEC4),
                "::",
                stringify!(z)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<t_CKVEC4>())).w as *const _ as usize },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(t_CKVEC4),
                "::",
                stringify!(w)
            )
        );
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct t_CKVECTOR {
        pub N: ::std::os::raw::c_ulong,
        pub values: *mut f64,
    }
    #[test]
    fn bindgen_test_layout_t_CKVECTOR() {
        assert_eq!(
            ::std::mem::size_of::<t_CKVECTOR>(),
            16usize,
            concat!("Size of: ", stringify!(t_CKVECTOR))
        );
        assert_eq!(
            ::std::mem::align_of::<t_CKVECTOR>(),
            8usize,
            concat!("Alignment of ", stringify!(t_CKVECTOR))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<t_CKVECTOR>())).N as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(t_CKVECTOR),
                "::",
                stringify!(N)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<t_CKVECTOR>())).values as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(t_CKVECTOR),
                "::",
                stringify!(values)
            )
        );
    }
    impl Default for t_CKVECTOR {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    pub type c_str = *mut ::std::os::raw::c_char;
    pub type c_constr = *const ::std::os::raw::c_char;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, PartialOrd, PartialEq)]
    pub struct t_CKCOMPLEX_SAMPLE {
        pub re: f64,
        pub im: f64,
    }
    #[test]
    fn bindgen_test_layout_t_CKCOMPLEX_SAMPLE() {
        assert_eq!(
            ::std::mem::size_of::<t_CKCOMPLEX_SAMPLE>(),
            16usize,
            concat!("Size of: ", stringify!(t_CKCOMPLEX_SAMPLE))
        );
        assert_eq!(
            ::std::mem::align_of::<t_CKCOMPLEX_SAMPLE>(),
            8usize,
            concat!("Alignment of ", stringify!(t_CKCOMPLEX_SAMPLE))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<t_CKCOMPLEX_SAMPLE>())).re as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(t_CKCOMPLEX_SAMPLE),
                "::",
                stringify!(re)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<t_CKCOMPLEX_SAMPLE>())).im as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(t_CKCOMPLEX_SAMPLE),
                "::",
                stringify!(im)
            )
        );
    }
    pub type ck_socket = *mut ck_socket_;
    extern "C" {
        pub fn ck_udp_create() -> ck_socket;
    }
    extern "C" {
        pub fn ck_tcp_create(flags: ::std::os::raw::c_int) -> ck_socket;
    }
    extern "C" {
        pub fn ck_connect(
            sock: ck_socket,
            hostname: *const ::std::os::raw::c_char,
            port: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_ulong;
    }
    extern "C" {
        pub fn ck_connect2(
            sock: ck_socket,
            serv_addr: *const sockaddr,
            addrlen: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_ulong;
    }
    extern "C" {
        pub fn ck_bind(sock: ck_socket, port: ::std::os::raw::c_int) -> ::std::os::raw::c_ulong;
    }
    extern "C" {
        pub fn ck_listen(
            sock: ck_socket,
            backlog: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_ulong;
    }
    extern "C" {
        pub fn ck_accept(sock: ck_socket) -> ck_socket;
    }
    extern "C" {
        pub fn ck_send(
            sock: ck_socket,
            buffer: *const ::std::os::raw::c_char,
            len: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn ck_send2(
            sock: ck_socket,
            buffer: *const ::std::os::raw::c_char,
            len: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn ck_sendto(
            sock: ck_socket,
            buffer: *const ::std::os::raw::c_char,
            len: ::std::os::raw::c_int,
            to: *const sockaddr,
            tolen: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn ck_recv(
            sock: ck_socket,
            buffer: *mut ::std::os::raw::c_char,
            len: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn ck_recv2(
            sock: ck_socket,
            buffer: *mut ::std::os::raw::c_char,
            len: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn ck_recvfrom(
            sock: ck_socket,
            buffer: *mut ::std::os::raw::c_char,
            len: ::std::os::raw::c_int,
            from: *mut sockaddr,
            fromlen: *mut ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn ck_send_timeout(
            sock: ck_socket,
            sec: ::std::os::raw::c_long,
            usec: ::std::os::raw::c_long,
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn ck_recv_timeout(
            sock: ck_socket,
            sec: ::std::os::raw::c_long,
            usec: ::std::os::raw::c_long,
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn ck_close(sock: ck_socket);
    }
    pub type U_boolList = *mut U_boolList_;
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct U_boolList_ {
        pub head: ::std::os::raw::c_ulong,
        pub tail: U_boolList,
    }
    #[test]
    fn bindgen_test_layout_U_boolList_() {
        assert_eq!(
            ::std::mem::size_of::<U_boolList_>(),
            16usize,
            concat!("Size of: ", stringify!(U_boolList_))
        );
        assert_eq!(
            ::std::mem::align_of::<U_boolList_>(),
            8usize,
            concat!("Alignment of ", stringify!(U_boolList_))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<U_boolList_>())).head as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(U_boolList_),
                "::",
                stringify!(head)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<U_boolList_>())).tail as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(U_boolList_),
                "::",
                stringify!(tail)
            )
        );
    }
    impl Default for U_boolList_ {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    extern "C" {
        pub fn checked_malloc(size: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_void;
    }
    extern "C" {
        pub fn cc_str(arg1: *mut ::std::os::raw::c_char) -> c_str;
    }
    extern "C" {
        pub fn U_BoolList(head: ::std::os::raw::c_ulong, tail: U_boolList) -> U_boolList;
    }
    pub type __gnuc_va_list = __builtin_va_list;
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub struct __mbstate_t {
        pub __count: ::std::os::raw::c_int,
        pub __value: __mbstate_t__bindgen_ty_1,
    }
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub union __mbstate_t__bindgen_ty_1 {
        pub __wch: ::std::os::raw::c_uint,
        pub __wchb: [::std::os::raw::c_char; 4usize],
        _bindgen_union_align: u32,
    }
    #[test]
    fn bindgen_test_layout___mbstate_t__bindgen_ty_1() {
        assert_eq!(
            ::std::mem::size_of::<__mbstate_t__bindgen_ty_1>(),
            4usize,
            concat!("Size of: ", stringify!(__mbstate_t__bindgen_ty_1))
        );
        assert_eq!(
            ::std::mem::align_of::<__mbstate_t__bindgen_ty_1>(),
            4usize,
            concat!("Alignment of ", stringify!(__mbstate_t__bindgen_ty_1))
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<__mbstate_t__bindgen_ty_1>())).__wch as *const _ as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__mbstate_t__bindgen_ty_1),
                "::",
                stringify!(__wch)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<__mbstate_t__bindgen_ty_1>())).__wchb as *const _ as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__mbstate_t__bindgen_ty_1),
                "::",
                stringify!(__wchb)
            )
        );
    }
    impl Default for __mbstate_t__bindgen_ty_1 {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    impl ::std::fmt::Debug for __mbstate_t__bindgen_ty_1 {
        fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
            write!(f, "__mbstate_t__bindgen_ty_1 {{ union }}")
        }
    }
    #[test]
    fn bindgen_test_layout___mbstate_t() {
        assert_eq!(
            ::std::mem::size_of::<__mbstate_t>(),
            8usize,
            concat!("Size of: ", stringify!(__mbstate_t))
        );
        assert_eq!(
            ::std::mem::align_of::<__mbstate_t>(),
            4usize,
            concat!("Alignment of ", stringify!(__mbstate_t))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<__mbstate_t>())).__count as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__mbstate_t),
                "::",
                stringify!(__count)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<__mbstate_t>())).__value as *const _ as usize },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(__mbstate_t),
                "::",
                stringify!(__value)
            )
        );
    }
    impl Default for __mbstate_t {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    impl ::std::fmt::Debug for __mbstate_t {
        fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
            write!(
                f,
                "__mbstate_t {{ __count: {:?}, __value: {:?} }}",
                self.__count, self.__value
            )
        }
    }
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub struct _G_fpos_t {
        pub __pos: __off_t,
        pub __state: __mbstate_t,
    }
    #[test]
    fn bindgen_test_layout__G_fpos_t() {
        assert_eq!(
            ::std::mem::size_of::<_G_fpos_t>(),
            16usize,
            concat!("Size of: ", stringify!(_G_fpos_t))
        );
        assert_eq!(
            ::std::mem::align_of::<_G_fpos_t>(),
            8usize,
            concat!("Alignment of ", stringify!(_G_fpos_t))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_G_fpos_t>())).__pos as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(_G_fpos_t),
                "::",
                stringify!(__pos)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_G_fpos_t>())).__state as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(_G_fpos_t),
                "::",
                stringify!(__state)
            )
        );
    }
    impl Default for _G_fpos_t {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    impl ::std::fmt::Debug for _G_fpos_t {
        fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
            write!(
                f,
                "_G_fpos_t {{ __pos: {:?}, __state: {:?} }}",
                self.__pos, self.__state
            )
        }
    }
    pub type __fpos_t = _G_fpos_t;
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub struct _G_fpos64_t {
        pub __pos: __off64_t,
        pub __state: __mbstate_t,
    }
    #[test]
    fn bindgen_test_layout__G_fpos64_t() {
        assert_eq!(
            ::std::mem::size_of::<_G_fpos64_t>(),
            16usize,
            concat!("Size of: ", stringify!(_G_fpos64_t))
        );
        assert_eq!(
            ::std::mem::align_of::<_G_fpos64_t>(),
            8usize,
            concat!("Alignment of ", stringify!(_G_fpos64_t))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_G_fpos64_t>())).__pos as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(_G_fpos64_t),
                "::",
                stringify!(__pos)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_G_fpos64_t>())).__state as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(_G_fpos64_t),
                "::",
                stringify!(__state)
            )
        );
    }
    impl Default for _G_fpos64_t {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    impl ::std::fmt::Debug for _G_fpos64_t {
        fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
            write!(
                f,
                "_G_fpos64_t {{ __pos: {:?}, __state: {:?} }}",
                self.__pos, self.__state
            )
        }
    }
    pub type __fpos64_t = _G_fpos64_t;
    pub type __FILE = _IO_FILE;
    pub type FILE = _IO_FILE;
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct _IO_marker {
        _unused: [u8; 0],
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct _IO_codecvt {
        _unused: [u8; 0],
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct _IO_wide_data {
        _unused: [u8; 0],
    }
    pub type _IO_lock_t = ::std::os::raw::c_void;
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct _IO_FILE {
        pub _flags: ::std::os::raw::c_int,
        pub _IO_read_ptr: *mut ::std::os::raw::c_char,
        pub _IO_read_end: *mut ::std::os::raw::c_char,
        pub _IO_read_base: *mut ::std::os::raw::c_char,
        pub _IO_write_base: *mut ::std::os::raw::c_char,
        pub _IO_write_ptr: *mut ::std::os::raw::c_char,
        pub _IO_write_end: *mut ::std::os::raw::c_char,
        pub _IO_buf_base: *mut ::std::os::raw::c_char,
        pub _IO_buf_end: *mut ::std::os::raw::c_char,
        pub _IO_save_base: *mut ::std::os::raw::c_char,
        pub _IO_backup_base: *mut ::std::os::raw::c_char,
        pub _IO_save_end: *mut ::std::os::raw::c_char,
        pub _markers: *mut _IO_marker,
        pub _chain: *mut _IO_FILE,
        pub _fileno: ::std::os::raw::c_int,
        pub _flags2: ::std::os::raw::c_int,
        pub _old_offset: __off_t,
        pub _cur_column: ::std::os::raw::c_ushort,
        pub _vtable_offset: ::std::os::raw::c_schar,
        pub _shortbuf: [::std::os::raw::c_char; 1usize],
        pub _lock: *mut _IO_lock_t,
        pub _offset: __off64_t,
        pub _codecvt: *mut _IO_codecvt,
        pub _wide_data: *mut _IO_wide_data,
        pub _freeres_list: *mut _IO_FILE,
        pub _freeres_buf: *mut ::std::os::raw::c_void,
        pub __pad5: usize,
        pub _mode: ::std::os::raw::c_int,
        pub _unused2: [::std::os::raw::c_char; 20usize],
    }
    #[test]
    fn bindgen_test_layout__IO_FILE() {
        assert_eq!(
            ::std::mem::size_of::<_IO_FILE>(),
            216usize,
            concat!("Size of: ", stringify!(_IO_FILE))
        );
        assert_eq!(
            ::std::mem::align_of::<_IO_FILE>(),
            8usize,
            concat!("Alignment of ", stringify!(_IO_FILE))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._flags as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_flags)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_read_ptr as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_read_ptr)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_read_end as *const _ as usize },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_read_end)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_read_base as *const _ as usize },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_read_base)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_write_base as *const _ as usize },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_write_base)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_write_ptr as *const _ as usize },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_write_ptr)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_write_end as *const _ as usize },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_write_end)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_buf_base as *const _ as usize },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_buf_base)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_buf_end as *const _ as usize },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_buf_end)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_save_base as *const _ as usize },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_save_base)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_backup_base as *const _ as usize },
            80usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_backup_base)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._IO_save_end as *const _ as usize },
            88usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_IO_save_end)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._markers as *const _ as usize },
            96usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_markers)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._chain as *const _ as usize },
            104usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_chain)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._fileno as *const _ as usize },
            112usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_fileno)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._flags2 as *const _ as usize },
            116usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_flags2)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._old_offset as *const _ as usize },
            120usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_old_offset)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._cur_column as *const _ as usize },
            128usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_cur_column)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._vtable_offset as *const _ as usize },
            130usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_vtable_offset)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._shortbuf as *const _ as usize },
            131usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_shortbuf)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._lock as *const _ as usize },
            136usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_lock)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._offset as *const _ as usize },
            144usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_offset)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._codecvt as *const _ as usize },
            152usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_codecvt)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._wide_data as *const _ as usize },
            160usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_wide_data)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._freeres_list as *const _ as usize },
            168usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_freeres_list)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._freeres_buf as *const _ as usize },
            176usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_freeres_buf)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>())).__pad5 as *const _ as usize },
            184usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(__pad5)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._mode as *const _ as usize },
            192usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_mode)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<_IO_FILE>()))._unused2 as *const _ as usize },
            196usize,
            concat!(
                "Offset of field: ",
                stringify!(_IO_FILE),
                "::",
                stringify!(_unused2)
            )
        );
    }
    impl Default for _IO_FILE {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    pub type fpos_t = __fpos_t;
    extern "C" {
        pub static mut stdin: *mut FILE;
    }
    extern "C" {
        pub static mut stdout: *mut FILE;
    }
    extern "C" {
        pub static mut stderr: *mut FILE;
    }
    extern "C" {
        pub fn remove(__filename: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn rename(
            __old: *const ::std::os::raw::c_char,
            __new: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn tmpfile() -> *mut FILE;
    }
    extern "C" {
        pub fn tmpnam(__s: *mut ::std::os::raw::c_char) -> *mut ::std::os::raw::c_char;
    }
    extern "C" {
        pub fn fclose(__stream: *mut FILE) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn fflush(__stream: *mut FILE) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn fopen(
            __filename: *const ::std::os::raw::c_char,
            __modes: *const ::std::os::raw::c_char,
        ) -> *mut FILE;
    }
    extern "C" {
        pub fn freopen(
            __filename: *const ::std::os::raw::c_char,
            __modes: *const ::std::os::raw::c_char,
            __stream: *mut FILE,
        ) -> *mut FILE;
    }
    extern "C" {
        pub fn setbuf(__stream: *mut FILE, __buf: *mut ::std::os::raw::c_char);
    }
    extern "C" {
        pub fn setvbuf(
            __stream: *mut FILE,
            __buf: *mut ::std::os::raw::c_char,
            __modes: ::std::os::raw::c_int,
            __n: usize,
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn fprintf(
            __stream: *mut FILE,
            __format: *const ::std::os::raw::c_char,
            ...
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn printf(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn sprintf(
            __s: *mut ::std::os::raw::c_char,
            __format: *const ::std::os::raw::c_char,
            ...
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn vfprintf(
            __s: *mut FILE,
            __format: *const ::std::os::raw::c_char,
            __arg: *mut __va_list_tag,
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn vprintf(
            __format: *const ::std::os::raw::c_char,
            __arg: *mut __va_list_tag,
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn vsprintf(
            __s: *mut ::std::os::raw::c_char,
            __format: *const ::std::os::raw::c_char,
            __arg: *mut __va_list_tag,
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn snprintf(
            __s: *mut ::std::os::raw::c_char,
            __maxlen: ::std::os::raw::c_ulong,
            __format: *const ::std::os::raw::c_char,
            ...
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn vsnprintf(
            __s: *mut ::std::os::raw::c_char,
            __maxlen: ::std::os::raw::c_ulong,
            __format: *const ::std::os::raw::c_char,
            __arg: *mut __va_list_tag,
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn fscanf(
            __stream: *mut FILE,
            __format: *const ::std::os::raw::c_char,
            ...
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn scanf(__format: *const ::std::os::raw::c_char, ...) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn sscanf(
            __s: *const ::std::os::raw::c_char,
            __format: *const ::std::os::raw::c_char,
            ...
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn vfscanf(
            __s: *mut FILE,
            __format: *const ::std::os::raw::c_char,
            __arg: *mut __va_list_tag,
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn vscanf(
            __format: *const ::std::os::raw::c_char,
            __arg: *mut __va_list_tag,
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn vsscanf(
            __s: *const ::std::os::raw::c_char,
            __format: *const ::std::os::raw::c_char,
            __arg: *mut __va_list_tag,
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn fgetc(__stream: *mut FILE) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn getc(__stream: *mut FILE) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn getchar() -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn fputc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn putc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn putchar(__c: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn fgets(
            __s: *mut ::std::os::raw::c_char,
            __n: ::std::os::raw::c_int,
            __stream: *mut FILE,
        ) -> *mut ::std::os::raw::c_char;
    }
    extern "C" {
        pub fn fputs(
            __s: *const ::std::os::raw::c_char,
            __stream: *mut FILE,
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn puts(__s: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn ungetc(__c: ::std::os::raw::c_int, __stream: *mut FILE) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn fread(
            __ptr: *mut ::std::os::raw::c_void,
            __size: ::std::os::raw::c_ulong,
            __n: ::std::os::raw::c_ulong,
            __stream: *mut FILE,
        ) -> ::std::os::raw::c_ulong;
    }
    extern "C" {
        pub fn fwrite(
            __ptr: *const ::std::os::raw::c_void,
            __size: ::std::os::raw::c_ulong,
            __n: ::std::os::raw::c_ulong,
            __s: *mut FILE,
        ) -> ::std::os::raw::c_ulong;
    }
    extern "C" {
        pub fn fseek(
            __stream: *mut FILE,
            __off: ::std::os::raw::c_long,
            __whence: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn ftell(__stream: *mut FILE) -> ::std::os::raw::c_long;
    }
    extern "C" {
        pub fn rewind(__stream: *mut FILE);
    }
    extern "C" {
        pub fn fgetpos(__stream: *mut FILE, __pos: *mut fpos_t) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn fsetpos(__stream: *mut FILE, __pos: *const fpos_t) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn clearerr(__stream: *mut FILE);
    }
    extern "C" {
        pub fn feof(__stream: *mut FILE) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn ferror(__stream: *mut FILE) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn perror(__s: *const ::std::os::raw::c_char);
    }
    extern "C" {
        pub fn __uflow(arg1: *mut FILE) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn __overflow(arg1: *mut FILE, arg2: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct timeval {
        pub tv_sec: __time_t,
        pub tv_usec: __suseconds_t,
    }
    #[test]
    fn bindgen_test_layout_timeval() {
        assert_eq!(
            ::std::mem::size_of::<timeval>(),
            16usize,
            concat!("Size of: ", stringify!(timeval))
        );
        assert_eq!(
            ::std::mem::align_of::<timeval>(),
            8usize,
            concat!("Alignment of ", stringify!(timeval))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<timeval>())).tv_sec as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(timeval),
                "::",
                stringify!(tv_sec)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<timeval>())).tv_usec as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(timeval),
                "::",
                stringify!(tv_usec)
            )
        );
    }
    pub type suseconds_t = __suseconds_t;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __sigset_t {
        pub __val: [::std::os::raw::c_ulong; 16usize],
    }
    #[test]
    fn bindgen_test_layout___sigset_t() {
        assert_eq!(
            ::std::mem::size_of::<__sigset_t>(),
            128usize,
            concat!("Size of: ", stringify!(__sigset_t))
        );
        assert_eq!(
            ::std::mem::align_of::<__sigset_t>(),
            8usize,
            concat!("Alignment of ", stringify!(__sigset_t))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<__sigset_t>())).__val as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__sigset_t),
                "::",
                stringify!(__val)
            )
        );
    }
    pub type sigset_t = __sigset_t;
    pub type __fd_mask = ::std::os::raw::c_long;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct fd_set {
        pub __fds_bits: [__fd_mask; 16usize],
    }
    #[test]
    fn bindgen_test_layout_fd_set() {
        assert_eq!(
            ::std::mem::size_of::<fd_set>(),
            128usize,
            concat!("Size of: ", stringify!(fd_set))
        );
        assert_eq!(
            ::std::mem::align_of::<fd_set>(),
            8usize,
            concat!("Alignment of ", stringify!(fd_set))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<fd_set>())).__fds_bits as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(fd_set),
                "::",
                stringify!(__fds_bits)
            )
        );
    }
    extern "C" {
        pub fn select(
            __nfds: ::std::os::raw::c_int,
            __readfds: *mut fd_set,
            __writefds: *mut fd_set,
            __exceptfds: *mut fd_set,
            __timeout: *mut timeval,
        ) -> ::std::os::raw::c_int;
    }
    pub type __timezone_ptr_t = *mut ::std::os::raw::c_void;
    extern "C" {
        pub fn gettimeofday(__tv: *mut timeval, __tz: __timezone_ptr_t) -> ::std::os::raw::c_int;
    }
    #[repr(u32)]
    #[derive(Debug, Copy, Clone, PartialEq, Eq, Hash, PartialOrd, Ord)]
    pub enum __itimer_which {
        ITIMER_REAL = 0,
        ITIMER_VIRTUAL = 1,
        ITIMER_PROF = 2,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct itimerval {
        pub it_interval: timeval,
        pub it_value: timeval,
    }
    #[test]
    fn bindgen_test_layout_itimerval() {
        assert_eq!(
            ::std::mem::size_of::<itimerval>(),
            32usize,
            concat!("Size of: ", stringify!(itimerval))
        );
        assert_eq!(
            ::std::mem::align_of::<itimerval>(),
            8usize,
            concat!("Alignment of ", stringify!(itimerval))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<itimerval>())).it_interval as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(itimerval),
                "::",
                stringify!(it_interval)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<itimerval>())).it_value as *const _ as usize },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(itimerval),
                "::",
                stringify!(it_value)
            )
        );
    }
    pub type __itimer_which_t = ::std::os::raw::c_int;
    extern "C" {
        pub fn getitimer(
            __which: __itimer_which_t,
            __value: *mut itimerval,
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn setitimer(
            __which: __itimer_which_t,
            __new: *const itimerval,
            __old: *mut itimerval,
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn utimes(
            __file: *const ::std::os::raw::c_char,
            __tvp: *const timeval,
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn access(
            __name: *const ::std::os::raw::c_char,
            __type: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn lseek(
            __fd: ::std::os::raw::c_int,
            __offset: __off_t,
            __whence: ::std::os::raw::c_int,
        ) -> __off_t;
    }
    extern "C" {
        pub fn close(__fd: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn read(
            __fd: ::std::os::raw::c_int,
            __buf: *mut ::std::os::raw::c_void,
            __nbytes: usize,
        ) -> isize;
    }
    extern "C" {
        pub fn write(
            __fd: ::std::os::raw::c_int,
            __buf: *const ::std::os::raw::c_void,
            __n: usize,
        ) -> isize;
    }
    extern "C" {
        pub fn pipe(__pipedes: *mut ::std::os::raw::c_int) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn alarm(__seconds: ::std::os::raw::c_uint) -> ::std::os::raw::c_uint;
    }
    extern "C" {
        pub fn sleep(__seconds: ::std::os::raw::c_uint) -> ::std::os::raw::c_uint;
    }
    extern "C" {
        pub fn pause() -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn chown(
            __file: *const ::std::os::raw::c_char,
            __owner: __uid_t,
            __group: __gid_t,
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn chdir(__path: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn getcwd(
            __buf: *mut ::std::os::raw::c_char,
            __size: usize,
        ) -> *mut ::std::os::raw::c_char;
    }
    extern "C" {
        pub fn dup(__fd: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn dup2(
            __fd: ::std::os::raw::c_int,
            __fd2: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub static mut __environ: *mut *mut ::std::os::raw::c_char;
    }
    extern "C" {
        pub fn execve(
            __path: *const ::std::os::raw::c_char,
            __argv: *const *mut ::std::os::raw::c_char,
            __envp: *const *mut ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn execv(
            __path: *const ::std::os::raw::c_char,
            __argv: *const *mut ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn execle(
            __path: *const ::std::os::raw::c_char,
            __arg: *const ::std::os::raw::c_char,
            ...
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn execl(
            __path: *const ::std::os::raw::c_char,
            __arg: *const ::std::os::raw::c_char,
            ...
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn execvp(
            __file: *const ::std::os::raw::c_char,
            __argv: *const *mut ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn execlp(
            __file: *const ::std::os::raw::c_char,
            __arg: *const ::std::os::raw::c_char,
            ...
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn _exit(__status: ::std::os::raw::c_int);
    }
    pub const _PC_LINK_MAX: _bindgen_ty_7 = _bindgen_ty_7::_PC_LINK_MAX;
    pub const _PC_MAX_CANON: _bindgen_ty_7 = _bindgen_ty_7::_PC_MAX_CANON;
    pub const _PC_MAX_INPUT: _bindgen_ty_7 = _bindgen_ty_7::_PC_MAX_INPUT;
    pub const _PC_NAME_MAX: _bindgen_ty_7 = _bindgen_ty_7::_PC_NAME_MAX;
    pub const _PC_PATH_MAX: _bindgen_ty_7 = _bindgen_ty_7::_PC_PATH_MAX;
    pub const _PC_PIPE_BUF: _bindgen_ty_7 = _bindgen_ty_7::_PC_PIPE_BUF;
    pub const _PC_CHOWN_RESTRICTED: _bindgen_ty_7 = _bindgen_ty_7::_PC_CHOWN_RESTRICTED;
    pub const _PC_NO_TRUNC: _bindgen_ty_7 = _bindgen_ty_7::_PC_NO_TRUNC;
    pub const _PC_VDISABLE: _bindgen_ty_7 = _bindgen_ty_7::_PC_VDISABLE;
    pub const _PC_SYNC_IO: _bindgen_ty_7 = _bindgen_ty_7::_PC_SYNC_IO;
    pub const _PC_ASYNC_IO: _bindgen_ty_7 = _bindgen_ty_7::_PC_ASYNC_IO;
    pub const _PC_PRIO_IO: _bindgen_ty_7 = _bindgen_ty_7::_PC_PRIO_IO;
    pub const _PC_SOCK_MAXBUF: _bindgen_ty_7 = _bindgen_ty_7::_PC_SOCK_MAXBUF;
    pub const _PC_FILESIZEBITS: _bindgen_ty_7 = _bindgen_ty_7::_PC_FILESIZEBITS;
    pub const _PC_REC_INCR_XFER_SIZE: _bindgen_ty_7 = _bindgen_ty_7::_PC_REC_INCR_XFER_SIZE;
    pub const _PC_REC_MAX_XFER_SIZE: _bindgen_ty_7 = _bindgen_ty_7::_PC_REC_MAX_XFER_SIZE;
    pub const _PC_REC_MIN_XFER_SIZE: _bindgen_ty_7 = _bindgen_ty_7::_PC_REC_MIN_XFER_SIZE;
    pub const _PC_REC_XFER_ALIGN: _bindgen_ty_7 = _bindgen_ty_7::_PC_REC_XFER_ALIGN;
    pub const _PC_ALLOC_SIZE_MIN: _bindgen_ty_7 = _bindgen_ty_7::_PC_ALLOC_SIZE_MIN;
    pub const _PC_SYMLINK_MAX: _bindgen_ty_7 = _bindgen_ty_7::_PC_SYMLINK_MAX;
    pub const _PC_2_SYMLINKS: _bindgen_ty_7 = _bindgen_ty_7::_PC_2_SYMLINKS;
    #[repr(u32)]
    #[derive(Debug, Copy, Clone, PartialEq, Eq, Hash, PartialOrd, Ord)]
    pub enum _bindgen_ty_7 {
        _PC_LINK_MAX = 0,
        _PC_MAX_CANON = 1,
        _PC_MAX_INPUT = 2,
        _PC_NAME_MAX = 3,
        _PC_PATH_MAX = 4,
        _PC_PIPE_BUF = 5,
        _PC_CHOWN_RESTRICTED = 6,
        _PC_NO_TRUNC = 7,
        _PC_VDISABLE = 8,
        _PC_SYNC_IO = 9,
        _PC_ASYNC_IO = 10,
        _PC_PRIO_IO = 11,
        _PC_SOCK_MAXBUF = 12,
        _PC_FILESIZEBITS = 13,
        _PC_REC_INCR_XFER_SIZE = 14,
        _PC_REC_MAX_XFER_SIZE = 15,
        _PC_REC_MIN_XFER_SIZE = 16,
        _PC_REC_XFER_ALIGN = 17,
        _PC_ALLOC_SIZE_MIN = 18,
        _PC_SYMLINK_MAX = 19,
        _PC_2_SYMLINKS = 20,
    }
    pub const _SC_ARG_MAX: _bindgen_ty_8 = _bindgen_ty_8::_SC_ARG_MAX;
    pub const _SC_CHILD_MAX: _bindgen_ty_8 = _bindgen_ty_8::_SC_CHILD_MAX;
    pub const _SC_CLK_TCK: _bindgen_ty_8 = _bindgen_ty_8::_SC_CLK_TCK;
    pub const _SC_NGROUPS_MAX: _bindgen_ty_8 = _bindgen_ty_8::_SC_NGROUPS_MAX;
    pub const _SC_OPEN_MAX: _bindgen_ty_8 = _bindgen_ty_8::_SC_OPEN_MAX;
    pub const _SC_STREAM_MAX: _bindgen_ty_8 = _bindgen_ty_8::_SC_STREAM_MAX;
    pub const _SC_TZNAME_MAX: _bindgen_ty_8 = _bindgen_ty_8::_SC_TZNAME_MAX;
    pub const _SC_JOB_CONTROL: _bindgen_ty_8 = _bindgen_ty_8::_SC_JOB_CONTROL;
    pub const _SC_SAVED_IDS: _bindgen_ty_8 = _bindgen_ty_8::_SC_SAVED_IDS;
    pub const _SC_REALTIME_SIGNALS: _bindgen_ty_8 = _bindgen_ty_8::_SC_REALTIME_SIGNALS;
    pub const _SC_PRIORITY_SCHEDULING: _bindgen_ty_8 = _bindgen_ty_8::_SC_PRIORITY_SCHEDULING;
    pub const _SC_TIMERS: _bindgen_ty_8 = _bindgen_ty_8::_SC_TIMERS;
    pub const _SC_ASYNCHRONOUS_IO: _bindgen_ty_8 = _bindgen_ty_8::_SC_ASYNCHRONOUS_IO;
    pub const _SC_PRIORITIZED_IO: _bindgen_ty_8 = _bindgen_ty_8::_SC_PRIORITIZED_IO;
    pub const _SC_SYNCHRONIZED_IO: _bindgen_ty_8 = _bindgen_ty_8::_SC_SYNCHRONIZED_IO;
    pub const _SC_FSYNC: _bindgen_ty_8 = _bindgen_ty_8::_SC_FSYNC;
    pub const _SC_MAPPED_FILES: _bindgen_ty_8 = _bindgen_ty_8::_SC_MAPPED_FILES;
    pub const _SC_MEMLOCK: _bindgen_ty_8 = _bindgen_ty_8::_SC_MEMLOCK;
    pub const _SC_MEMLOCK_RANGE: _bindgen_ty_8 = _bindgen_ty_8::_SC_MEMLOCK_RANGE;
    pub const _SC_MEMORY_PROTECTION: _bindgen_ty_8 = _bindgen_ty_8::_SC_MEMORY_PROTECTION;
    pub const _SC_MESSAGE_PASSING: _bindgen_ty_8 = _bindgen_ty_8::_SC_MESSAGE_PASSING;
    pub const _SC_SEMAPHORES: _bindgen_ty_8 = _bindgen_ty_8::_SC_SEMAPHORES;
    pub const _SC_SHARED_MEMORY_OBJECTS: _bindgen_ty_8 = _bindgen_ty_8::_SC_SHARED_MEMORY_OBJECTS;
    pub const _SC_AIO_LISTIO_MAX: _bindgen_ty_8 = _bindgen_ty_8::_SC_AIO_LISTIO_MAX;
    pub const _SC_AIO_MAX: _bindgen_ty_8 = _bindgen_ty_8::_SC_AIO_MAX;
    pub const _SC_AIO_PRIO_DELTA_MAX: _bindgen_ty_8 = _bindgen_ty_8::_SC_AIO_PRIO_DELTA_MAX;
    pub const _SC_DELAYTIMER_MAX: _bindgen_ty_8 = _bindgen_ty_8::_SC_DELAYTIMER_MAX;
    pub const _SC_MQ_OPEN_MAX: _bindgen_ty_8 = _bindgen_ty_8::_SC_MQ_OPEN_MAX;
    pub const _SC_MQ_PRIO_MAX: _bindgen_ty_8 = _bindgen_ty_8::_SC_MQ_PRIO_MAX;
    pub const _SC_VERSION: _bindgen_ty_8 = _bindgen_ty_8::_SC_VERSION;
    pub const _SC_PAGESIZE: _bindgen_ty_8 = _bindgen_ty_8::_SC_PAGESIZE;
    pub const _SC_RTSIG_MAX: _bindgen_ty_8 = _bindgen_ty_8::_SC_RTSIG_MAX;
    pub const _SC_SEM_NSEMS_MAX: _bindgen_ty_8 = _bindgen_ty_8::_SC_SEM_NSEMS_MAX;
    pub const _SC_SEM_VALUE_MAX: _bindgen_ty_8 = _bindgen_ty_8::_SC_SEM_VALUE_MAX;
    pub const _SC_SIGQUEUE_MAX: _bindgen_ty_8 = _bindgen_ty_8::_SC_SIGQUEUE_MAX;
    pub const _SC_TIMER_MAX: _bindgen_ty_8 = _bindgen_ty_8::_SC_TIMER_MAX;
    pub const _SC_BC_BASE_MAX: _bindgen_ty_8 = _bindgen_ty_8::_SC_BC_BASE_MAX;
    pub const _SC_BC_DIM_MAX: _bindgen_ty_8 = _bindgen_ty_8::_SC_BC_DIM_MAX;
    pub const _SC_BC_SCALE_MAX: _bindgen_ty_8 = _bindgen_ty_8::_SC_BC_SCALE_MAX;
    pub const _SC_BC_STRING_MAX: _bindgen_ty_8 = _bindgen_ty_8::_SC_BC_STRING_MAX;
    pub const _SC_COLL_WEIGHTS_MAX: _bindgen_ty_8 = _bindgen_ty_8::_SC_COLL_WEIGHTS_MAX;
    pub const _SC_EQUIV_CLASS_MAX: _bindgen_ty_8 = _bindgen_ty_8::_SC_EQUIV_CLASS_MAX;
    pub const _SC_EXPR_NEST_MAX: _bindgen_ty_8 = _bindgen_ty_8::_SC_EXPR_NEST_MAX;
    pub const _SC_LINE_MAX: _bindgen_ty_8 = _bindgen_ty_8::_SC_LINE_MAX;
    pub const _SC_RE_DUP_MAX: _bindgen_ty_8 = _bindgen_ty_8::_SC_RE_DUP_MAX;
    pub const _SC_CHARCLASS_NAME_MAX: _bindgen_ty_8 = _bindgen_ty_8::_SC_CHARCLASS_NAME_MAX;
    pub const _SC_2_VERSION: _bindgen_ty_8 = _bindgen_ty_8::_SC_2_VERSION;
    pub const _SC_2_C_BIND: _bindgen_ty_8 = _bindgen_ty_8::_SC_2_C_BIND;
    pub const _SC_2_C_DEV: _bindgen_ty_8 = _bindgen_ty_8::_SC_2_C_DEV;
    pub const _SC_2_FORT_DEV: _bindgen_ty_8 = _bindgen_ty_8::_SC_2_FORT_DEV;
    pub const _SC_2_FORT_RUN: _bindgen_ty_8 = _bindgen_ty_8::_SC_2_FORT_RUN;
    pub const _SC_2_SW_DEV: _bindgen_ty_8 = _bindgen_ty_8::_SC_2_SW_DEV;
    pub const _SC_2_LOCALEDEF: _bindgen_ty_8 = _bindgen_ty_8::_SC_2_LOCALEDEF;
    pub const _SC_PII: _bindgen_ty_8 = _bindgen_ty_8::_SC_PII;
    pub const _SC_PII_XTI: _bindgen_ty_8 = _bindgen_ty_8::_SC_PII_XTI;
    pub const _SC_PII_SOCKET: _bindgen_ty_8 = _bindgen_ty_8::_SC_PII_SOCKET;
    pub const _SC_PII_INTERNET: _bindgen_ty_8 = _bindgen_ty_8::_SC_PII_INTERNET;
    pub const _SC_PII_OSI: _bindgen_ty_8 = _bindgen_ty_8::_SC_PII_OSI;
    pub const _SC_POLL: _bindgen_ty_8 = _bindgen_ty_8::_SC_POLL;
    pub const _SC_SELECT: _bindgen_ty_8 = _bindgen_ty_8::_SC_SELECT;
    pub const _SC_UIO_MAXIOV: _bindgen_ty_8 = _bindgen_ty_8::_SC_UIO_MAXIOV;
    pub const _SC_IOV_MAX: _bindgen_ty_8 = _bindgen_ty_8::_SC_UIO_MAXIOV;
    pub const _SC_PII_INTERNET_STREAM: _bindgen_ty_8 = _bindgen_ty_8::_SC_PII_INTERNET_STREAM;
    pub const _SC_PII_INTERNET_DGRAM: _bindgen_ty_8 = _bindgen_ty_8::_SC_PII_INTERNET_DGRAM;
    pub const _SC_PII_OSI_COTS: _bindgen_ty_8 = _bindgen_ty_8::_SC_PII_OSI_COTS;
    pub const _SC_PII_OSI_CLTS: _bindgen_ty_8 = _bindgen_ty_8::_SC_PII_OSI_CLTS;
    pub const _SC_PII_OSI_M: _bindgen_ty_8 = _bindgen_ty_8::_SC_PII_OSI_M;
    pub const _SC_T_IOV_MAX: _bindgen_ty_8 = _bindgen_ty_8::_SC_T_IOV_MAX;
    pub const _SC_THREADS: _bindgen_ty_8 = _bindgen_ty_8::_SC_THREADS;
    pub const _SC_THREAD_SAFE_FUNCTIONS: _bindgen_ty_8 = _bindgen_ty_8::_SC_THREAD_SAFE_FUNCTIONS;
    pub const _SC_GETGR_R_SIZE_MAX: _bindgen_ty_8 = _bindgen_ty_8::_SC_GETGR_R_SIZE_MAX;
    pub const _SC_GETPW_R_SIZE_MAX: _bindgen_ty_8 = _bindgen_ty_8::_SC_GETPW_R_SIZE_MAX;
    pub const _SC_LOGIN_NAME_MAX: _bindgen_ty_8 = _bindgen_ty_8::_SC_LOGIN_NAME_MAX;
    pub const _SC_TTY_NAME_MAX: _bindgen_ty_8 = _bindgen_ty_8::_SC_TTY_NAME_MAX;
    pub const _SC_THREAD_DESTRUCTOR_ITERATIONS: _bindgen_ty_8 =
        _bindgen_ty_8::_SC_THREAD_DESTRUCTOR_ITERATIONS;
    pub const _SC_THREAD_KEYS_MAX: _bindgen_ty_8 = _bindgen_ty_8::_SC_THREAD_KEYS_MAX;
    pub const _SC_THREAD_STACK_MIN: _bindgen_ty_8 = _bindgen_ty_8::_SC_THREAD_STACK_MIN;
    pub const _SC_THREAD_THREADS_MAX: _bindgen_ty_8 = _bindgen_ty_8::_SC_THREAD_THREADS_MAX;
    pub const _SC_THREAD_ATTR_STACKADDR: _bindgen_ty_8 = _bindgen_ty_8::_SC_THREAD_ATTR_STACKADDR;
    pub const _SC_THREAD_ATTR_STACKSIZE: _bindgen_ty_8 = _bindgen_ty_8::_SC_THREAD_ATTR_STACKSIZE;
    pub const _SC_THREAD_PRIORITY_SCHEDULING: _bindgen_ty_8 =
        _bindgen_ty_8::_SC_THREAD_PRIORITY_SCHEDULING;
    pub const _SC_THREAD_PRIO_INHERIT: _bindgen_ty_8 = _bindgen_ty_8::_SC_THREAD_PRIO_INHERIT;
    pub const _SC_THREAD_PRIO_PROTECT: _bindgen_ty_8 = _bindgen_ty_8::_SC_THREAD_PRIO_PROTECT;
    pub const _SC_THREAD_PROCESS_SHARED: _bindgen_ty_8 = _bindgen_ty_8::_SC_THREAD_PROCESS_SHARED;
    pub const _SC_NPROCESSORS_CONF: _bindgen_ty_8 = _bindgen_ty_8::_SC_NPROCESSORS_CONF;
    pub const _SC_NPROCESSORS_ONLN: _bindgen_ty_8 = _bindgen_ty_8::_SC_NPROCESSORS_ONLN;
    pub const _SC_PHYS_PAGES: _bindgen_ty_8 = _bindgen_ty_8::_SC_PHYS_PAGES;
    pub const _SC_AVPHYS_PAGES: _bindgen_ty_8 = _bindgen_ty_8::_SC_AVPHYS_PAGES;
    pub const _SC_ATEXIT_MAX: _bindgen_ty_8 = _bindgen_ty_8::_SC_ATEXIT_MAX;
    pub const _SC_PASS_MAX: _bindgen_ty_8 = _bindgen_ty_8::_SC_PASS_MAX;
    pub const _SC_XOPEN_VERSION: _bindgen_ty_8 = _bindgen_ty_8::_SC_XOPEN_VERSION;
    pub const _SC_XOPEN_XCU_VERSION: _bindgen_ty_8 = _bindgen_ty_8::_SC_XOPEN_XCU_VERSION;
    pub const _SC_XOPEN_UNIX: _bindgen_ty_8 = _bindgen_ty_8::_SC_XOPEN_UNIX;
    pub const _SC_XOPEN_CRYPT: _bindgen_ty_8 = _bindgen_ty_8::_SC_XOPEN_CRYPT;
    pub const _SC_XOPEN_ENH_I18N: _bindgen_ty_8 = _bindgen_ty_8::_SC_XOPEN_ENH_I18N;
    pub const _SC_XOPEN_SHM: _bindgen_ty_8 = _bindgen_ty_8::_SC_XOPEN_SHM;
    pub const _SC_2_CHAR_TERM: _bindgen_ty_8 = _bindgen_ty_8::_SC_2_CHAR_TERM;
    pub const _SC_2_C_VERSION: _bindgen_ty_8 = _bindgen_ty_8::_SC_2_C_VERSION;
    pub const _SC_2_UPE: _bindgen_ty_8 = _bindgen_ty_8::_SC_2_UPE;
    pub const _SC_XOPEN_XPG2: _bindgen_ty_8 = _bindgen_ty_8::_SC_XOPEN_XPG2;
    pub const _SC_XOPEN_XPG3: _bindgen_ty_8 = _bindgen_ty_8::_SC_XOPEN_XPG3;
    pub const _SC_XOPEN_XPG4: _bindgen_ty_8 = _bindgen_ty_8::_SC_XOPEN_XPG4;
    pub const _SC_CHAR_BIT: _bindgen_ty_8 = _bindgen_ty_8::_SC_CHAR_BIT;
    pub const _SC_CHAR_MAX: _bindgen_ty_8 = _bindgen_ty_8::_SC_CHAR_MAX;
    pub const _SC_CHAR_MIN: _bindgen_ty_8 = _bindgen_ty_8::_SC_CHAR_MIN;
    pub const _SC_INT_MAX: _bindgen_ty_8 = _bindgen_ty_8::_SC_INT_MAX;
    pub const _SC_INT_MIN: _bindgen_ty_8 = _bindgen_ty_8::_SC_INT_MIN;
    pub const _SC_LONG_BIT: _bindgen_ty_8 = _bindgen_ty_8::_SC_LONG_BIT;
    pub const _SC_WORD_BIT: _bindgen_ty_8 = _bindgen_ty_8::_SC_WORD_BIT;
    pub const _SC_MB_LEN_MAX: _bindgen_ty_8 = _bindgen_ty_8::_SC_MB_LEN_MAX;
    pub const _SC_NZERO: _bindgen_ty_8 = _bindgen_ty_8::_SC_NZERO;
    pub const _SC_SSIZE_MAX: _bindgen_ty_8 = _bindgen_ty_8::_SC_SSIZE_MAX;
    pub const _SC_SCHAR_MAX: _bindgen_ty_8 = _bindgen_ty_8::_SC_SCHAR_MAX;
    pub const _SC_SCHAR_MIN: _bindgen_ty_8 = _bindgen_ty_8::_SC_SCHAR_MIN;
    pub const _SC_SHRT_MAX: _bindgen_ty_8 = _bindgen_ty_8::_SC_SHRT_MAX;
    pub const _SC_SHRT_MIN: _bindgen_ty_8 = _bindgen_ty_8::_SC_SHRT_MIN;
    pub const _SC_UCHAR_MAX: _bindgen_ty_8 = _bindgen_ty_8::_SC_UCHAR_MAX;
    pub const _SC_UINT_MAX: _bindgen_ty_8 = _bindgen_ty_8::_SC_UINT_MAX;
    pub const _SC_ULONG_MAX: _bindgen_ty_8 = _bindgen_ty_8::_SC_ULONG_MAX;
    pub const _SC_USHRT_MAX: _bindgen_ty_8 = _bindgen_ty_8::_SC_USHRT_MAX;
    pub const _SC_NL_ARGMAX: _bindgen_ty_8 = _bindgen_ty_8::_SC_NL_ARGMAX;
    pub const _SC_NL_LANGMAX: _bindgen_ty_8 = _bindgen_ty_8::_SC_NL_LANGMAX;
    pub const _SC_NL_MSGMAX: _bindgen_ty_8 = _bindgen_ty_8::_SC_NL_MSGMAX;
    pub const _SC_NL_NMAX: _bindgen_ty_8 = _bindgen_ty_8::_SC_NL_NMAX;
    pub const _SC_NL_SETMAX: _bindgen_ty_8 = _bindgen_ty_8::_SC_NL_SETMAX;
    pub const _SC_NL_TEXTMAX: _bindgen_ty_8 = _bindgen_ty_8::_SC_NL_TEXTMAX;
    pub const _SC_XBS5_ILP32_OFF32: _bindgen_ty_8 = _bindgen_ty_8::_SC_XBS5_ILP32_OFF32;
    pub const _SC_XBS5_ILP32_OFFBIG: _bindgen_ty_8 = _bindgen_ty_8::_SC_XBS5_ILP32_OFFBIG;
    pub const _SC_XBS5_LP64_OFF64: _bindgen_ty_8 = _bindgen_ty_8::_SC_XBS5_LP64_OFF64;
    pub const _SC_XBS5_LPBIG_OFFBIG: _bindgen_ty_8 = _bindgen_ty_8::_SC_XBS5_LPBIG_OFFBIG;
    pub const _SC_XOPEN_LEGACY: _bindgen_ty_8 = _bindgen_ty_8::_SC_XOPEN_LEGACY;
    pub const _SC_XOPEN_REALTIME: _bindgen_ty_8 = _bindgen_ty_8::_SC_XOPEN_REALTIME;
    pub const _SC_XOPEN_REALTIME_THREADS: _bindgen_ty_8 = _bindgen_ty_8::_SC_XOPEN_REALTIME_THREADS;
    pub const _SC_ADVISORY_INFO: _bindgen_ty_8 = _bindgen_ty_8::_SC_ADVISORY_INFO;
    pub const _SC_BARRIERS: _bindgen_ty_8 = _bindgen_ty_8::_SC_BARRIERS;
    pub const _SC_BASE: _bindgen_ty_8 = _bindgen_ty_8::_SC_BASE;
    pub const _SC_C_LANG_SUPPORT: _bindgen_ty_8 = _bindgen_ty_8::_SC_C_LANG_SUPPORT;
    pub const _SC_C_LANG_SUPPORT_R: _bindgen_ty_8 = _bindgen_ty_8::_SC_C_LANG_SUPPORT_R;
    pub const _SC_CLOCK_SELECTION: _bindgen_ty_8 = _bindgen_ty_8::_SC_CLOCK_SELECTION;
    pub const _SC_CPUTIME: _bindgen_ty_8 = _bindgen_ty_8::_SC_CPUTIME;
    pub const _SC_THREAD_CPUTIME: _bindgen_ty_8 = _bindgen_ty_8::_SC_THREAD_CPUTIME;
    pub const _SC_DEVICE_IO: _bindgen_ty_8 = _bindgen_ty_8::_SC_DEVICE_IO;
    pub const _SC_DEVICE_SPECIFIC: _bindgen_ty_8 = _bindgen_ty_8::_SC_DEVICE_SPECIFIC;
    pub const _SC_DEVICE_SPECIFIC_R: _bindgen_ty_8 = _bindgen_ty_8::_SC_DEVICE_SPECIFIC_R;
    pub const _SC_FD_MGMT: _bindgen_ty_8 = _bindgen_ty_8::_SC_FD_MGMT;
    pub const _SC_FIFO: _bindgen_ty_8 = _bindgen_ty_8::_SC_FIFO;
    pub const _SC_PIPE: _bindgen_ty_8 = _bindgen_ty_8::_SC_PIPE;
    pub const _SC_FILE_ATTRIBUTES: _bindgen_ty_8 = _bindgen_ty_8::_SC_FILE_ATTRIBUTES;
    pub const _SC_FILE_LOCKING: _bindgen_ty_8 = _bindgen_ty_8::_SC_FILE_LOCKING;
    pub const _SC_FILE_SYSTEM: _bindgen_ty_8 = _bindgen_ty_8::_SC_FILE_SYSTEM;
    pub const _SC_MONOTONIC_CLOCK: _bindgen_ty_8 = _bindgen_ty_8::_SC_MONOTONIC_CLOCK;
    pub const _SC_MULTI_PROCESS: _bindgen_ty_8 = _bindgen_ty_8::_SC_MULTI_PROCESS;
    pub const _SC_SINGLE_PROCESS: _bindgen_ty_8 = _bindgen_ty_8::_SC_SINGLE_PROCESS;
    pub const _SC_NETWORKING: _bindgen_ty_8 = _bindgen_ty_8::_SC_NETWORKING;
    pub const _SC_READER_WRITER_LOCKS: _bindgen_ty_8 = _bindgen_ty_8::_SC_READER_WRITER_LOCKS;
    pub const _SC_SPIN_LOCKS: _bindgen_ty_8 = _bindgen_ty_8::_SC_SPIN_LOCKS;
    pub const _SC_REGEXP: _bindgen_ty_8 = _bindgen_ty_8::_SC_REGEXP;
    pub const _SC_REGEX_VERSION: _bindgen_ty_8 = _bindgen_ty_8::_SC_REGEX_VERSION;
    pub const _SC_SHELL: _bindgen_ty_8 = _bindgen_ty_8::_SC_SHELL;
    pub const _SC_SIGNALS: _bindgen_ty_8 = _bindgen_ty_8::_SC_SIGNALS;
    pub const _SC_SPAWN: _bindgen_ty_8 = _bindgen_ty_8::_SC_SPAWN;
    pub const _SC_SPORADIC_SERVER: _bindgen_ty_8 = _bindgen_ty_8::_SC_SPORADIC_SERVER;
    pub const _SC_THREAD_SPORADIC_SERVER: _bindgen_ty_8 = _bindgen_ty_8::_SC_THREAD_SPORADIC_SERVER;
    pub const _SC_SYSTEM_DATABASE: _bindgen_ty_8 = _bindgen_ty_8::_SC_SYSTEM_DATABASE;
    pub const _SC_SYSTEM_DATABASE_R: _bindgen_ty_8 = _bindgen_ty_8::_SC_SYSTEM_DATABASE_R;
    pub const _SC_TIMEOUTS: _bindgen_ty_8 = _bindgen_ty_8::_SC_TIMEOUTS;
    pub const _SC_TYPED_MEMORY_OBJECTS: _bindgen_ty_8 = _bindgen_ty_8::_SC_TYPED_MEMORY_OBJECTS;
    pub const _SC_USER_GROUPS: _bindgen_ty_8 = _bindgen_ty_8::_SC_USER_GROUPS;
    pub const _SC_USER_GROUPS_R: _bindgen_ty_8 = _bindgen_ty_8::_SC_USER_GROUPS_R;
    pub const _SC_2_PBS: _bindgen_ty_8 = _bindgen_ty_8::_SC_2_PBS;
    pub const _SC_2_PBS_ACCOUNTING: _bindgen_ty_8 = _bindgen_ty_8::_SC_2_PBS_ACCOUNTING;
    pub const _SC_2_PBS_LOCATE: _bindgen_ty_8 = _bindgen_ty_8::_SC_2_PBS_LOCATE;
    pub const _SC_2_PBS_MESSAGE: _bindgen_ty_8 = _bindgen_ty_8::_SC_2_PBS_MESSAGE;
    pub const _SC_2_PBS_TRACK: _bindgen_ty_8 = _bindgen_ty_8::_SC_2_PBS_TRACK;
    pub const _SC_SYMLOOP_MAX: _bindgen_ty_8 = _bindgen_ty_8::_SC_SYMLOOP_MAX;
    pub const _SC_STREAMS: _bindgen_ty_8 = _bindgen_ty_8::_SC_STREAMS;
    pub const _SC_2_PBS_CHECKPOINT: _bindgen_ty_8 = _bindgen_ty_8::_SC_2_PBS_CHECKPOINT;
    pub const _SC_V6_ILP32_OFF32: _bindgen_ty_8 = _bindgen_ty_8::_SC_V6_ILP32_OFF32;
    pub const _SC_V6_ILP32_OFFBIG: _bindgen_ty_8 = _bindgen_ty_8::_SC_V6_ILP32_OFFBIG;
    pub const _SC_V6_LP64_OFF64: _bindgen_ty_8 = _bindgen_ty_8::_SC_V6_LP64_OFF64;
    pub const _SC_V6_LPBIG_OFFBIG: _bindgen_ty_8 = _bindgen_ty_8::_SC_V6_LPBIG_OFFBIG;
    pub const _SC_HOST_NAME_MAX: _bindgen_ty_8 = _bindgen_ty_8::_SC_HOST_NAME_MAX;
    pub const _SC_TRACE: _bindgen_ty_8 = _bindgen_ty_8::_SC_TRACE;
    pub const _SC_TRACE_EVENT_FILTER: _bindgen_ty_8 = _bindgen_ty_8::_SC_TRACE_EVENT_FILTER;
    pub const _SC_TRACE_INHERIT: _bindgen_ty_8 = _bindgen_ty_8::_SC_TRACE_INHERIT;
    pub const _SC_TRACE_LOG: _bindgen_ty_8 = _bindgen_ty_8::_SC_TRACE_LOG;
    pub const _SC_LEVEL1_ICACHE_SIZE: _bindgen_ty_8 = _bindgen_ty_8::_SC_LEVEL1_ICACHE_SIZE;
    pub const _SC_LEVEL1_ICACHE_ASSOC: _bindgen_ty_8 = _bindgen_ty_8::_SC_LEVEL1_ICACHE_ASSOC;
    pub const _SC_LEVEL1_ICACHE_LINESIZE: _bindgen_ty_8 = _bindgen_ty_8::_SC_LEVEL1_ICACHE_LINESIZE;
    pub const _SC_LEVEL1_DCACHE_SIZE: _bindgen_ty_8 = _bindgen_ty_8::_SC_LEVEL1_DCACHE_SIZE;
    pub const _SC_LEVEL1_DCACHE_ASSOC: _bindgen_ty_8 = _bindgen_ty_8::_SC_LEVEL1_DCACHE_ASSOC;
    pub const _SC_LEVEL1_DCACHE_LINESIZE: _bindgen_ty_8 = _bindgen_ty_8::_SC_LEVEL1_DCACHE_LINESIZE;
    pub const _SC_LEVEL2_CACHE_SIZE: _bindgen_ty_8 = _bindgen_ty_8::_SC_LEVEL2_CACHE_SIZE;
    pub const _SC_LEVEL2_CACHE_ASSOC: _bindgen_ty_8 = _bindgen_ty_8::_SC_LEVEL2_CACHE_ASSOC;
    pub const _SC_LEVEL2_CACHE_LINESIZE: _bindgen_ty_8 = _bindgen_ty_8::_SC_LEVEL2_CACHE_LINESIZE;
    pub const _SC_LEVEL3_CACHE_SIZE: _bindgen_ty_8 = _bindgen_ty_8::_SC_LEVEL3_CACHE_SIZE;
    pub const _SC_LEVEL3_CACHE_ASSOC: _bindgen_ty_8 = _bindgen_ty_8::_SC_LEVEL3_CACHE_ASSOC;
    pub const _SC_LEVEL3_CACHE_LINESIZE: _bindgen_ty_8 = _bindgen_ty_8::_SC_LEVEL3_CACHE_LINESIZE;
    pub const _SC_LEVEL4_CACHE_SIZE: _bindgen_ty_8 = _bindgen_ty_8::_SC_LEVEL4_CACHE_SIZE;
    pub const _SC_LEVEL4_CACHE_ASSOC: _bindgen_ty_8 = _bindgen_ty_8::_SC_LEVEL4_CACHE_ASSOC;
    pub const _SC_LEVEL4_CACHE_LINESIZE: _bindgen_ty_8 = _bindgen_ty_8::_SC_LEVEL4_CACHE_LINESIZE;
    pub const _SC_IPV6: _bindgen_ty_8 = _bindgen_ty_8::_SC_IPV6;
    pub const _SC_RAW_SOCKETS: _bindgen_ty_8 = _bindgen_ty_8::_SC_RAW_SOCKETS;
    pub const _SC_V7_ILP32_OFF32: _bindgen_ty_8 = _bindgen_ty_8::_SC_V7_ILP32_OFF32;
    pub const _SC_V7_ILP32_OFFBIG: _bindgen_ty_8 = _bindgen_ty_8::_SC_V7_ILP32_OFFBIG;
    pub const _SC_V7_LP64_OFF64: _bindgen_ty_8 = _bindgen_ty_8::_SC_V7_LP64_OFF64;
    pub const _SC_V7_LPBIG_OFFBIG: _bindgen_ty_8 = _bindgen_ty_8::_SC_V7_LPBIG_OFFBIG;
    pub const _SC_SS_REPL_MAX: _bindgen_ty_8 = _bindgen_ty_8::_SC_SS_REPL_MAX;
    pub const _SC_TRACE_EVENT_NAME_MAX: _bindgen_ty_8 = _bindgen_ty_8::_SC_TRACE_EVENT_NAME_MAX;
    pub const _SC_TRACE_NAME_MAX: _bindgen_ty_8 = _bindgen_ty_8::_SC_TRACE_NAME_MAX;
    pub const _SC_TRACE_SYS_MAX: _bindgen_ty_8 = _bindgen_ty_8::_SC_TRACE_SYS_MAX;
    pub const _SC_TRACE_USER_EVENT_MAX: _bindgen_ty_8 = _bindgen_ty_8::_SC_TRACE_USER_EVENT_MAX;
    pub const _SC_XOPEN_STREAMS: _bindgen_ty_8 = _bindgen_ty_8::_SC_XOPEN_STREAMS;
    pub const _SC_THREAD_ROBUST_PRIO_INHERIT: _bindgen_ty_8 =
        _bindgen_ty_8::_SC_THREAD_ROBUST_PRIO_INHERIT;
    pub const _SC_THREAD_ROBUST_PRIO_PROTECT: _bindgen_ty_8 =
        _bindgen_ty_8::_SC_THREAD_ROBUST_PRIO_PROTECT;
    #[repr(u32)]
    #[derive(Debug, Copy, Clone, PartialEq, Eq, Hash, PartialOrd, Ord)]
    pub enum _bindgen_ty_8 {
        _SC_ARG_MAX = 0,
        _SC_CHILD_MAX = 1,
        _SC_CLK_TCK = 2,
        _SC_NGROUPS_MAX = 3,
        _SC_OPEN_MAX = 4,
        _SC_STREAM_MAX = 5,
        _SC_TZNAME_MAX = 6,
        _SC_JOB_CONTROL = 7,
        _SC_SAVED_IDS = 8,
        _SC_REALTIME_SIGNALS = 9,
        _SC_PRIORITY_SCHEDULING = 10,
        _SC_TIMERS = 11,
        _SC_ASYNCHRONOUS_IO = 12,
        _SC_PRIORITIZED_IO = 13,
        _SC_SYNCHRONIZED_IO = 14,
        _SC_FSYNC = 15,
        _SC_MAPPED_FILES = 16,
        _SC_MEMLOCK = 17,
        _SC_MEMLOCK_RANGE = 18,
        _SC_MEMORY_PROTECTION = 19,
        _SC_MESSAGE_PASSING = 20,
        _SC_SEMAPHORES = 21,
        _SC_SHARED_MEMORY_OBJECTS = 22,
        _SC_AIO_LISTIO_MAX = 23,
        _SC_AIO_MAX = 24,
        _SC_AIO_PRIO_DELTA_MAX = 25,
        _SC_DELAYTIMER_MAX = 26,
        _SC_MQ_OPEN_MAX = 27,
        _SC_MQ_PRIO_MAX = 28,
        _SC_VERSION = 29,
        _SC_PAGESIZE = 30,
        _SC_RTSIG_MAX = 31,
        _SC_SEM_NSEMS_MAX = 32,
        _SC_SEM_VALUE_MAX = 33,
        _SC_SIGQUEUE_MAX = 34,
        _SC_TIMER_MAX = 35,
        _SC_BC_BASE_MAX = 36,
        _SC_BC_DIM_MAX = 37,
        _SC_BC_SCALE_MAX = 38,
        _SC_BC_STRING_MAX = 39,
        _SC_COLL_WEIGHTS_MAX = 40,
        _SC_EQUIV_CLASS_MAX = 41,
        _SC_EXPR_NEST_MAX = 42,
        _SC_LINE_MAX = 43,
        _SC_RE_DUP_MAX = 44,
        _SC_CHARCLASS_NAME_MAX = 45,
        _SC_2_VERSION = 46,
        _SC_2_C_BIND = 47,
        _SC_2_C_DEV = 48,
        _SC_2_FORT_DEV = 49,
        _SC_2_FORT_RUN = 50,
        _SC_2_SW_DEV = 51,
        _SC_2_LOCALEDEF = 52,
        _SC_PII = 53,
        _SC_PII_XTI = 54,
        _SC_PII_SOCKET = 55,
        _SC_PII_INTERNET = 56,
        _SC_PII_OSI = 57,
        _SC_POLL = 58,
        _SC_SELECT = 59,
        _SC_UIO_MAXIOV = 60,
        _SC_PII_INTERNET_STREAM = 61,
        _SC_PII_INTERNET_DGRAM = 62,
        _SC_PII_OSI_COTS = 63,
        _SC_PII_OSI_CLTS = 64,
        _SC_PII_OSI_M = 65,
        _SC_T_IOV_MAX = 66,
        _SC_THREADS = 67,
        _SC_THREAD_SAFE_FUNCTIONS = 68,
        _SC_GETGR_R_SIZE_MAX = 69,
        _SC_GETPW_R_SIZE_MAX = 70,
        _SC_LOGIN_NAME_MAX = 71,
        _SC_TTY_NAME_MAX = 72,
        _SC_THREAD_DESTRUCTOR_ITERATIONS = 73,
        _SC_THREAD_KEYS_MAX = 74,
        _SC_THREAD_STACK_MIN = 75,
        _SC_THREAD_THREADS_MAX = 76,
        _SC_THREAD_ATTR_STACKADDR = 77,
        _SC_THREAD_ATTR_STACKSIZE = 78,
        _SC_THREAD_PRIORITY_SCHEDULING = 79,
        _SC_THREAD_PRIO_INHERIT = 80,
        _SC_THREAD_PRIO_PROTECT = 81,
        _SC_THREAD_PROCESS_SHARED = 82,
        _SC_NPROCESSORS_CONF = 83,
        _SC_NPROCESSORS_ONLN = 84,
        _SC_PHYS_PAGES = 85,
        _SC_AVPHYS_PAGES = 86,
        _SC_ATEXIT_MAX = 87,
        _SC_PASS_MAX = 88,
        _SC_XOPEN_VERSION = 89,
        _SC_XOPEN_XCU_VERSION = 90,
        _SC_XOPEN_UNIX = 91,
        _SC_XOPEN_CRYPT = 92,
        _SC_XOPEN_ENH_I18N = 93,
        _SC_XOPEN_SHM = 94,
        _SC_2_CHAR_TERM = 95,
        _SC_2_C_VERSION = 96,
        _SC_2_UPE = 97,
        _SC_XOPEN_XPG2 = 98,
        _SC_XOPEN_XPG3 = 99,
        _SC_XOPEN_XPG4 = 100,
        _SC_CHAR_BIT = 101,
        _SC_CHAR_MAX = 102,
        _SC_CHAR_MIN = 103,
        _SC_INT_MAX = 104,
        _SC_INT_MIN = 105,
        _SC_LONG_BIT = 106,
        _SC_WORD_BIT = 107,
        _SC_MB_LEN_MAX = 108,
        _SC_NZERO = 109,
        _SC_SSIZE_MAX = 110,
        _SC_SCHAR_MAX = 111,
        _SC_SCHAR_MIN = 112,
        _SC_SHRT_MAX = 113,
        _SC_SHRT_MIN = 114,
        _SC_UCHAR_MAX = 115,
        _SC_UINT_MAX = 116,
        _SC_ULONG_MAX = 117,
        _SC_USHRT_MAX = 118,
        _SC_NL_ARGMAX = 119,
        _SC_NL_LANGMAX = 120,
        _SC_NL_MSGMAX = 121,
        _SC_NL_NMAX = 122,
        _SC_NL_SETMAX = 123,
        _SC_NL_TEXTMAX = 124,
        _SC_XBS5_ILP32_OFF32 = 125,
        _SC_XBS5_ILP32_OFFBIG = 126,
        _SC_XBS5_LP64_OFF64 = 127,
        _SC_XBS5_LPBIG_OFFBIG = 128,
        _SC_XOPEN_LEGACY = 129,
        _SC_XOPEN_REALTIME = 130,
        _SC_XOPEN_REALTIME_THREADS = 131,
        _SC_ADVISORY_INFO = 132,
        _SC_BARRIERS = 133,
        _SC_BASE = 134,
        _SC_C_LANG_SUPPORT = 135,
        _SC_C_LANG_SUPPORT_R = 136,
        _SC_CLOCK_SELECTION = 137,
        _SC_CPUTIME = 138,
        _SC_THREAD_CPUTIME = 139,
        _SC_DEVICE_IO = 140,
        _SC_DEVICE_SPECIFIC = 141,
        _SC_DEVICE_SPECIFIC_R = 142,
        _SC_FD_MGMT = 143,
        _SC_FIFO = 144,
        _SC_PIPE = 145,
        _SC_FILE_ATTRIBUTES = 146,
        _SC_FILE_LOCKING = 147,
        _SC_FILE_SYSTEM = 148,
        _SC_MONOTONIC_CLOCK = 149,
        _SC_MULTI_PROCESS = 150,
        _SC_SINGLE_PROCESS = 151,
        _SC_NETWORKING = 152,
        _SC_READER_WRITER_LOCKS = 153,
        _SC_SPIN_LOCKS = 154,
        _SC_REGEXP = 155,
        _SC_REGEX_VERSION = 156,
        _SC_SHELL = 157,
        _SC_SIGNALS = 158,
        _SC_SPAWN = 159,
        _SC_SPORADIC_SERVER = 160,
        _SC_THREAD_SPORADIC_SERVER = 161,
        _SC_SYSTEM_DATABASE = 162,
        _SC_SYSTEM_DATABASE_R = 163,
        _SC_TIMEOUTS = 164,
        _SC_TYPED_MEMORY_OBJECTS = 165,
        _SC_USER_GROUPS = 166,
        _SC_USER_GROUPS_R = 167,
        _SC_2_PBS = 168,
        _SC_2_PBS_ACCOUNTING = 169,
        _SC_2_PBS_LOCATE = 170,
        _SC_2_PBS_MESSAGE = 171,
        _SC_2_PBS_TRACK = 172,
        _SC_SYMLOOP_MAX = 173,
        _SC_STREAMS = 174,
        _SC_2_PBS_CHECKPOINT = 175,
        _SC_V6_ILP32_OFF32 = 176,
        _SC_V6_ILP32_OFFBIG = 177,
        _SC_V6_LP64_OFF64 = 178,
        _SC_V6_LPBIG_OFFBIG = 179,
        _SC_HOST_NAME_MAX = 180,
        _SC_TRACE = 181,
        _SC_TRACE_EVENT_FILTER = 182,
        _SC_TRACE_INHERIT = 183,
        _SC_TRACE_LOG = 184,
        _SC_LEVEL1_ICACHE_SIZE = 185,
        _SC_LEVEL1_ICACHE_ASSOC = 186,
        _SC_LEVEL1_ICACHE_LINESIZE = 187,
        _SC_LEVEL1_DCACHE_SIZE = 188,
        _SC_LEVEL1_DCACHE_ASSOC = 189,
        _SC_LEVEL1_DCACHE_LINESIZE = 190,
        _SC_LEVEL2_CACHE_SIZE = 191,
        _SC_LEVEL2_CACHE_ASSOC = 192,
        _SC_LEVEL2_CACHE_LINESIZE = 193,
        _SC_LEVEL3_CACHE_SIZE = 194,
        _SC_LEVEL3_CACHE_ASSOC = 195,
        _SC_LEVEL3_CACHE_LINESIZE = 196,
        _SC_LEVEL4_CACHE_SIZE = 197,
        _SC_LEVEL4_CACHE_ASSOC = 198,
        _SC_LEVEL4_CACHE_LINESIZE = 199,
        _SC_IPV6 = 235,
        _SC_RAW_SOCKETS = 236,
        _SC_V7_ILP32_OFF32 = 237,
        _SC_V7_ILP32_OFFBIG = 238,
        _SC_V7_LP64_OFF64 = 239,
        _SC_V7_LPBIG_OFFBIG = 240,
        _SC_SS_REPL_MAX = 241,
        _SC_TRACE_EVENT_NAME_MAX = 242,
        _SC_TRACE_NAME_MAX = 243,
        _SC_TRACE_SYS_MAX = 244,
        _SC_TRACE_USER_EVENT_MAX = 245,
        _SC_XOPEN_STREAMS = 246,
        _SC_THREAD_ROBUST_PRIO_INHERIT = 247,
        _SC_THREAD_ROBUST_PRIO_PROTECT = 248,
    }
    pub const _CS_PATH: _bindgen_ty_9 = _bindgen_ty_9::_CS_PATH;
    pub const _CS_V6_WIDTH_RESTRICTED_ENVS: _bindgen_ty_9 =
        _bindgen_ty_9::_CS_V6_WIDTH_RESTRICTED_ENVS;
    pub const _CS_GNU_LIBC_VERSION: _bindgen_ty_9 = _bindgen_ty_9::_CS_GNU_LIBC_VERSION;
    pub const _CS_GNU_LIBPTHREAD_VERSION: _bindgen_ty_9 = _bindgen_ty_9::_CS_GNU_LIBPTHREAD_VERSION;
    pub const _CS_V5_WIDTH_RESTRICTED_ENVS: _bindgen_ty_9 =
        _bindgen_ty_9::_CS_V5_WIDTH_RESTRICTED_ENVS;
    pub const _CS_V7_WIDTH_RESTRICTED_ENVS: _bindgen_ty_9 =
        _bindgen_ty_9::_CS_V7_WIDTH_RESTRICTED_ENVS;
    pub const _CS_LFS_CFLAGS: _bindgen_ty_9 = _bindgen_ty_9::_CS_LFS_CFLAGS;
    pub const _CS_LFS_LDFLAGS: _bindgen_ty_9 = _bindgen_ty_9::_CS_LFS_LDFLAGS;
    pub const _CS_LFS_LIBS: _bindgen_ty_9 = _bindgen_ty_9::_CS_LFS_LIBS;
    pub const _CS_LFS_LINTFLAGS: _bindgen_ty_9 = _bindgen_ty_9::_CS_LFS_LINTFLAGS;
    pub const _CS_LFS64_CFLAGS: _bindgen_ty_9 = _bindgen_ty_9::_CS_LFS64_CFLAGS;
    pub const _CS_LFS64_LDFLAGS: _bindgen_ty_9 = _bindgen_ty_9::_CS_LFS64_LDFLAGS;
    pub const _CS_LFS64_LIBS: _bindgen_ty_9 = _bindgen_ty_9::_CS_LFS64_LIBS;
    pub const _CS_LFS64_LINTFLAGS: _bindgen_ty_9 = _bindgen_ty_9::_CS_LFS64_LINTFLAGS;
    pub const _CS_XBS5_ILP32_OFF32_CFLAGS: _bindgen_ty_9 =
        _bindgen_ty_9::_CS_XBS5_ILP32_OFF32_CFLAGS;
    pub const _CS_XBS5_ILP32_OFF32_LDFLAGS: _bindgen_ty_9 =
        _bindgen_ty_9::_CS_XBS5_ILP32_OFF32_LDFLAGS;
    pub const _CS_XBS5_ILP32_OFF32_LIBS: _bindgen_ty_9 = _bindgen_ty_9::_CS_XBS5_ILP32_OFF32_LIBS;
    pub const _CS_XBS5_ILP32_OFF32_LINTFLAGS: _bindgen_ty_9 =
        _bindgen_ty_9::_CS_XBS5_ILP32_OFF32_LINTFLAGS;
    pub const _CS_XBS5_ILP32_OFFBIG_CFLAGS: _bindgen_ty_9 =
        _bindgen_ty_9::_CS_XBS5_ILP32_OFFBIG_CFLAGS;
    pub const _CS_XBS5_ILP32_OFFBIG_LDFLAGS: _bindgen_ty_9 =
        _bindgen_ty_9::_CS_XBS5_ILP32_OFFBIG_LDFLAGS;
    pub const _CS_XBS5_ILP32_OFFBIG_LIBS: _bindgen_ty_9 = _bindgen_ty_9::_CS_XBS5_ILP32_OFFBIG_LIBS;
    pub const _CS_XBS5_ILP32_OFFBIG_LINTFLAGS: _bindgen_ty_9 =
        _bindgen_ty_9::_CS_XBS5_ILP32_OFFBIG_LINTFLAGS;
    pub const _CS_XBS5_LP64_OFF64_CFLAGS: _bindgen_ty_9 = _bindgen_ty_9::_CS_XBS5_LP64_OFF64_CFLAGS;
    pub const _CS_XBS5_LP64_OFF64_LDFLAGS: _bindgen_ty_9 =
        _bindgen_ty_9::_CS_XBS5_LP64_OFF64_LDFLAGS;
    pub const _CS_XBS5_LP64_OFF64_LIBS: _bindgen_ty_9 = _bindgen_ty_9::_CS_XBS5_LP64_OFF64_LIBS;
    pub const _CS_XBS5_LP64_OFF64_LINTFLAGS: _bindgen_ty_9 =
        _bindgen_ty_9::_CS_XBS5_LP64_OFF64_LINTFLAGS;
    pub const _CS_XBS5_LPBIG_OFFBIG_CFLAGS: _bindgen_ty_9 =
        _bindgen_ty_9::_CS_XBS5_LPBIG_OFFBIG_CFLAGS;
    pub const _CS_XBS5_LPBIG_OFFBIG_LDFLAGS: _bindgen_ty_9 =
        _bindgen_ty_9::_CS_XBS5_LPBIG_OFFBIG_LDFLAGS;
    pub const _CS_XBS5_LPBIG_OFFBIG_LIBS: _bindgen_ty_9 = _bindgen_ty_9::_CS_XBS5_LPBIG_OFFBIG_LIBS;
    pub const _CS_XBS5_LPBIG_OFFBIG_LINTFLAGS: _bindgen_ty_9 =
        _bindgen_ty_9::_CS_XBS5_LPBIG_OFFBIG_LINTFLAGS;
    pub const _CS_POSIX_V6_ILP32_OFF32_CFLAGS: _bindgen_ty_9 =
        _bindgen_ty_9::_CS_POSIX_V6_ILP32_OFF32_CFLAGS;
    pub const _CS_POSIX_V6_ILP32_OFF32_LDFLAGS: _bindgen_ty_9 =
        _bindgen_ty_9::_CS_POSIX_V6_ILP32_OFF32_LDFLAGS;
    pub const _CS_POSIX_V6_ILP32_OFF32_LIBS: _bindgen_ty_9 =
        _bindgen_ty_9::_CS_POSIX_V6_ILP32_OFF32_LIBS;
    pub const _CS_POSIX_V6_ILP32_OFF32_LINTFLAGS: _bindgen_ty_9 =
        _bindgen_ty_9::_CS_POSIX_V6_ILP32_OFF32_LINTFLAGS;
    pub const _CS_POSIX_V6_ILP32_OFFBIG_CFLAGS: _bindgen_ty_9 =
        _bindgen_ty_9::_CS_POSIX_V6_ILP32_OFFBIG_CFLAGS;
    pub const _CS_POSIX_V6_ILP32_OFFBIG_LDFLAGS: _bindgen_ty_9 =
        _bindgen_ty_9::_CS_POSIX_V6_ILP32_OFFBIG_LDFLAGS;
    pub const _CS_POSIX_V6_ILP32_OFFBIG_LIBS: _bindgen_ty_9 =
        _bindgen_ty_9::_CS_POSIX_V6_ILP32_OFFBIG_LIBS;
    pub const _CS_POSIX_V6_ILP32_OFFBIG_LINTFLAGS: _bindgen_ty_9 =
        _bindgen_ty_9::_CS_POSIX_V6_ILP32_OFFBIG_LINTFLAGS;
    pub const _CS_POSIX_V6_LP64_OFF64_CFLAGS: _bindgen_ty_9 =
        _bindgen_ty_9::_CS_POSIX_V6_LP64_OFF64_CFLAGS;
    pub const _CS_POSIX_V6_LP64_OFF64_LDFLAGS: _bindgen_ty_9 =
        _bindgen_ty_9::_CS_POSIX_V6_LP64_OFF64_LDFLAGS;
    pub const _CS_POSIX_V6_LP64_OFF64_LIBS: _bindgen_ty_9 =
        _bindgen_ty_9::_CS_POSIX_V6_LP64_OFF64_LIBS;
    pub const _CS_POSIX_V6_LP64_OFF64_LINTFLAGS: _bindgen_ty_9 =
        _bindgen_ty_9::_CS_POSIX_V6_LP64_OFF64_LINTFLAGS;
    pub const _CS_POSIX_V6_LPBIG_OFFBIG_CFLAGS: _bindgen_ty_9 =
        _bindgen_ty_9::_CS_POSIX_V6_LPBIG_OFFBIG_CFLAGS;
    pub const _CS_POSIX_V6_LPBIG_OFFBIG_LDFLAGS: _bindgen_ty_9 =
        _bindgen_ty_9::_CS_POSIX_V6_LPBIG_OFFBIG_LDFLAGS;
    pub const _CS_POSIX_V6_LPBIG_OFFBIG_LIBS: _bindgen_ty_9 =
        _bindgen_ty_9::_CS_POSIX_V6_LPBIG_OFFBIG_LIBS;
    pub const _CS_POSIX_V6_LPBIG_OFFBIG_LINTFLAGS: _bindgen_ty_9 =
        _bindgen_ty_9::_CS_POSIX_V6_LPBIG_OFFBIG_LINTFLAGS;
    pub const _CS_POSIX_V7_ILP32_OFF32_CFLAGS: _bindgen_ty_9 =
        _bindgen_ty_9::_CS_POSIX_V7_ILP32_OFF32_CFLAGS;
    pub const _CS_POSIX_V7_ILP32_OFF32_LDFLAGS: _bindgen_ty_9 =
        _bindgen_ty_9::_CS_POSIX_V7_ILP32_OFF32_LDFLAGS;
    pub const _CS_POSIX_V7_ILP32_OFF32_LIBS: _bindgen_ty_9 =
        _bindgen_ty_9::_CS_POSIX_V7_ILP32_OFF32_LIBS;
    pub const _CS_POSIX_V7_ILP32_OFF32_LINTFLAGS: _bindgen_ty_9 =
        _bindgen_ty_9::_CS_POSIX_V7_ILP32_OFF32_LINTFLAGS;
    pub const _CS_POSIX_V7_ILP32_OFFBIG_CFLAGS: _bindgen_ty_9 =
        _bindgen_ty_9::_CS_POSIX_V7_ILP32_OFFBIG_CFLAGS;
    pub const _CS_POSIX_V7_ILP32_OFFBIG_LDFLAGS: _bindgen_ty_9 =
        _bindgen_ty_9::_CS_POSIX_V7_ILP32_OFFBIG_LDFLAGS;
    pub const _CS_POSIX_V7_ILP32_OFFBIG_LIBS: _bindgen_ty_9 =
        _bindgen_ty_9::_CS_POSIX_V7_ILP32_OFFBIG_LIBS;
    pub const _CS_POSIX_V7_ILP32_OFFBIG_LINTFLAGS: _bindgen_ty_9 =
        _bindgen_ty_9::_CS_POSIX_V7_ILP32_OFFBIG_LINTFLAGS;
    pub const _CS_POSIX_V7_LP64_OFF64_CFLAGS: _bindgen_ty_9 =
        _bindgen_ty_9::_CS_POSIX_V7_LP64_OFF64_CFLAGS;
    pub const _CS_POSIX_V7_LP64_OFF64_LDFLAGS: _bindgen_ty_9 =
        _bindgen_ty_9::_CS_POSIX_V7_LP64_OFF64_LDFLAGS;
    pub const _CS_POSIX_V7_LP64_OFF64_LIBS: _bindgen_ty_9 =
        _bindgen_ty_9::_CS_POSIX_V7_LP64_OFF64_LIBS;
    pub const _CS_POSIX_V7_LP64_OFF64_LINTFLAGS: _bindgen_ty_9 =
        _bindgen_ty_9::_CS_POSIX_V7_LP64_OFF64_LINTFLAGS;
    pub const _CS_POSIX_V7_LPBIG_OFFBIG_CFLAGS: _bindgen_ty_9 =
        _bindgen_ty_9::_CS_POSIX_V7_LPBIG_OFFBIG_CFLAGS;
    pub const _CS_POSIX_V7_LPBIG_OFFBIG_LDFLAGS: _bindgen_ty_9 =
        _bindgen_ty_9::_CS_POSIX_V7_LPBIG_OFFBIG_LDFLAGS;
    pub const _CS_POSIX_V7_LPBIG_OFFBIG_LIBS: _bindgen_ty_9 =
        _bindgen_ty_9::_CS_POSIX_V7_LPBIG_OFFBIG_LIBS;
    pub const _CS_POSIX_V7_LPBIG_OFFBIG_LINTFLAGS: _bindgen_ty_9 =
        _bindgen_ty_9::_CS_POSIX_V7_LPBIG_OFFBIG_LINTFLAGS;
    pub const _CS_V6_ENV: _bindgen_ty_9 = _bindgen_ty_9::_CS_V6_ENV;
    pub const _CS_V7_ENV: _bindgen_ty_9 = _bindgen_ty_9::_CS_V7_ENV;
    #[repr(u32)]
    #[derive(Debug, Copy, Clone, PartialEq, Eq, Hash, PartialOrd, Ord)]
    pub enum _bindgen_ty_9 {
        _CS_PATH = 0,
        _CS_V6_WIDTH_RESTRICTED_ENVS = 1,
        _CS_GNU_LIBC_VERSION = 2,
        _CS_GNU_LIBPTHREAD_VERSION = 3,
        _CS_V5_WIDTH_RESTRICTED_ENVS = 4,
        _CS_V7_WIDTH_RESTRICTED_ENVS = 5,
        _CS_LFS_CFLAGS = 1000,
        _CS_LFS_LDFLAGS = 1001,
        _CS_LFS_LIBS = 1002,
        _CS_LFS_LINTFLAGS = 1003,
        _CS_LFS64_CFLAGS = 1004,
        _CS_LFS64_LDFLAGS = 1005,
        _CS_LFS64_LIBS = 1006,
        _CS_LFS64_LINTFLAGS = 1007,
        _CS_XBS5_ILP32_OFF32_CFLAGS = 1100,
        _CS_XBS5_ILP32_OFF32_LDFLAGS = 1101,
        _CS_XBS5_ILP32_OFF32_LIBS = 1102,
        _CS_XBS5_ILP32_OFF32_LINTFLAGS = 1103,
        _CS_XBS5_ILP32_OFFBIG_CFLAGS = 1104,
        _CS_XBS5_ILP32_OFFBIG_LDFLAGS = 1105,
        _CS_XBS5_ILP32_OFFBIG_LIBS = 1106,
        _CS_XBS5_ILP32_OFFBIG_LINTFLAGS = 1107,
        _CS_XBS5_LP64_OFF64_CFLAGS = 1108,
        _CS_XBS5_LP64_OFF64_LDFLAGS = 1109,
        _CS_XBS5_LP64_OFF64_LIBS = 1110,
        _CS_XBS5_LP64_OFF64_LINTFLAGS = 1111,
        _CS_XBS5_LPBIG_OFFBIG_CFLAGS = 1112,
        _CS_XBS5_LPBIG_OFFBIG_LDFLAGS = 1113,
        _CS_XBS5_LPBIG_OFFBIG_LIBS = 1114,
        _CS_XBS5_LPBIG_OFFBIG_LINTFLAGS = 1115,
        _CS_POSIX_V6_ILP32_OFF32_CFLAGS = 1116,
        _CS_POSIX_V6_ILP32_OFF32_LDFLAGS = 1117,
        _CS_POSIX_V6_ILP32_OFF32_LIBS = 1118,
        _CS_POSIX_V6_ILP32_OFF32_LINTFLAGS = 1119,
        _CS_POSIX_V6_ILP32_OFFBIG_CFLAGS = 1120,
        _CS_POSIX_V6_ILP32_OFFBIG_LDFLAGS = 1121,
        _CS_POSIX_V6_ILP32_OFFBIG_LIBS = 1122,
        _CS_POSIX_V6_ILP32_OFFBIG_LINTFLAGS = 1123,
        _CS_POSIX_V6_LP64_OFF64_CFLAGS = 1124,
        _CS_POSIX_V6_LP64_OFF64_LDFLAGS = 1125,
        _CS_POSIX_V6_LP64_OFF64_LIBS = 1126,
        _CS_POSIX_V6_LP64_OFF64_LINTFLAGS = 1127,
        _CS_POSIX_V6_LPBIG_OFFBIG_CFLAGS = 1128,
        _CS_POSIX_V6_LPBIG_OFFBIG_LDFLAGS = 1129,
        _CS_POSIX_V6_LPBIG_OFFBIG_LIBS = 1130,
        _CS_POSIX_V6_LPBIG_OFFBIG_LINTFLAGS = 1131,
        _CS_POSIX_V7_ILP32_OFF32_CFLAGS = 1132,
        _CS_POSIX_V7_ILP32_OFF32_LDFLAGS = 1133,
        _CS_POSIX_V7_ILP32_OFF32_LIBS = 1134,
        _CS_POSIX_V7_ILP32_OFF32_LINTFLAGS = 1135,
        _CS_POSIX_V7_ILP32_OFFBIG_CFLAGS = 1136,
        _CS_POSIX_V7_ILP32_OFFBIG_LDFLAGS = 1137,
        _CS_POSIX_V7_ILP32_OFFBIG_LIBS = 1138,
        _CS_POSIX_V7_ILP32_OFFBIG_LINTFLAGS = 1139,
        _CS_POSIX_V7_LP64_OFF64_CFLAGS = 1140,
        _CS_POSIX_V7_LP64_OFF64_LDFLAGS = 1141,
        _CS_POSIX_V7_LP64_OFF64_LIBS = 1142,
        _CS_POSIX_V7_LP64_OFF64_LINTFLAGS = 1143,
        _CS_POSIX_V7_LPBIG_OFFBIG_CFLAGS = 1144,
        _CS_POSIX_V7_LPBIG_OFFBIG_LDFLAGS = 1145,
        _CS_POSIX_V7_LPBIG_OFFBIG_LIBS = 1146,
        _CS_POSIX_V7_LPBIG_OFFBIG_LINTFLAGS = 1147,
        _CS_V6_ENV = 1148,
        _CS_V7_ENV = 1149,
    }
    extern "C" {
        pub fn pathconf(
            __path: *const ::std::os::raw::c_char,
            __name: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_long;
    }
    extern "C" {
        pub fn fpathconf(
            __fd: ::std::os::raw::c_int,
            __name: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_long;
    }
    extern "C" {
        pub fn sysconf(__name: ::std::os::raw::c_int) -> ::std::os::raw::c_long;
    }
    extern "C" {
        pub fn getpid() -> __pid_t;
    }
    extern "C" {
        pub fn getppid() -> __pid_t;
    }
    extern "C" {
        pub fn getpgrp() -> __pid_t;
    }
    extern "C" {
        pub fn __getpgid(__pid: __pid_t) -> __pid_t;
    }
    extern "C" {
        pub fn setpgid(__pid: __pid_t, __pgid: __pid_t) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn setsid() -> __pid_t;
    }
    extern "C" {
        pub fn getuid() -> __uid_t;
    }
    extern "C" {
        pub fn geteuid() -> __uid_t;
    }
    extern "C" {
        pub fn getgid() -> __gid_t;
    }
    extern "C" {
        pub fn getegid() -> __gid_t;
    }
    extern "C" {
        pub fn getgroups(
            __size: ::std::os::raw::c_int,
            __list: *mut __gid_t,
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn setuid(__uid: __uid_t) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn setgid(__gid: __gid_t) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn fork() -> __pid_t;
    }
    extern "C" {
        pub fn ttyname(__fd: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_char;
    }
    extern "C" {
        pub fn ttyname_r(
            __fd: ::std::os::raw::c_int,
            __buf: *mut ::std::os::raw::c_char,
            __buflen: usize,
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn isatty(__fd: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn link(
            __from: *const ::std::os::raw::c_char,
            __to: *const ::std::os::raw::c_char,
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn unlink(__name: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn rmdir(__path: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn tcgetpgrp(__fd: ::std::os::raw::c_int) -> __pid_t;
    }
    extern "C" {
        pub fn tcsetpgrp(__fd: ::std::os::raw::c_int, __pgrp_id: __pid_t) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn getlogin() -> *mut ::std::os::raw::c_char;
    }
    extern "C" {
        pub fn fsync(__fd: ::std::os::raw::c_int) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn inet_addr(__cp: *const ::std::os::raw::c_char) -> in_addr_t;
    }
    extern "C" {
        pub fn inet_lnaof(__in: in_addr) -> in_addr_t;
    }
    extern "C" {
        pub fn inet_makeaddr(__net: in_addr_t, __host: in_addr_t) -> in_addr;
    }
    extern "C" {
        pub fn inet_netof(__in: in_addr) -> in_addr_t;
    }
    extern "C" {
        pub fn inet_network(__cp: *const ::std::os::raw::c_char) -> in_addr_t;
    }
    extern "C" {
        pub fn inet_ntoa(__in: in_addr) -> *mut ::std::os::raw::c_char;
    }
    extern "C" {
        pub fn inet_pton(
            __af: ::std::os::raw::c_int,
            __cp: *const ::std::os::raw::c_char,
            __buf: *mut ::std::os::raw::c_void,
        ) -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn inet_ntop(
            __af: ::std::os::raw::c_int,
            __cp: *const ::std::os::raw::c_void,
            __buf: *mut ::std::os::raw::c_char,
            __len: socklen_t,
        ) -> *const ::std::os::raw::c_char;
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct netent {
        pub n_name: *mut ::std::os::raw::c_char,
        pub n_aliases: *mut *mut ::std::os::raw::c_char,
        pub n_addrtype: ::std::os::raw::c_int,
        pub n_net: u32,
    }
    #[test]
    fn bindgen_test_layout_netent() {
        assert_eq!(
            ::std::mem::size_of::<netent>(),
            24usize,
            concat!("Size of: ", stringify!(netent))
        );
        assert_eq!(
            ::std::mem::align_of::<netent>(),
            8usize,
            concat!("Alignment of ", stringify!(netent))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<netent>())).n_name as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(netent),
                "::",
                stringify!(n_name)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<netent>())).n_aliases as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(netent),
                "::",
                stringify!(n_aliases)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<netent>())).n_addrtype as *const _ as usize },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(netent),
                "::",
                stringify!(n_addrtype)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<netent>())).n_net as *const _ as usize },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(netent),
                "::",
                stringify!(n_net)
            )
        );
    }
    impl Default for netent {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    extern "C" {
        pub fn __h_errno_location() -> *mut ::std::os::raw::c_int;
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct hostent {
        pub h_name: *mut ::std::os::raw::c_char,
        pub h_aliases: *mut *mut ::std::os::raw::c_char,
        pub h_addrtype: ::std::os::raw::c_int,
        pub h_length: ::std::os::raw::c_int,
        pub h_addr_list: *mut *mut ::std::os::raw::c_char,
    }
    #[test]
    fn bindgen_test_layout_hostent() {
        assert_eq!(
            ::std::mem::size_of::<hostent>(),
            32usize,
            concat!("Size of: ", stringify!(hostent))
        );
        assert_eq!(
            ::std::mem::align_of::<hostent>(),
            8usize,
            concat!("Alignment of ", stringify!(hostent))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<hostent>())).h_name as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(hostent),
                "::",
                stringify!(h_name)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<hostent>())).h_aliases as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(hostent),
                "::",
                stringify!(h_aliases)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<hostent>())).h_addrtype as *const _ as usize },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(hostent),
                "::",
                stringify!(h_addrtype)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<hostent>())).h_length as *const _ as usize },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(hostent),
                "::",
                stringify!(h_length)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<hostent>())).h_addr_list as *const _ as usize },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(hostent),
                "::",
                stringify!(h_addr_list)
            )
        );
    }
    impl Default for hostent {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    extern "C" {
        pub fn sethostent(__stay_open: ::std::os::raw::c_int);
    }
    extern "C" {
        pub fn endhostent();
    }
    extern "C" {
        pub fn gethostent() -> *mut hostent;
    }
    extern "C" {
        pub fn gethostbyaddr(
            __addr: *const ::std::os::raw::c_void,
            __len: __socklen_t,
            __type: ::std::os::raw::c_int,
        ) -> *mut hostent;
    }
    extern "C" {
        pub fn gethostbyname(__name: *const ::std::os::raw::c_char) -> *mut hostent;
    }
    extern "C" {
        pub fn setnetent(__stay_open: ::std::os::raw::c_int);
    }
    extern "C" {
        pub fn endnetent();
    }
    extern "C" {
        pub fn getnetent() -> *mut netent;
    }
    extern "C" {
        pub fn getnetbyaddr(__net: u32, __type: ::std::os::raw::c_int) -> *mut netent;
    }
    extern "C" {
        pub fn getnetbyname(__name: *const ::std::os::raw::c_char) -> *mut netent;
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct servent {
        pub s_name: *mut ::std::os::raw::c_char,
        pub s_aliases: *mut *mut ::std::os::raw::c_char,
        pub s_port: ::std::os::raw::c_int,
        pub s_proto: *mut ::std::os::raw::c_char,
    }
    #[test]
    fn bindgen_test_layout_servent() {
        assert_eq!(
            ::std::mem::size_of::<servent>(),
            32usize,
            concat!("Size of: ", stringify!(servent))
        );
        assert_eq!(
            ::std::mem::align_of::<servent>(),
            8usize,
            concat!("Alignment of ", stringify!(servent))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<servent>())).s_name as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(servent),
                "::",
                stringify!(s_name)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<servent>())).s_aliases as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(servent),
                "::",
                stringify!(s_aliases)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<servent>())).s_port as *const _ as usize },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(servent),
                "::",
                stringify!(s_port)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<servent>())).s_proto as *const _ as usize },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(servent),
                "::",
                stringify!(s_proto)
            )
        );
    }
    impl Default for servent {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    extern "C" {
        pub fn setservent(__stay_open: ::std::os::raw::c_int);
    }
    extern "C" {
        pub fn endservent();
    }
    extern "C" {
        pub fn getservent() -> *mut servent;
    }
    extern "C" {
        pub fn getservbyname(
            __name: *const ::std::os::raw::c_char,
            __proto: *const ::std::os::raw::c_char,
        ) -> *mut servent;
    }
    extern "C" {
        pub fn getservbyport(
            __port: ::std::os::raw::c_int,
            __proto: *const ::std::os::raw::c_char,
        ) -> *mut servent;
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct protoent {
        pub p_name: *mut ::std::os::raw::c_char,
        pub p_aliases: *mut *mut ::std::os::raw::c_char,
        pub p_proto: ::std::os::raw::c_int,
    }
    #[test]
    fn bindgen_test_layout_protoent() {
        assert_eq!(
            ::std::mem::size_of::<protoent>(),
            24usize,
            concat!("Size of: ", stringify!(protoent))
        );
        assert_eq!(
            ::std::mem::align_of::<protoent>(),
            8usize,
            concat!("Alignment of ", stringify!(protoent))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<protoent>())).p_name as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(protoent),
                "::",
                stringify!(p_name)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<protoent>())).p_aliases as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(protoent),
                "::",
                stringify!(p_aliases)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<protoent>())).p_proto as *const _ as usize },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(protoent),
                "::",
                stringify!(p_proto)
            )
        );
    }
    impl Default for protoent {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    extern "C" {
        pub fn setprotoent(__stay_open: ::std::os::raw::c_int);
    }
    extern "C" {
        pub fn endprotoent();
    }
    extern "C" {
        pub fn getprotoent() -> *mut protoent;
    }
    extern "C" {
        pub fn getprotobyname(__name: *const ::std::os::raw::c_char) -> *mut protoent;
    }
    extern "C" {
        pub fn getprotobynumber(__proto: ::std::os::raw::c_int) -> *mut protoent;
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct ck_socket_ {
        pub sock: ::std::os::raw::c_int,
        pub prot: ::std::os::raw::c_int,
        pub sock_in: sockaddr_in,
        pub len: ::std::os::raw::c_uint,
    }
    #[test]
    fn bindgen_test_layout_ck_socket_() {
        assert_eq!(
            ::std::mem::size_of::<ck_socket_>(),
            28usize,
            concat!("Size of: ", stringify!(ck_socket_))
        );
        assert_eq!(
            ::std::mem::align_of::<ck_socket_>(),
            4usize,
            concat!("Alignment of ", stringify!(ck_socket_))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<ck_socket_>())).sock as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(ck_socket_),
                "::",
                stringify!(sock)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<ck_socket_>())).prot as *const _ as usize },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(ck_socket_),
                "::",
                stringify!(prot)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<ck_socket_>())).sock_in as *const _ as usize },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(ck_socket_),
                "::",
                stringify!(sock_in)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<ck_socket_>())).len as *const _ as usize },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(ck_socket_),
                "::",
                stringify!(len)
            )
        );
    }
    pub type __builtin_va_list = [__va_list_tag; 1usize];
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __va_list_tag {
        pub gp_offset: ::std::os::raw::c_uint,
        pub fp_offset: ::std::os::raw::c_uint,
        pub overflow_arg_area: *mut ::std::os::raw::c_void,
        pub reg_save_area: *mut ::std::os::raw::c_void,
    }
    #[test]
    fn bindgen_test_layout___va_list_tag() {
        assert_eq!(
            ::std::mem::size_of::<__va_list_tag>(),
            24usize,
            concat!("Size of: ", stringify!(__va_list_tag))
        );
        assert_eq!(
            ::std::mem::align_of::<__va_list_tag>(),
            8usize,
            concat!("Alignment of ", stringify!(__va_list_tag))
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<__va_list_tag>())).gp_offset as *const _ as usize },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(__va_list_tag),
                "::",
                stringify!(gp_offset)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<__va_list_tag>())).fp_offset as *const _ as usize },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(__va_list_tag),
                "::",
                stringify!(fp_offset)
            )
        );
        assert_eq!(
            unsafe {
                &(*(::std::ptr::null::<__va_list_tag>())).overflow_arg_area as *const _ as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(__va_list_tag),
                "::",
                stringify!(overflow_arg_area)
            )
        );
        assert_eq!(
            unsafe { &(*(::std::ptr::null::<__va_list_tag>())).reg_save_area as *const _ as usize },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(__va_list_tag),
                "::",
                stringify!(reg_save_area)
            )
        );
    }
    impl Default for __va_list_tag {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
}
