/* automatically generated by rust-bindgen */

#[allow(non_snake_case, non_camel_case_types, non_upper_case_globals)]
#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage, Align>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    storage: Storage,
    align: [Align; 0],
}
impl<Storage, Align> __BindgenBitfieldUnit<Storage, Align>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn new(storage: Storage) -> Self {
        Self { storage, align: [] }
    }
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        if val {
            *byte |= mask;
        } else {

        }
        pub type collate_char_type<_CharT> = _CharT;
        pub type collate_string_type =
            crate::core::midi::rtme::root::std::__cxx11::basic_string<_CharT>;
        impl Default for collate {
            fn default() -> Self {
                unsafe { ::std::mem::zeroed() }
            }
        }
        #[repr(C)]
        #[derive(Debug, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct collate_byname {
            pub _base: crate::core::midi::rtme::root::std::__cxx11::collate,
        }
        pub type collate_byname_char_type<_CharT> = _CharT;
        pub type collate_byname_string_type =
            crate::core::midi::rtme::root::std::__cxx11::basic_string<_CharT>;
        impl Default for collate_byname {
            fn default() -> Self {
                unsafe { ::std::mem::zeroed() }
            }
        }
        #[repr(C)]
        #[derive(Debug, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct numpunct<_CharT> {
            pub _base: crate::core::midi::rtme::root::std::locale_facet,
            pub _M_data:
                *mut crate::core::midi::rtme::root::std::__cxx11::numpunct___cache_type<_CharT>,
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_CharT>>,
        }
        pub type numpunct_char_type<_CharT> = _CharT;
        pub type numpunct_string_type =
            crate::core::midi::rtme::root::std::__cxx11::basic_string<_CharT>;
        pub type numpunct___cache_type<_CharT> =
            crate::core::midi::rtme::root::std::__numpunct_cache<_CharT>;
        impl<_CharT> Default for numpunct<_CharT> {
            fn default() -> Self {
                unsafe { ::std::mem::zeroed() }
            }
        }
        extern "C" {
            pub static mut id: crate::core::midi::rtme::root::std::locale_id;
        }
        #[repr(C)]
        #[derive(Debug, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct numpunct_byname<_CharT> {
            pub _base: crate::core::midi::rtme::root::std::__cxx11::numpunct<_CharT>,
            pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_CharT>>,
        }
        pub type numpunct_byname_char_type<_CharT> = _CharT;
        pub type numpunct_byname_string_type =
            crate::core::midi::rtme::root::std::__cxx11::basic_string<_CharT>;
        impl<_CharT> Default for numpunct_byname<_CharT> {
            fn default() -> Self {
                unsafe { ::std::mem::zeroed() }
            }
        }
    }
    #[repr(C)]
    pub struct exception__bindgen_vtable(::std::os::raw::c_void);
    #[repr(C)]
    #[derive(Debug, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct exception {
        pub vtable_: *const exception__bindgen_vtable,
    }
    // #[test]
    // fn bindgen_test_layout_exception() {
    //     assert_eq!(
    //         ::std::mem::size_of::<exception>(),
    //         8usize,
    //         concat!("Size of: ", stringify!(exception))
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<exception>(),
    //         8usize,
    //         concat!("Alignment of ", stringify!(exception))
    //     );
    // }
    impl Default for exception {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    extern "C" {
        #[link_name = "\u{1}exception_destructor"]
        pub fn exception_exception_destructor(
            this: *mut crate::core::midi::rtme::root::std::exception,
        );
    }
    extern "C" {
        #[link_name = "\u{1}what"]
        pub fn exception_what(this: *mut ::std::os::raw::c_void) -> *const ::std::os::raw::c_char;
    }
    #[repr(C)]
    #[derive(Debug, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct bad_exception {
        pub _base: crate::core::midi::rtme::root::std::exception,
    }
    // #[test]
    // fn bindgen_test_layout_bad_exception() {
    //     assert_eq!(
    //         ::std::mem::size_of::<bad_exception>(),
    //         8usize,
    //         concat!("Size of: ", stringify!(bad_exception))
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<bad_exception>(),
    //         8usize,
    //         concat!("Alignment of ", stringify!(bad_exception))
    //     );
    // }
    impl Default for bad_exception {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    extern "C" {
        #[link_name = "\u{1}bad_exception_destructor"]
        pub fn bad_exception_bad_exception_destructor(
            this: *mut crate::core::midi::rtme::root::std::bad_exception,
        );
    }
    extern "C" {
        #[link_name = "\u{1}what"]
        pub fn bad_exception_what(
            this: *mut ::std::os::raw::c_void,
        ) -> *const ::std::os::raw::c_char;
    }
    pub type terminate_handler = ::std::option::Option<unsafe extern "C" fn()>;
    pub type unexpected_handler = ::std::option::Option<unsafe extern "C" fn()>;
    extern "C" {
        pub fn set_terminate(
            arg1: crate::core::midi::rtme::root::std::terminate_handler,
        ) -> crate::core::midi::rtme::root::std::terminate_handler;
    }
    extern "C" {
        pub fn get_terminate() -> crate::core::midi::rtme::root::std::terminate_handler;
    }
    extern "C" {
        pub fn terminate();
    }
    extern "C" {
        pub fn set_unexpected(
            arg1: crate::core::midi::rtme::root::std::unexpected_handler,
        ) -> crate::core::midi::rtme::root::std::unexpected_handler;
    }
    extern "C" {
        pub fn get_unexpected() -> crate::core::midi::rtme::root::std::unexpected_handler;
    }
    extern "C" {
        pub fn unexpected();
    }
    extern "C" {
        pub fn uncaught_exception() -> bool;
    }
    extern "C" {
        pub fn uncaught_exceptions() -> ::std::os::raw::c_int;
    }
    extern "C" {
        pub fn _Hash_bytes(
            __ptr: *const ::std::os::raw::c_void,
            __len: usize,
            __seed: usize,
        ) -> usize;
    }
    extern "C" {
        pub fn _Fnv_hash_bytes(
            __ptr: *const ::std::os::raw::c_void,
            __len: usize,
            __seed: usize,
        ) -> usize;
    }
    #[repr(C)]
    pub struct type_info__bindgen_vtable(::std::os::raw::c_void);
    #[repr(C)]
    #[derive(Debug, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct type_info {
        pub vtable_: *const type_info__bindgen_vtable,
        pub __name: *const ::std::os::raw::c_char,
    }
    // #[test]
    // fn bindgen_test_layout_type_info() {
    //     assert_eq!(
    //         ::std::mem::size_of::<type_info>(),
    //         16usize,
    //         concat!("Size of: ", stringify!(type_info))
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<type_info>(),
    //         8usize,
    //         concat!("Alignment of ", stringify!(type_info))
    //     );
    //     assert_eq!(
    //         unsafe { &(*(::std::ptr::null::<type_info>())).__name as *const _ as usize },
    //         8usize,
    //         concat!(
    //             "Offset of field: ",
    //             stringify!(type_info),
    //             "::",
    //             stringify!(__name)
    //         )
    //     );
    // }
    impl Default for type_info {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    extern "C" {
        #[link_name = "\u{1}type_info_destructor"]
        pub fn type_info_type_info_destructor(
            this: *mut crate::core::midi::rtme::root::std::type_info,
        );
    }
    extern "C" {
        #[link_name = "\u{1}__is_pointer_p"]
        pub fn type_info___is_pointer_p(this: *mut ::std::os::raw::c_void) -> bool;
    }
    extern "C" {
        #[link_name = "\u{1}__is_function_p"]
        pub fn type_info___is_function_p(this: *mut ::std::os::raw::c_void) -> bool;
    }
    extern "C" {
        #[link_name = "\u{1}__do_catch"]
        pub fn type_info___do_catch(
            this: *mut ::std::os::raw::c_void,
            __thr_type: *const crate::core::midi::rtme::root::std::type_info,
            __thr_obj: *mut *mut ::std::os::raw::c_void,
            __outer: ::std::os::raw::c_uint,
        ) -> bool;
    }
    extern "C" {
        #[link_name = "\u{1}__do_upcast"]
        pub fn type_info___do_upcast(
            this: *mut ::std::os::raw::c_void,
            __target: *const crate::core::midi::rtme::root::__cxxabiv1::__class_type_info,
            __obj_ptr: *mut *mut ::std::os::raw::c_void,
        ) -> bool;
    }
    #[repr(C)]
    #[derive(Debug, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct bad_cast {
        pub _base: crate::core::midi::rtme::root::std::exception,
    }
    // #[test]
    // fn bindgen_test_layout_bad_cast() {
    //     assert_eq!(
    //         ::std::mem::size_of::<bad_cast>(),
    //         8usize,
    //         concat!("Size of: ", stringify!(bad_cast))
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<bad_cast>(),
    //         8usize,
    //         concat!("Alignment of ", stringify!(bad_cast))
    //     );
    // }
    impl Default for bad_cast {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    extern "C" {
        #[link_name = "\u{1}bad_cast_destructor"]
        pub fn bad_cast_bad_cast_destructor(
            this: *mut crate::core::midi::rtme::root::std::bad_cast,
        );
    }
    extern "C" {
        #[link_name = "\u{1}what"]
        pub fn bad_cast_what(this: *mut ::std::os::raw::c_void) -> *const ::std::os::raw::c_char;
    }
    #[repr(C)]
    #[derive(Debug, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct bad_typeid {
        pub _base: crate::core::midi::rtme::root::std::exception,
    }
    // #[test]
    // fn bindgen_test_layout_bad_typeid() {
    //     assert_eq!(
    //         ::std::mem::size_of::<bad_typeid>(),
    //         8usize,
    //         concat!("Size of: ", stringify!(bad_typeid))
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<bad_typeid>(),
    //         8usize,
    //         concat!("Alignment of ", stringify!(bad_typeid))
    //     );
    // }
    impl Default for bad_typeid {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    extern "C" {
        #[link_name = "\u{1}bad_typeid_destructor"]
        pub fn bad_typeid_bad_typeid_destructor(
            this: *mut crate::core::midi::rtme::root::std::bad_typeid,
        );
    }
    extern "C" {
        #[link_name = "\u{1}what"]
        pub fn bad_typeid_what(this: *mut ::std::os::raw::c_void) -> *const ::std::os::raw::c_char;
    }
    #[repr(C)]
    #[derive(Debug, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct bad_alloc {
        pub _base: crate::core::midi::rtme::root::std::exception,
    }
    // #[test]
    // fn bindgen_test_layout_bad_alloc() {
    //     assert_eq!(
    //         ::std::mem::size_of::<bad_alloc>(),
    //         8usize,
    //         concat!("Size of: ", stringify!(bad_alloc))
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<bad_alloc>(),
    //         8usize,
    //         concat!("Alignment of ", stringify!(bad_alloc))
    //     );
    // }
    impl Default for bad_alloc {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    extern "C" {
        #[link_name = "\u{1}bad_alloc_destructor"]
        pub fn bad_alloc_bad_alloc_destructor(
            this: *mut crate::core::midi::rtme::root::std::bad_alloc,
        );
    }
    extern "C" {
        #[link_name = "\u{1}what"]
        pub fn bad_alloc_what(this: *mut ::std::os::raw::c_void) -> *const ::std::os::raw::c_char;
    }
    #[repr(C)]
    #[derive(Debug, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct bad_array_new_length {
        pub _base: crate::core::midi::rtme::root::std::bad_alloc,
    }
    // #[test]
    // fn bindgen_test_layout_bad_array_new_length() {
    //     assert_eq!(
    //         ::std::mem::size_of::<bad_array_new_length>(),
    //         8usize,
    //         concat!("Size of: ", stringify!(bad_array_new_length))
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<bad_array_new_length>(),
    //         8usize,
    //         concat!("Alignment of ", stringify!(bad_array_new_length))
    //     );
    // }
    impl Default for bad_array_new_length {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    extern "C" {
        #[link_name = "\u{1}bad_array_new_length_destructor"]
        pub fn bad_array_new_length_bad_array_new_length_destructor(
            this: *mut crate::core::midi::rtme::root::std::bad_array_new_length,
        );
    }
    extern "C" {
        #[link_name = "\u{1}what"]
        pub fn bad_array_new_length_what(
            this: *mut ::std::os::raw::c_void,
        ) -> *const ::std::os::raw::c_char;
    }
    pub type align_val_t = u64;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct nothrow_t {
        pub _address: u8,
    }
    // #[test]
    // fn bindgen_test_layout_nothrow_t() {
    //     assert_eq!(
    //         ::std::mem::size_of::<nothrow_t>(),
    //         1usize,
    //         concat!("Size of: ", stringify!(nothrow_t))
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<nothrow_t>(),
    //         1usize,
    //         concat!("Alignment of ", stringify!(nothrow_t))
    //     );
    // }
    extern "C" {
        pub static nothrow: crate::core::midi::rtme::root::std::nothrow_t;
    }
    pub type new_handler = ::std::option::Option<unsafe extern "C" fn()>;
    extern "C" {
        pub fn set_new_handler(
            arg1: crate::core::midi::rtme::root::std::new_handler,
        ) -> crate::core::midi::rtme::root::std::new_handler;
    }
    extern "C" {
        pub fn get_new_handler() -> crate::core::midi::rtme::root::std::new_handler;
    }
    pub mod __exception_ptr {

        #[repr(C)]
        #[derive(Debug, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct exception_ptr {
            pub _M_exception_object: *mut ::std::os::raw::c_void,
        }
        // #[test]
        // fn bindgen_test_layout_exception_ptr() {
        //     assert_eq!(
        //         ::std::mem::size_of::<exception_ptr>(),
        //         8usize,
        //         concat!("Size of: ", stringify!(exception_ptr))
        //     );
        //     assert_eq!(
        //         ::std::mem::align_of::<exception_ptr>(),
        //         8usize,
        //         concat!("Alignment of ", stringify!(exception_ptr))
        //     );
        //     assert_eq!(
        //         unsafe {
        //             &(*(::std::ptr::null::<exception_ptr>()))._M_exception_object as *const _
        //                 as usize
        //         },
        //         0usize,
        //         concat!(
        //             "Offset of field: ",
        //             stringify!(exception_ptr),
        //             "::",
        //             stringify!(_M_exception_object)
        //         )
        //     );
        // }
        extern "C" {
            #[link_name = "\u{1}swap"]
            pub fn exception_ptr_swap(
                this: *mut crate::core::midi::rtme::root::std::__exception_ptr::exception_ptr,
                arg1: *mut crate::core::midi::rtme::root::std::__exception_ptr::exception_ptr,
            );
        }
        extern "C" {
            #[link_name = "\u{1}__cxa_exception_type"]
            pub fn exception_ptr___cxa_exception_type(
                this: *const crate::core::midi::rtme::root::std::__exception_ptr::exception_ptr,
            ) -> *const crate::core::midi::rtme::root::std::type_info;
        }
        extern "C" {
            #[link_name = "\u{1}exception_ptr"]
            pub fn exception_ptr_exception_ptr(
                this: *mut crate::core::midi::rtme::root::std::__exception_ptr::exception_ptr,
            );
        }
        extern "C" {
            #[link_name = "\u{1}exception_ptr"]
            pub fn exception_ptr_exception_ptr1(
                this: *mut crate::core::midi::rtme::root::std::__exception_ptr::exception_ptr,
                arg1: *const crate::core::midi::rtme::root::std::__exception_ptr::exception_ptr,
            );
        }
        extern "C" {
            #[link_name = "\u{1}exception_ptr_destructor"]
            pub fn exception_ptr_exception_ptr_destructor(
                this: *mut crate::core::midi::rtme::root::std::__exception_ptr::exception_ptr,
            );
        }
        impl Default for exception_ptr {
            fn default() -> Self {
                unsafe { ::std::mem::zeroed() }
            }
        }
        impl exception_ptr {
            #[inline]
            pub unsafe fn swap(
                &mut self,
                arg1: *mut crate::core::midi::rtme::root::std::__exception_ptr::exception_ptr,
            ) {
                exception_ptr_swap(self, arg1)
            }
            #[inline]
            pub unsafe fn __cxa_exception_type(
                &self,
            ) -> *const crate::core::midi::rtme::root::std::type_info {
                exception_ptr___cxa_exception_type(self)
            }
            #[inline]
            pub unsafe fn new() -> Self {
                let mut __bindgen_tmp = ::std::mem::uninitialized();
                exception_ptr_exception_ptr(&mut __bindgen_tmp);
                __bindgen_tmp
            }
            #[inline]
            pub unsafe fn new1(
                arg1: *const crate::core::midi::rtme::root::std::__exception_ptr::exception_ptr,
            ) -> Self {
                let mut __bindgen_tmp = ::std::mem::uninitialized();
                exception_ptr_exception_ptr1(&mut __bindgen_tmp, arg1);
                __bindgen_tmp
            }
            #[inline]
            pub unsafe fn destruct(&mut self) {
                exception_ptr_exception_ptr_destructor(self)
            }
        }
    }
    extern "C" {
        pub fn current_exception(
        ) -> crate::core::midi::rtme::root::std::__exception_ptr::exception_ptr;
    }
    extern "C" {
        pub fn rethrow_exception(
            arg1: crate::core::midi::rtme::root::std::__exception_ptr::exception_ptr,
        );
    }
    pub type integral_constant_value_type<_Tp> = _Tp;
    pub type integral_constant_type = u8;
    extern "C" {
        pub static value: _Tp;
    }
    pub type true_type = u8;
    pub type false_type = u8;
    pub type __bool_constant = u8;
    pub type bool_constant = u8;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __or_ {
        pub _address: u8,
    }
    // #[test]
    // fn __bindgen_test_layout___or__open0_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__or_>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__or_)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__or_>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__or_)
    //         )
    //     );
    // }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __and_ {
        pub _address: u8,
    }
    // #[test]
    // fn __bindgen_test_layout___and__open0_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__and_>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__and_)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__and_>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__and_)
    //         )
    //     );
    // }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __not_ {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct conjunction {
        pub _address: u8,
    }
    impl Default for conjunction {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct disjunction {
        pub _address: u8,
    }
    impl Default for disjunction {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct negation {
        pub _address: u8,
    }
    impl Default for negation {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __success_type {
        pub _address: u8,
    }
    pub type __success_type_type<_Tp> = _Tp;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __failure_type {
        pub _address: u8,
    }
    // #[test]
    // fn bindgen_test_layout___failure_type() {
    //     assert_eq!(
    //         ::std::mem::size_of::<__failure_type>(),
    //         1usize,
    //         concat!("Size of: ", stringify!(__failure_type))
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<__failure_type>(),
    //         1usize,
    //         concat!("Alignment of ", stringify!(__failure_type))
    //     );
    // }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __is_void_helper {
        pub _base: crate::core::midi::rtme::root::std::false_type,
    }
    // #[test]
    // fn __bindgen_test_layout___is_void_helper_open0_void_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__is_void_helper>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__is_void_helper)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__is_void_helper>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__is_void_helper)
    //         )
    //     );
    // }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct is_void {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __is_integral_helper {
        pub _base: crate::core::midi::rtme::root::std::false_type,
    }
    // #[test]
    // fn __bindgen_test_layout___is_integral_helper_open0_bool__close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__is_integral_helper>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__is_integral_helper)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__is_integral_helper>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__is_integral_helper)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout___is_integral_helper_open0_char_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__is_integral_helper>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__is_integral_helper)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__is_integral_helper>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__is_integral_helper)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout___is_integral_helper_open0_signed_char_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__is_integral_helper>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__is_integral_helper)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__is_integral_helper>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__is_integral_helper)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout___is_integral_helper_open0_unsigned_char_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__is_integral_helper>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__is_integral_helper)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__is_integral_helper>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__is_integral_helper)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout___is_integral_helper_open0_wchar_t_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__is_integral_helper>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__is_integral_helper)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__is_integral_helper>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__is_integral_helper)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout___is_integral_helper_open0_char16_t_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__is_integral_helper>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__is_integral_helper)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__is_integral_helper>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__is_integral_helper)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout___is_integral_helper_open0_char32_t_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__is_integral_helper>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__is_integral_helper)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__is_integral_helper>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__is_integral_helper)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout___is_integral_helper_open0_short_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__is_integral_helper>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__is_integral_helper)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__is_integral_helper>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__is_integral_helper)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout___is_integral_helper_open0_unsigned_short_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__is_integral_helper>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__is_integral_helper)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__is_integral_helper>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__is_integral_helper)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout___is_integral_helper_open0_int_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__is_integral_helper>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__is_integral_helper)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__is_integral_helper>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__is_integral_helper)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout___is_integral_helper_open0_unsigned_int_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__is_integral_helper>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__is_integral_helper)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__is_integral_helper>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__is_integral_helper)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout___is_integral_helper_open0_long_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__is_integral_helper>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__is_integral_helper)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__is_integral_helper>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__is_integral_helper)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout___is_integral_helper_open0_unsigned_long_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__is_integral_helper>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__is_integral_helper)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__is_integral_helper>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__is_integral_helper)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout___is_integral_helper_open0_long_long_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__is_integral_helper>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__is_integral_helper)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__is_integral_helper>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__is_integral_helper)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout___is_integral_helper_open0_unsigned_long_long_close0_instantiation(
    // ) {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__is_integral_helper>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__is_integral_helper)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__is_integral_helper>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__is_integral_helper)
    //         )
    //     );
    // }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct is_integral {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __is_floating_point_helper {
        pub _base: crate::core::midi::rtme::root::std::false_type,
    }
    // #[test]
    // fn __bindgen_test_layout___is_floating_point_helper_open0_float_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__is_floating_point_helper>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__is_floating_point_helper)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__is_floating_point_helper>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__is_floating_point_helper)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout___is_floating_point_helper_open0_double_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__is_floating_point_helper>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__is_floating_point_helper)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__is_floating_point_helper>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__is_floating_point_helper)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout___is_floating_point_helper_open0_long_double_close0_instantiation()
    // {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__is_floating_point_helper>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__is_floating_point_helper)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__is_floating_point_helper>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__is_floating_point_helper)
    //         )
    //     );
    // }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct is_floating_point {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct is_array {
        pub _base: crate::core::midi::rtme::root::std::false_type,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __is_pointer_helper {
        pub _base: crate::core::midi::rtme::root::std::false_type,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct is_pointer {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct is_lvalue_reference {
        pub _base: crate::core::midi::rtme::root::std::false_type,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct is_rvalue_reference {
        pub _base: crate::core::midi::rtme::root::std::false_type,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __is_member_object_pointer_helper {
        pub _base: crate::core::midi::rtme::root::std::false_type,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct is_member_object_pointer {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __is_member_function_pointer_helper {
        pub _base: crate::core::midi::rtme::root::std::false_type,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct is_member_function_pointer {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct is_enum {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct is_union {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct is_class {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct is_function {
        pub _base: crate::core::midi::rtme::root::std::false_type,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __is_null_pointer_helper {
        pub _base: crate::core::midi::rtme::root::std::false_type,
    }
    // #[test]
    // fn __bindgen_test_layout___is_null_pointer_helper_open0_nullptr_t_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__is_null_pointer_helper>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__is_null_pointer_helper)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__is_null_pointer_helper>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__is_null_pointer_helper)
    //         )
    //     );
    // }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct is_null_pointer {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __is_nullptr_t {
        pub _address: u8,
    }
    impl Default for __is_nullptr_t {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct is_reference {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct is_arithmetic {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct is_fundamental {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct is_object {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct is_scalar {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct is_compound {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __is_member_pointer_helper {
        pub _base: crate::core::midi::rtme::root::std::false_type,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct is_member_pointer {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __is_referenceable {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct is_const {
        pub _base: crate::core::midi::rtme::root::std::false_type,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct is_volatile {
        pub _base: crate::core::midi::rtme::root::std::false_type,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct is_trivial {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct is_trivially_copyable {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct is_standard_layout {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct is_pod {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct is_literal_type {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct is_empty {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct is_polymorphic {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct is_final {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct is_abstract {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct is_signed {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct is_unsigned {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __is_array_known_bounds {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __is_array_unknown_bounds {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __do_is_destructible_impl {
        pub _address: u8,
    }
    // #[test]
    // fn bindgen_test_layout___do_is_destructible_impl() {
    //     assert_eq!(
    //         ::std::mem::size_of::<__do_is_destructible_impl>(),
    //         1usize,
    //         concat!("Size of: ", stringify!(__do_is_destructible_impl))
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<__do_is_destructible_impl>(),
    //         1usize,
    //         concat!("Alignment of ", stringify!(__do_is_destructible_impl))
    //     );
    // }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __is_destructible_impl {
        pub _address: u8,
    }
    pub type __is_destructible_impl_type<_Tp> = _Tp;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct is_destructible {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __do_is_nt_destructible_impl {
        pub _address: u8,
    }
    // #[test]
    // fn bindgen_test_layout___do_is_nt_destructible_impl() {
    //     assert_eq!(
    //         ::std::mem::size_of::<__do_is_nt_destructible_impl>(),
    //         1usize,
    //         concat!("Size of: ", stringify!(__do_is_nt_destructible_impl))
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<__do_is_nt_destructible_impl>(),
    //         1usize,
    //         concat!("Alignment of ", stringify!(__do_is_nt_destructible_impl))
    //     );
    // }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __is_nt_destructible_impl {
        pub _address: u8,
    }
    pub type __is_nt_destructible_impl_type<_Tp> = _Tp;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct is_nothrow_destructible {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __do_is_default_constructible_impl {
        pub _address: u8,
    }
    // #[test]
    // fn bindgen_test_layout___do_is_default_constructible_impl() {
    //     assert_eq!(
    //         ::std::mem::size_of::<__do_is_default_constructible_impl>(),
    //         1usize,
    //         concat!("Size of: ", stringify!(__do_is_default_constructible_impl))
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<__do_is_default_constructible_impl>(),
    //         1usize,
    //         concat!(
    //             "Alignment of ",
    //             stringify!(__do_is_default_constructible_impl)
    //         )
    //     );
    // }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __is_default_constructible_impl {
        pub _address: u8,
    }
    pub type __is_default_constructible_impl_type<_Tp> = _Tp;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __is_default_constructible_atom {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct is_default_constructible {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct is_constructible {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct is_copy_constructible {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct is_move_constructible {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __is_nt_default_constructible_atom {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct is_nothrow_default_constructible {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __is_nt_constructible_impl {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct is_nothrow_constructible {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct is_nothrow_copy_constructible {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct is_nothrow_move_constructible {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct is_assignable {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct is_copy_assignable {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct is_move_assignable {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __is_nt_assignable_impl {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct is_nothrow_assignable {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct is_nothrow_copy_assignable {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct is_nothrow_move_assignable {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct is_trivially_constructible {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct is_trivially_default_constructible {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __do_is_implicitly_default_constructible_impl {
        pub _address: u8,
    }
    // #[test]
    // fn bindgen_test_layout___do_is_implicitly_default_constructible_impl() {
    //     assert_eq!(
    //         ::std::mem::size_of::<__do_is_implicitly_default_constructible_impl>(),
    //         1usize,
    //         concat!(
    //             "Size of: ",
    //             stringify!(__do_is_implicitly_default_constructible_impl)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<__do_is_implicitly_default_constructible_impl>(),
    //         1usize,
    //         concat!(
    //             "Alignment of ",
    //             stringify!(__do_is_implicitly_default_constructible_impl)
    //         )
    //     );
    // }
    extern "C" {
        #[link_name = "\u{1}__test"]
        pub fn __do_is_implicitly_default_constructible_impl___test(
        ) -> crate::core::midi::rtme::root::std::false_type;
    }
    impl __do_is_implicitly_default_constructible_impl {
        #[inline]
        pub unsafe fn __test() -> crate::core::midi::rtme::root::std::false_type {
            __do_is_implicitly_default_constructible_impl___test()
        }
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __is_implicitly_default_constructible_impl {
        pub _address: u8,
    }
    pub type __is_implicitly_default_constructible_impl_type<_Tp> = _Tp;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __is_implicitly_default_constructible_safe {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __is_implicitly_default_constructible {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct is_trivially_copy_constructible {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct is_trivially_move_constructible {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct is_trivially_assignable {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct is_trivially_copy_assignable {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct is_trivially_move_assignable {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct is_trivially_destructible {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct has_virtual_destructor {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct alignment_of {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct rank {
        pub _base: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct is_same {
        pub _base: crate::core::midi::rtme::root::std::false_type,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct is_base_of {
        pub _address: u8,
    }
    pub type __is_convertible_helper_type = crate::core::midi::rtme::root::std::is_void;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct is_convertible {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct remove_const {
        pub _address: u8,
    }
    pub type remove_const_type<_Tp> = _Tp;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct remove_volatile {
        pub _address: u8,
    }
    pub type remove_volatile_type<_Tp> = _Tp;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct remove_cv {
        pub _address: u8,
    }
    pub type remove_cv_type = crate::core::midi::rtme::root::std::remove_const;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct add_const {
        pub _address: u8,
    }
    pub type add_const_type<_Tp> = _Tp;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct add_volatile {
        pub _address: u8,
    }
    pub type add_volatile_type<_Tp> = _Tp;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct add_cv {
        pub _address: u8,
    }
    pub type add_cv_type = crate::core::midi::rtme::root::std::add_const;
    pub type remove_const_t = crate::core::midi::rtme::root::std::remove_const;
    pub type remove_volatile_t = crate::core::midi::rtme::root::std::remove_volatile;
    pub type remove_cv_t = crate::core::midi::rtme::root::std::remove_cv;
    pub type add_const_t = crate::core::midi::rtme::root::std::add_const;
    pub type add_volatile_t = crate::core::midi::rtme::root::std::add_volatile;
    pub type add_cv_t = crate::core::midi::rtme::root::std::add_cv;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct remove_reference {
        pub _address: u8,
    }
    pub type remove_reference_type<_Tp> = _Tp;
    pub type __add_lvalue_reference_helper_type<_Tp> = _Tp;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct add_lvalue_reference {
        pub _address: u8,
    }
    pub type __add_rvalue_reference_helper_type<_Tp> = _Tp;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct add_rvalue_reference {
        pub _address: u8,
    }
    pub type remove_reference_t = crate::core::midi::rtme::root::std::remove_reference;
    pub type add_lvalue_reference_t = crate::core::midi::rtme::root::std::add_lvalue_reference;
    pub type add_rvalue_reference_t = crate::core::midi::rtme::root::std::add_rvalue_reference;
    pub type __match_cv_qualifiers___match = u8;
    pub type __match_cv_qualifiers___type =
        crate::core::midi::rtme::root::std::__match_cv_qualifiers___match;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __make_unsigned {
        pub _address: u8,
    }
    pub type __make_unsigned___type<_Tp> = _Tp;
    // #[test]
    // fn __bindgen_test_layout___make_unsigned_open0_char_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__make_unsigned>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__make_unsigned)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__make_unsigned>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__make_unsigned)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout___make_unsigned_open0_signed_char_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__make_unsigned>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__make_unsigned)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__make_unsigned>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__make_unsigned)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout___make_unsigned_open0_short_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__make_unsigned>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__make_unsigned)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__make_unsigned>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__make_unsigned)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout___make_unsigned_open0_int_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__make_unsigned>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__make_unsigned)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__make_unsigned>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__make_unsigned)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout___make_unsigned_open0_long_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__make_unsigned>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__make_unsigned)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__make_unsigned>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__make_unsigned)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout___make_unsigned_open0_long_long_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__make_unsigned>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__make_unsigned)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__make_unsigned>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__make_unsigned)
    //         )
    //     );
    // }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct make_unsigned {
        pub _address: u8,
    }
    pub type make_unsigned_type = u8;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __make_signed {
        pub _address: u8,
    }
    pub type __make_signed___type<_Tp> = _Tp;
    // #[test]
    // fn __bindgen_test_layout___make_signed_open0_char_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__make_signed>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__make_signed)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__make_signed>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__make_signed)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout___make_signed_open0_unsigned_char_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__make_signed>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__make_signed)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__make_signed>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__make_signed)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout___make_signed_open0_unsigned_short_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__make_signed>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__make_signed)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__make_signed>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__make_signed)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout___make_signed_open0_unsigned_int_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__make_signed>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__make_signed)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__make_signed>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__make_signed)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout___make_signed_open0_unsigned_long_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__make_signed>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__make_signed)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__make_signed>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__make_signed)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout___make_signed_open0_unsigned_long_long_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__make_signed>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__make_signed)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__make_signed>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__make_signed)
    //         )
    //     );
    // }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct make_signed {
        pub _address: u8,
    }
    pub type make_signed_type = u8;
    pub type make_signed_t = crate::core::midi::rtme::root::std::make_signed;
    pub type make_unsigned_t = crate::core::midi::rtme::root::std::make_unsigned;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct remove_extent {
        pub _address: u8,
    }
    pub type remove_extent_type<_Tp> = _Tp;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct remove_all_extents {
        pub _address: u8,
    }
    pub type remove_all_extents_type<_Tp> = _Tp;
    pub type remove_extent_t = crate::core::midi::rtme::root::std::remove_extent;
    pub type remove_all_extents_t = crate::core::midi::rtme::root::std::remove_all_extents;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __remove_pointer_helper {
        pub _address: u8,
    }
    pub type __remove_pointer_helper_type<_Tp> = _Tp;
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct remove_pointer {
        pub _address: u8,
    }
    impl Default for remove_pointer {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    pub type __add_pointer_helper_type<_Tp> = _Tp;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct add_pointer {
        pub _address: u8,
    }
    pub type remove_pointer_t = crate::core::midi::rtme::root::std::remove_pointer;
    pub type add_pointer_t = crate::core::midi::rtme::root::std::add_pointer;
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub union __aligned_storage_msa___type {
        pub __data: *mut ::std::os::raw::c_uchar,
        pub __align: crate::core::midi::rtme::root::std::__aligned_storage_msa___type__bindgen_ty_1,
        _bindgen_union_align: u64,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __aligned_storage_msa___type__bindgen_ty_1 {
        pub _address: u8,
    }
    // #[test]
    // fn bindgen_test_layout___aligned_storage_msa___type() {
    //     assert_eq!(
    //         ::std::mem::size_of::<__aligned_storage_msa___type>(),
    //         8usize,
    //         concat!("Size of: ", stringify!(__aligned_storage_msa___type))
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<__aligned_storage_msa___type>(),
    //         8usize,
    //         concat!("Alignment of ", stringify!(__aligned_storage_msa___type))
    //     );
    // }
    impl Default for __aligned_storage_msa___type {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    impl ::std::fmt::Debug for __aligned_storage_msa___type {
        fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
            write!(f, "__aligned_storage_msa___type {{ union }}")
        }
    }
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub union aligned_storage_type {
        pub __data: *mut ::std::os::raw::c_uchar,
        pub __align: crate::core::midi::rtme::root::std::aligned_storage_type__bindgen_ty_1,
        _bindgen_union_align: u64,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct aligned_storage_type__bindgen_ty_1 {
        pub _address: u8,
    }
    // #[test]
    // fn bindgen_test_layout_aligned_storage_type() {
    //     assert_eq!(
    //         ::std::mem::size_of::<aligned_storage_type>(),
    //         8usize,
    //         concat!("Size of: ", stringify!(aligned_storage_type))
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<aligned_storage_type>(),
    //         8usize,
    //         concat!("Alignment of ", stringify!(aligned_storage_type))
    //     );
    // }
    impl Default for aligned_storage_type {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    impl ::std::fmt::Debug for aligned_storage_type {
        fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
            write!(f, "aligned_storage_type {{ union }}")
        }
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __strictest_alignment {
        pub _address: u8,
    }
    pub type aligned_union___strictest = crate::core::midi::rtme::root::std::__strictest_alignment;
    pub type aligned_union_type = u8;
    extern "C" {
        pub static alignment_value: usize;
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct decay {
        pub _address: u8,
    }
    pub type decay___remove_type = crate::core::midi::rtme::root::std::remove_reference;
    pub type decay_type = u8;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct reference_wrapper {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __strip_reference_wrapper {
        pub _address: u8,
    }
    pub type __strip_reference_wrapper___type<_Tp> = _Tp;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __decay_and_strip {
        pub _address: u8,
    }
    pub type __decay_and_strip___type =
        crate::core::midi::rtme::root::std::__strip_reference_wrapper;
    pub type _Require = u8;
    pub type conditional_type<_Iftrue> = _Iftrue;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct common_type {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __do_common_type_impl {
        pub _address: u8,
    }
    // #[test]
    // fn bindgen_test_layout___do_common_type_impl() {
    //     assert_eq!(
    //         ::std::mem::size_of::<__do_common_type_impl>(),
    //         1usize,
    //         concat!("Size of: ", stringify!(__do_common_type_impl))
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<__do_common_type_impl>(),
    //         1usize,
    //         concat!("Alignment of ", stringify!(__do_common_type_impl))
    //     );
    // }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __common_type_impl {
        pub _address: u8,
    }
    pub type __common_type_impl_type<_Tp> = _Tp;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __do_member_type_wrapper {
        pub _address: u8,
    }
    // #[test]
    // fn bindgen_test_layout___do_member_type_wrapper() {
    //     assert_eq!(
    //         ::std::mem::size_of::<__do_member_type_wrapper>(),
    //         1usize,
    //         concat!("Size of: ", stringify!(__do_member_type_wrapper))
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<__do_member_type_wrapper>(),
    //         1usize,
    //         concat!("Alignment of ", stringify!(__do_member_type_wrapper))
    //     );
    // }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __member_type_wrapper {
        pub _address: u8,
    }
    pub type __member_type_wrapper_type<_Tp> = _Tp;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __expanded_common_type_wrapper {
        pub _address: u8,
    }
    pub type __expanded_common_type_wrapper_type = crate::core::midi::rtme::root::std::common_type;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct underlying_type {
        pub _address: u8,
    }
    pub type underlying_type_type<_Tp> = _Tp;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __declval_protector {
        pub _address: u8,
    }
    // #[test]
    // fn __bindgen_test_layout___make_unsigned_open0_wchar_t_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__make_unsigned>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__make_unsigned)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__make_unsigned>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__make_unsigned)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout___make_signed_open0_wchar_t_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__make_signed>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__make_signed)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__make_signed>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__make_signed)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout___make_unsigned_open0_char16_t_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__make_unsigned>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__make_unsigned)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__make_unsigned>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__make_unsigned)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout___make_signed_open0_char16_t_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__make_signed>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__make_signed)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__make_signed>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__make_signed)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout___make_unsigned_open0_char32_t_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__make_unsigned>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__make_unsigned)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__make_unsigned>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__make_unsigned)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout___make_signed_open0_char32_t_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__make_signed>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__make_signed)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__make_signed>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__make_signed)
    //         )
    //     );
    // }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct result_of {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __invoke_memfun_ref {
        pub _address: u8,
    }
    // #[test]
    // fn bindgen_test_layout___invoke_memfun_ref() {
    //     assert_eq!(
    //         ::std::mem::size_of::<__invoke_memfun_ref>(),
    //         1usize,
    //         concat!("Size of: ", stringify!(__invoke_memfun_ref))
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<__invoke_memfun_ref>(),
    //         1usize,
    //         concat!("Alignment of ", stringify!(__invoke_memfun_ref))
    //     );
    // }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __invoke_memfun_deref {
        pub _address: u8,
    }
    // #[test]
    // fn bindgen_test_layout___invoke_memfun_deref() {
    //     assert_eq!(
    //         ::std::mem::size_of::<__invoke_memfun_deref>(),
    //         1usize,
    //         concat!("Size of: ", stringify!(__invoke_memfun_deref))
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<__invoke_memfun_deref>(),
    //         1usize,
    //         concat!("Alignment of ", stringify!(__invoke_memfun_deref))
    //     );
    // }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __invoke_memobj_ref {
        pub _address: u8,
    }
    // #[test]
    // fn bindgen_test_layout___invoke_memobj_ref() {
    //     assert_eq!(
    //         ::std::mem::size_of::<__invoke_memobj_ref>(),
    //         1usize,
    //         concat!("Size of: ", stringify!(__invoke_memobj_ref))
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<__invoke_memobj_ref>(),
    //         1usize,
    //         concat!("Alignment of ", stringify!(__invoke_memobj_ref))
    //     );
    // }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __invoke_memobj_deref {
        pub _address: u8,
    }
    // #[test]
    // fn bindgen_test_layout___invoke_memobj_deref() {
    //     assert_eq!(
    //         ::std::mem::size_of::<__invoke_memobj_deref>(),
    //         1usize,
    //         concat!("Size of: ", stringify!(__invoke_memobj_deref))
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<__invoke_memobj_deref>(),
    //         1usize,
    //         concat!("Alignment of ", stringify!(__invoke_memobj_deref))
    //     );
    // }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __invoke_other {
        pub _address: u8,
    }
    // #[test]
    // fn bindgen_test_layout___invoke_other() {
    //     assert_eq!(
    //         ::std::mem::size_of::<__invoke_other>(),
    //         1usize,
    //         concat!("Size of: ", stringify!(__invoke_other))
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<__invoke_other>(),
    //         1usize,
    //         concat!("Alignment of ", stringify!(__invoke_other))
    //     );
    // }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __result_of_success {
        pub _address: u8,
    }
    pub type __result_of_success___invoke_type<_Tag> = _Tag;
    impl Default for __result_of_success {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __result_of_memfun_ref_impl {
        pub _address: u8,
    }
    // #[test]
    // fn bindgen_test_layout___result_of_memfun_ref_impl() {
    //     assert_eq!(
    //         ::std::mem::size_of::<__result_of_memfun_ref_impl>(),
    //         1usize,
    //         concat!("Size of: ", stringify!(__result_of_memfun_ref_impl))
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<__result_of_memfun_ref_impl>(),
    //         1usize,
    //         concat!("Alignment of ", stringify!(__result_of_memfun_ref_impl))
    //     );
    // }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __result_of_memfun_ref {
        pub _address: u8,
    }
    pub type __result_of_memfun_ref_type<_MemPtr> = _MemPtr;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __result_of_memfun_deref_impl {
        pub _address: u8,
    }
    // #[test]
    // fn bindgen_test_layout___result_of_memfun_deref_impl() {
    //     assert_eq!(
    //         ::std::mem::size_of::<__result_of_memfun_deref_impl>(),
    //         1usize,
    //         concat!("Size of: ", stringify!(__result_of_memfun_deref_impl))
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<__result_of_memfun_deref_impl>(),
    //         1usize,
    //         concat!("Alignment of ", stringify!(__result_of_memfun_deref_impl))
    //     );
    // }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __result_of_memfun_deref {
        pub _address: u8,
    }
    pub type __result_of_memfun_deref_type<_MemPtr> = _MemPtr;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __result_of_memobj_ref_impl {
        pub _address: u8,
    }
    // #[test]
    // fn bindgen_test_layout___result_of_memobj_ref_impl() {
    //     assert_eq!(
    //         ::std::mem::size_of::<__result_of_memobj_ref_impl>(),
    //         1usize,
    //         concat!("Size of: ", stringify!(__result_of_memobj_ref_impl))
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<__result_of_memobj_ref_impl>(),
    //         1usize,
    //         concat!("Alignment of ", stringify!(__result_of_memobj_ref_impl))
    //     );
    // }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __result_of_memobj_ref {
        pub _address: u8,
    }
    pub type __result_of_memobj_ref_type<_MemPtr> = _MemPtr;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __result_of_memobj_deref_impl {
        pub _address: u8,
    }
    // #[test]
    // fn bindgen_test_layout___result_of_memobj_deref_impl() {
    //     assert_eq!(
    //         ::std::mem::size_of::<__result_of_memobj_deref_impl>(),
    //         1usize,
    //         concat!("Size of: ", stringify!(__result_of_memobj_deref_impl))
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<__result_of_memobj_deref_impl>(),
    //         1usize,
    //         concat!("Alignment of ", stringify!(__result_of_memobj_deref_impl))
    //     );
    // }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __result_of_memobj_deref {
        pub _address: u8,
    }
    pub type __result_of_memobj_deref_type<_MemPtr> = _MemPtr;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __result_of_memobj {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __result_of_memfun {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __inv_unwrap {
        pub _address: u8,
    }
    pub type __inv_unwrap_type<_Tp> = _Tp;
    pub type __result_of_impl_type = crate::core::midi::rtme::root::std::__failure_type;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __result_of_other_impl {
        pub _address: u8,
    }
    // #[test]
    // fn bindgen_test_layout___result_of_other_impl() {
    //     assert_eq!(
    //         ::std::mem::size_of::<__result_of_other_impl>(),
    //         1usize,
    //         concat!("Size of: ", stringify!(__result_of_other_impl))
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<__result_of_other_impl>(),
    //         1usize,
    //         concat!("Alignment of ", stringify!(__result_of_other_impl))
    //     );
    // }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __invoke_result {
        pub _address: u8,
    }
    pub type aligned_storage_t = u8;
    pub type aligned_union_t = u8;
    pub type decay_t = crate::core::midi::rtme::root::std::decay;
    pub type enable_if_t = u8;
    pub type conditional_t = u8;
    pub type common_type_t = crate::core::midi::rtme::root::std::common_type;
    pub type underlying_type_t = crate::core::midi::rtme::root::std::underlying_type;
    pub type result_of_t = crate::core::midi::rtme::root::std::result_of;
    pub type __enable_if_t = u8;
    pub type __void_t = ::std::os::raw::c_void;
    pub type void_t = ::std::os::raw::c_void;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __detector {
        pub _address: u8,
    }
    pub type __detector_value_t = crate::core::midi::rtme::root::std::false_type;
    pub type __detector_type<_Default> = _Default;
    pub type __detected_or = crate::core::midi::rtme::root::std::__detector;
    pub type __detected_or_t = crate::core::midi::rtme::root::std::__detected_or;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct tuple {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __is_tuple_like_impl {
        pub _base: crate::core::midi::rtme::root::std::false_type,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __is_tuple_like {
        pub _address: u8,
    }
    pub mod __swappable_details {

        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __do_is_swappable_impl {
            pub _address: u8,
        }
        // #[test]
        // fn bindgen_test_layout___do_is_swappable_impl() {
        //     assert_eq!(
        //         ::std::mem::size_of::<__do_is_swappable_impl>(),
        //         1usize,
        //         concat!("Size of: ", stringify!(__do_is_swappable_impl))
        //     );
        //     assert_eq!(
        //         ::std::mem::align_of::<__do_is_swappable_impl>(),
        //         1usize,
        //         concat!("Alignment of ", stringify!(__do_is_swappable_impl))
        //     );
        // }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __do_is_nothrow_swappable_impl {
            pub _address: u8,
        }
        // #[test]
        // fn bindgen_test_layout___do_is_nothrow_swappable_impl() {
        //     assert_eq!(
        //         ::std::mem::size_of::<__do_is_nothrow_swappable_impl>(),
        //         1usize,
        //         concat!("Size of: ", stringify!(__do_is_nothrow_swappable_impl))
        //     );
        //     assert_eq!(
        //         ::std::mem::align_of::<__do_is_nothrow_swappable_impl>(),
        //         1usize,
        //         concat!("Alignment of ", stringify!(__do_is_nothrow_swappable_impl))
        //     );
        // }
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __is_swappable_impl {
        pub _address: u8,
    }
    pub type __is_swappable_impl_type<_Tp> = _Tp;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __is_nothrow_swappable_impl {
        pub _address: u8,
    }
    pub type __is_nothrow_swappable_impl_type<_Tp> = _Tp;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __is_swappable {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __is_nothrow_swappable {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct is_swappable {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct is_nothrow_swappable {
        pub _address: u8,
    }
    pub mod __swappable_with_details {

        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __do_is_swappable_with_impl {
            pub _address: u8,
        }
        // #[test]
        // fn bindgen_test_layout___do_is_swappable_with_impl() {
        //     assert_eq!(
        //         ::std::mem::size_of::<__do_is_swappable_with_impl>(),
        //         1usize,
        //         concat!("Size of: ", stringify!(__do_is_swappable_with_impl))
        //     );
        //     assert_eq!(
        //         ::std::mem::align_of::<__do_is_swappable_with_impl>(),
        //         1usize,
        //         concat!("Alignment of ", stringify!(__do_is_swappable_with_impl))
        //     );
        // }
        #[repr(C)]
        #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct __do_is_nothrow_swappable_with_impl {
            pub _address: u8,
        }
        // #[test]
        // fn bindgen_test_layout___do_is_nothrow_swappable_with_impl() {
        //     assert_eq!(
        //         ::std::mem::size_of::<__do_is_nothrow_swappable_with_impl>(),
        //         1usize,
        //         concat!("Size of: ", stringify!(__do_is_nothrow_swappable_with_impl))
        //     );
        //     assert_eq!(
        //         ::std::mem::align_of::<__do_is_nothrow_swappable_with_impl>(),
        //         1usize,
        //         concat!(
        //             "Alignment of ",
        //             stringify!(__do_is_nothrow_swappable_with_impl)
        //         )
        //     );
        // }
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __is_swappable_with_impl {
        pub _address: u8,
    }
    pub type __is_swappable_with_impl_type<_Tp> = _Tp;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __is_nothrow_swappable_with_impl {
        pub _address: u8,
    }
    pub type __is_nothrow_swappable_with_impl_type<_Tp> = _Tp;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct is_swappable_with {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct is_nothrow_swappable_with {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __is_invocable_impl {
        pub _base: crate::core::midi::rtme::root::std::false_type,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __is_invocable {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __call_is_nothrow {
        pub _address: u8,
    }
    pub type __call_is_nothrow_ = crate::core::midi::rtme::root::std::__call_is_nothrow;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __is_nothrow_invocable {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __nonesuch {
        pub _address: u8,
    }
    // #[test]
    // fn bindgen_test_layout___nonesuch() {
    //     assert_eq!(
    //         ::std::mem::size_of::<__nonesuch>(),
    //         1usize,
    //         concat!("Size of: ", stringify!(__nonesuch))
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<__nonesuch>(),
    //         1usize,
    //         concat!("Alignment of ", stringify!(__nonesuch))
    //     );
    // }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct invoke_result {
        pub _address: u8,
    }
    impl Default for invoke_result {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    pub type invoke_result_t = crate::core::midi::rtme::root::std::invoke_result;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct is_invocable {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct is_invocable_r {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct is_nothrow_invocable {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __is_nt_invocable_impl {
        pub _base: crate::core::midi::rtme::root::std::false_type,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct is_nothrow_invocable_r {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct has_unique_object_representations {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct is_aggregate {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __move_if_noexcept_cond {
        pub _address: u8,
    }
    #[repr(C)]
    pub struct nested_exception__bindgen_vtable(::std::os::raw::c_void);
    #[repr(C)]
    #[derive(Debug, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct nested_exception {
        pub vtable_: *const nested_exception__bindgen_vtable,
        pub _M_ptr: crate::core::midi::rtme::root::std::__exception_ptr::exception_ptr,
    }
    // #[test]
    // fn bindgen_test_layout_nested_exception() {
    //     assert_eq!(
    //         ::std::mem::size_of::<nested_exception>(),
    //         16usize,
    //         concat!("Size of: ", stringify!(nested_exception))
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<nested_exception>(),
    //         8usize,
    //         concat!("Alignment of ", stringify!(nested_exception))
    //     );
    //     assert_eq!(
    //         unsafe { &(*(::std::ptr::null::<nested_exception>()))._M_ptr as *const _ as usize },
    //         8usize,
    //         concat!(
    //             "Offset of field: ",
    //             stringify!(nested_exception),
    //             "::",
    //             stringify!(_M_ptr)
    //         )
    //     );
    // }
    impl Default for nested_exception {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    extern "C" {
        #[link_name = "\u{1}nested_exception_destructor"]
        pub fn nested_exception_nested_exception_destructor(
            this: *mut crate::core::midi::rtme::root::std::nested_exception,
        );
    }
    #[repr(C)]
    #[derive(Debug, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct _Nested_exception<_Except> {
        pub _base: _Except,
        pub _base_1: crate::core::midi::rtme::root::std::nested_exception,
        pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Except>>,
    }
    impl<_Except> Default for _Nested_exception<_Except> {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    pub type __rethrow_if_nested_cond = u8;
    pub type streamoff = ::std::os::raw::c_long;
    pub type streamsize = isize;
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct fpos<_StateT> {
        pub _M_off: crate::core::midi::rtme::root::std::streamoff,
        pub _M_state: _StateT,
        pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_StateT>>,
    }
    impl<_StateT> Default for fpos<_StateT> {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    pub type streampos = crate::core::midi::rtme::root::std::fpos<root::mbstate_t>;
    pub type wstreampos = crate::core::midi::rtme::root::std::fpos<root::mbstate_t>;
    pub type u16streampos = crate::core::midi::rtme::root::std::fpos<root::mbstate_t>;
    pub type u32streampos = crate::core::midi::rtme::root::std::fpos<root::mbstate_t>;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct basic_filebuf {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct basic_ifstream {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct basic_ofstream {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct basic_fstream {
        pub _address: u8,
    }
    pub type ios = crate::core::midi::rtme::root::std::basic_ios<::std::os::raw::c_char>;
    pub type streambuf =
        crate::core::midi::rtme::root::std::basic_streambuf<::std::os::raw::c_char>;
    pub type istream = crate::core::midi::rtme::root::std::basic_istream<::std::os::raw::c_char>;
    pub type ostream = crate::core::midi::rtme::root::std::basic_ostream<::std::os::raw::c_char>;
    pub type iostream = crate::core::midi::rtme::root::std::basic_iostream<::std::os::raw::c_char>;
    pub type stringbuf = crate::core::midi::rtme::root::std::__cxx11::basic_stringbuf;
    pub type istringstream = crate::core::midi::rtme::root::std::__cxx11::basic_istringstream;
    pub type ostringstream = crate::core::midi::rtme::root::std::__cxx11::basic_ostringstream;
    pub type stringstream = crate::core::midi::rtme::root::std::__cxx11::basic_stringstream;
    pub type filebuf = crate::core::midi::rtme::root::std::basic_filebuf;
    pub type ifstream = crate::core::midi::rtme::root::std::basic_ifstream;
    pub type ofstream = crate::core::midi::rtme::root::std::basic_ofstream;
    pub type fstream = crate::core::midi::rtme::root::std::basic_fstream;
    pub type wios = crate::core::midi::rtme::root::std::basic_ios<u32>;
    pub type wstreambuf = crate::core::midi::rtme::root::std::basic_streambuf<u32>;
    pub type wistream = crate::core::midi::rtme::root::std::basic_istream<u32>;
    pub type wostream = crate::core::midi::rtme::root::std::basic_ostream<u32>;
    pub type wiostream = crate::core::midi::rtme::root::std::basic_iostream<u32>;
    pub type wstringbuf = crate::core::midi::rtme::root::std::__cxx11::basic_stringbuf;
    pub type wistringstream = crate::core::midi::rtme::root::std::__cxx11::basic_istringstream;
    pub type wostringstream = crate::core::midi::rtme::root::std::__cxx11::basic_ostringstream;
    pub type wstringstream = crate::core::midi::rtme::root::std::__cxx11::basic_stringstream;
    pub type wfilebuf = crate::core::midi::rtme::root::std::basic_filebuf;
    pub type wifstream = crate::core::midi::rtme::root::std::basic_ifstream;
    pub type wofstream = crate::core::midi::rtme::root::std::basic_ofstream;
    pub type wfstream = crate::core::midi::rtme::root::std::basic_fstream;
    extern "C" {
        pub fn __throw_bad_exception();
    }
    extern "C" {
        pub fn __throw_bad_alloc();
    }
    extern "C" {
        pub fn __throw_bad_cast();
    }
    extern "C" {
        pub fn __throw_bad_typeid();
    }
    extern "C" {
        pub fn __throw_logic_error(arg1: *const ::std::os::raw::c_char);
    }
    extern "C" {
        pub fn __throw_domain_error(arg1: *const ::std::os::raw::c_char);
    }
    extern "C" {
        pub fn __throw_invalid_argument(arg1: *const ::std::os::raw::c_char);
    }
    extern "C" {
        pub fn __throw_length_error(arg1: *const ::std::os::raw::c_char);
    }
    extern "C" {
        pub fn __throw_out_of_range(arg1: *const ::std::os::raw::c_char);
    }
    extern "C" {
        pub fn __throw_out_of_range_fmt(arg1: *const ::std::os::raw::c_char, ...);
    }
    extern "C" {
        pub fn __throw_runtime_error(arg1: *const ::std::os::raw::c_char);
    }
    extern "C" {
        pub fn __throw_range_error(arg1: *const ::std::os::raw::c_char);
    }
    extern "C" {
        pub fn __throw_overflow_error(arg1: *const ::std::os::raw::c_char);
    }
    extern "C" {
        pub fn __throw_underflow_error(arg1: *const ::std::os::raw::c_char);
    }
    extern "C" {
        pub fn __throw_ios_failure(arg1: *const ::std::os::raw::c_char);
    }
    extern "C" {
        pub fn __throw_system_error(arg1: ::std::os::raw::c_int);
    }
    extern "C" {
        pub fn __throw_future_error(arg1: ::std::os::raw::c_int);
    }
    extern "C" {
        pub fn __throw_bad_function_call();
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __true_type {
        pub _address: u8,
    }
    // #[test]
    // fn bindgen_test_layout___true_type() {
    //     assert_eq!(
    //         ::std::mem::size_of::<__true_type>(),
    //         1usize,
    //         concat!("Size of: ", stringify!(__true_type))
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<__true_type>(),
    //         1usize,
    //         concat!("Alignment of ", stringify!(__true_type))
    //     );
    // }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __false_type {
        pub _address: u8,
    }
    // #[test]
    // fn bindgen_test_layout___false_type() {
    //     assert_eq!(
    //         ::std::mem::size_of::<__false_type>(),
    //         1usize,
    //         concat!("Size of: ", stringify!(__false_type))
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<__false_type>(),
    //         1usize,
    //         concat!("Alignment of ", stringify!(__false_type))
    //     );
    // }
    pub type __truth_type___type = crate::core::midi::rtme::root::std::__false_type;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __traitor {
        pub _address: u8,
    }
    pub const __traitor___value: crate::core::midi::rtme::root::std::__traitor__bindgen_ty_1 = 0;
    pub type __traitor__bindgen_ty_1 = i32;
    pub type __traitor___type = u8;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __are_same {
        pub _address: u8,
    }
    pub const __are_same___value: crate::core::midi::rtme::root::std::__are_same__bindgen_ty_1 = 0;
    pub type __are_same__bindgen_ty_1 = i32;
    pub type __are_same___type = crate::core::midi::rtme::root::std::__false_type;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __is_void {
        pub _address: u8,
    }
    pub const __is_void___value: crate::core::midi::rtme::root::std::__is_void__bindgen_ty_1 = 0;
    pub type __is_void__bindgen_ty_1 = i32;
    pub type __is_void___type = crate::core::midi::rtme::root::std::__false_type;
    // #[test]
    // fn __bindgen_test_layout___is_void_open0_void_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__is_void>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__is_void)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__is_void>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__is_void)
    //         )
    //     );
    // }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __is_integer {
        pub _address: u8,
    }
    pub const __is_integer___value: crate::core::midi::rtme::root::std::__is_integer__bindgen_ty_1 =
        0;
    pub type __is_integer__bindgen_ty_1 = i32;
    pub type __is_integer___type = crate::core::midi::rtme::root::std::__false_type;
    // #[test]
    // fn __bindgen_test_layout___is_integer_open0_bool__close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__is_integer>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__is_integer)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__is_integer>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__is_integer)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout___is_integer_open0_char_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__is_integer>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__is_integer)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__is_integer>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__is_integer)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout___is_integer_open0_signed_char_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__is_integer>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__is_integer)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__is_integer>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__is_integer)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout___is_integer_open0_unsigned_char_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__is_integer>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__is_integer)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__is_integer>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__is_integer)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout___is_integer_open0_wchar_t_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__is_integer>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__is_integer)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__is_integer>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__is_integer)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout___is_integer_open0_char16_t_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__is_integer>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__is_integer)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__is_integer>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__is_integer)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout___is_integer_open0_char32_t_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__is_integer>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__is_integer)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__is_integer>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__is_integer)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout___is_integer_open0_short_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__is_integer>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__is_integer)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__is_integer>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__is_integer)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout___is_integer_open0_unsigned_short_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__is_integer>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__is_integer)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__is_integer>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__is_integer)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout___is_integer_open0_int_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__is_integer>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__is_integer)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__is_integer>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__is_integer)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout___is_integer_open0_unsigned_int_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__is_integer>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__is_integer)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__is_integer>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__is_integer)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout___is_integer_open0_long_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__is_integer>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__is_integer)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__is_integer>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__is_integer)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout___is_integer_open0_unsigned_long_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__is_integer>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__is_integer)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__is_integer>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__is_integer)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout___is_integer_open0_long_long_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__is_integer>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__is_integer)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__is_integer>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__is_integer)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout___is_integer_open0_unsigned_long_long_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__is_integer>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__is_integer)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__is_integer>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__is_integer)
    //         )
    //     );
    // }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __is_floating {
        pub _address: u8,
    }
    pub const __is_floating___value:
        crate::core::midi::rtme::root::std::__is_floating__bindgen_ty_1 = 0;
    pub type __is_floating__bindgen_ty_1 = i32;
    pub type __is_floating___type = crate::core::midi::rtme::root::std::__false_type;
    // #[test]
    // fn __bindgen_test_layout___is_floating_open0_float_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__is_floating>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__is_floating)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__is_floating>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__is_floating)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout___is_floating_open0_double_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__is_floating>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__is_floating)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__is_floating>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__is_floating)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout___is_floating_open0_long_double_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__is_floating>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__is_floating)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__is_floating>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__is_floating)
    //         )
    //     );
    // }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __is_pointer {
        pub _address: u8,
    }
    pub const __is_pointer___value: crate::core::midi::rtme::root::std::__is_pointer__bindgen_ty_1 =
        0;
    pub type __is_pointer__bindgen_ty_1 = i32;
    pub type __is_pointer___type = crate::core::midi::rtme::root::std::__false_type;
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __is_arithmetic {
        pub _address: u8,
    }
    impl Default for __is_arithmetic {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __is_scalar {
        pub _address: u8,
    }
    impl Default for __is_scalar {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __is_char {
        pub _address: u8,
    }
    pub const __is_char___value: crate::core::midi::rtme::root::std::__is_char__bindgen_ty_1 = 0;
    pub type __is_char__bindgen_ty_1 = i32;
    pub type __is_char___type = crate::core::midi::rtme::root::std::__false_type;
    // #[test]
    // fn __bindgen_test_layout___is_char_open0_char_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__is_char>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__is_char)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__is_char>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__is_char)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout___is_char_open0_wchar_t_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__is_char>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__is_char)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__is_char>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__is_char)
    //         )
    //     );
    // }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __is_byte {
        pub _address: u8,
    }
    pub const __is_byte___value: crate::core::midi::rtme::root::std::__is_byte__bindgen_ty_1 = 0;
    pub type __is_byte__bindgen_ty_1 = i32;
    pub type __is_byte___type = crate::core::midi::rtme::root::std::__false_type;
    // #[test]
    // fn __bindgen_test_layout___is_byte_open0_char_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__is_byte>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__is_byte)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__is_byte>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__is_byte)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout___is_byte_open0_signed_char_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__is_byte>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__is_byte)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__is_byte>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__is_byte)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout___is_byte_open0_unsigned_char_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__is_byte>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__is_byte)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__is_byte>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__is_byte)
    //         )
    //     );
    // }
    pub type byte = u8;
    // #[test]
    // fn __bindgen_test_layout___is_byte_open0_byte_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__is_byte>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__is_byte)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__is_byte>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__is_byte)
    //         )
    //     );
    // }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __is_move_iterator {
        pub _address: u8,
    }
    pub const __is_move_iterator___value:
        crate::core::midi::rtme::root::std::__is_move_iterator__bindgen_ty_1 = 0;
    pub type __is_move_iterator__bindgen_ty_1 = i32;
    pub type __is_move_iterator___type = crate::core::midi::rtme::root::std::__false_type;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct piecewise_construct_t {
        pub _address: u8,
    }
    // #[test]
    // fn bindgen_test_layout_piecewise_construct_t() {
    //     assert_eq!(
    //         ::std::mem::size_of::<piecewise_construct_t>(),
    //         1usize,
    //         concat!("Size of: ", stringify!(piecewise_construct_t))
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<piecewise_construct_t>(),
    //         1usize,
    //         concat!("Alignment of ", stringify!(piecewise_construct_t))
    //     );
    // }
    extern "C" {
        pub static piecewise_construct: crate::core::midi::rtme::root::std::piecewise_construct_t;
    }
    #[repr(C)]
    #[derive(Debug, Default, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __nonesuch_no_braces {
        pub _address: u8,
    }
    // #[test]
    // fn bindgen_test_layout___nonesuch_no_braces() {
    //     assert_eq!(
    //         ::std::mem::size_of::<__nonesuch_no_braces>(),
    //         1usize,
    //         concat!("Size of: ", stringify!(__nonesuch_no_braces))
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<__nonesuch_no_braces>(),
    //         1usize,
    //         concat!("Alignment of ", stringify!(__nonesuch_no_braces))
    //     );
    // }
    #[repr(C)]
    #[derive(Debug, Default, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __pair_base {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct pair<_T1, _T2> {
        pub first: _T1,
        pub second: _T2,
        pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_T1>>,
        pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<_T2>>,
    }
    pub type pair_first_type<_T1> = _T1;
    pub type pair_second_type<_T2> = _T2;
    pub type pair__PCCP = u8;
    pub type pair__PCCFP = u8;
    impl<_T1, _T2> Default for pair<_T1, _T2> {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct input_iterator_tag {
        pub _address: u8,
    }
    // #[test]
    // fn bindgen_test_layout_input_iterator_tag() {
    //     assert_eq!(
    //         ::std::mem::size_of::<input_iterator_tag>(),
    //         1usize,
    //         concat!("Size of: ", stringify!(input_iterator_tag))
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<input_iterator_tag>(),
    //         1usize,
    //         concat!("Alignment of ", stringify!(input_iterator_tag))
    //     );
    // }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct output_iterator_tag {
        pub _address: u8,
    }
    // #[test]
    // fn bindgen_test_layout_output_iterator_tag() {
    //     assert_eq!(
    //         ::std::mem::size_of::<output_iterator_tag>(),
    //         1usize,
    //         concat!("Size of: ", stringify!(output_iterator_tag))
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<output_iterator_tag>(),
    //         1usize,
    //         concat!("Alignment of ", stringify!(output_iterator_tag))
    //     );
    // }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct forward_iterator_tag {
        pub _address: u8,
    }
    // #[test]
    // fn bindgen_test_layout_forward_iterator_tag() {
    //     assert_eq!(
    //         ::std::mem::size_of::<forward_iterator_tag>(),
    //         1usize,
    //         concat!("Size of: ", stringify!(forward_iterator_tag))
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<forward_iterator_tag>(),
    //         1usize,
    //         concat!("Alignment of ", stringify!(forward_iterator_tag))
    //     );
    // }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct bidirectional_iterator_tag {
        pub _address: u8,
    }
    // #[test]
    // fn bindgen_test_layout_bidirectional_iterator_tag() {
    //     assert_eq!(
    //         ::std::mem::size_of::<bidirectional_iterator_tag>(),
    //         1usize,
    //         concat!("Size of: ", stringify!(bidirectional_iterator_tag))
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<bidirectional_iterator_tag>(),
    //         1usize,
    //         concat!("Alignment of ", stringify!(bidirectional_iterator_tag))
    //     );
    // }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct random_access_iterator_tag {
        pub _address: u8,
    }
    // #[test]
    // fn bindgen_test_layout_random_access_iterator_tag() {
    //     assert_eq!(
    //         ::std::mem::size_of::<random_access_iterator_tag>(),
    //         1usize,
    //         concat!("Size of: ", stringify!(random_access_iterator_tag))
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<random_access_iterator_tag>(),
    //         1usize,
    //         concat!("Alignment of ", stringify!(random_access_iterator_tag))
    //     );
    // }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct iterator {
        pub _address: u8,
    }
    pub type iterator_iterator_category<_Category> = _Category;
    pub type iterator_value_type<_Tp> = _Tp;
    pub type iterator_difference_type<_Distance> = _Distance;
    pub type iterator_pointer<_Pointer> = _Pointer;
    pub type iterator_reference<_Reference> = _Reference;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __iterator_traits {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct iterator_traits {
        pub _address: u8,
    }
    pub type _RequireInputIter = u8;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct _List_iterator {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct _List_const_iterator {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct __undefined {
        _unused: [u8; 0],
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __get_first_arg {
        pub _address: u8,
    }
    pub type __get_first_arg_type = crate::core::midi::rtme::root::std::__undefined;
    pub type __get_first_arg_t = crate::core::midi::rtme::root::std::__get_first_arg;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __replace_first_arg {
        pub _address: u8,
    }
    pub type __replace_first_arg_t = crate::core::midi::rtme::root::std::__replace_first_arg;
    pub type __make_not_void = u8;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct pointer_traits {
        pub _address: u8,
    }
    pub type pointer_traits___element_type = [u8; 0usize];
    pub type pointer_traits___difference_type = [u8; 0usize];
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct pointer_traits___rebind {
        pub _address: u8,
    }
    impl Default for pointer_traits___rebind {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    pub type pointer_traits_pointer<_Ptr> = _Ptr;
    pub type pointer_traits_element_type = crate::core::midi::rtme::root::std::__detected_or_t;
    pub type pointer_traits_difference_type = crate::core::midi::rtme::root::std::__detected_or_t;
    pub type pointer_traits_rebind = crate::core::midi::rtme::root::std::pointer_traits___rebind;
    pub type __ptr_rebind = crate::core::midi::rtme::root::std::pointer_traits;
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct reverse_iterator<_Iterator> {
        pub current: _Iterator,
        pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Iterator>>,
    }
    pub type reverse_iterator___traits_type = crate::core::midi::rtme::root::std::iterator_traits;
    pub type reverse_iterator_iterator_type<_Iterator> = _Iterator;
    pub type reverse_iterator_difference_type =
        crate::core::midi::rtme::root::std::reverse_iterator___traits_type;
    pub type reverse_iterator_pointer =
        crate::core::midi::rtme::root::std::reverse_iterator___traits_type;
    pub type reverse_iterator_reference =
        crate::core::midi::rtme::root::std::reverse_iterator___traits_type;
    impl<_Iterator> Default for reverse_iterator<_Iterator> {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct back_insert_iterator<_Container> {
        pub container: *mut _Container,
        pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Container>>,
    }
    pub type back_insert_iterator_container_type<_Container> = _Container;
    impl<_Container> Default for back_insert_iterator<_Container> {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct front_insert_iterator<_Container> {
        pub container: *mut _Container,
        pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Container>>,
    }
    pub type front_insert_iterator_container_type<_Container> = _Container;
    impl<_Container> Default for front_insert_iterator<_Container> {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    #[repr(C)]
    pub struct insert_iterator<_Container> {
        pub container: *mut _Container,
        pub iter: [u8; 0usize],
        pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Container>>,
    }
    pub type insert_iterator_container_type<_Container> = _Container;
    impl<_Container> Default for insert_iterator<_Container> {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    impl<_Container> ::std::fmt::Debug for insert_iterator<_Container> {
        fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
            write!(f, "insert_iterator {{ container: {:?} }}", self.container)
        }
    }
    impl<_Container> PartialEq for insert_iterator<_Container>
    where
        _Container: PartialEq,
    {
        fn eq(&self, other: &insert_iterator<_Container>) -> bool {
            self.container == other.container && self.iter == other.iter
        }
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct move_iterator<_Iterator> {
        pub _M_current: _Iterator,
        pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Iterator>>,
    }
    pub type move_iterator___traits_type = crate::core::midi::rtme::root::std::iterator_traits;
    pub type move_iterator___base_ref =
        crate::core::midi::rtme::root::std::move_iterator___traits_type;
    pub type move_iterator_iterator_type<_Iterator> = _Iterator;
    pub type move_iterator_iterator_category =
        crate::core::midi::rtme::root::std::move_iterator___traits_type;
    pub type move_iterator_value_type =
        crate::core::midi::rtme::root::std::move_iterator___traits_type;
    pub type move_iterator_difference_type =
        crate::core::midi::rtme::root::std::move_iterator___traits_type;
    pub type move_iterator_pointer<_Iterator> = _Iterator;
    pub type move_iterator_reference = u8;
    impl<_Iterator> Default for move_iterator<_Iterator> {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    pub type __iter_key_t = crate::core::midi::rtme::root::std::remove_const_t;
    pub type __iter_val_t = crate::core::midi::rtme::root::std::iterator_traits;
    pub type __iter_to_alloc_t = crate::core::midi::rtme::root::std::pair<
        root::std::add_const_t,
        crate::core::midi::rtme::root::std::__iter_val_t,
    >;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __lc_rai {
        pub _address: u8,
    }
    // #[test]
    // fn __bindgen_test_layout___lc_rai_open0_random_access_iterator_tag_random_access_iterator_tag_close0_instantiation(
    // ) {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__lc_rai>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__lc_rai)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__lc_rai>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__lc_rai)
    //         )
    //     );
    // }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct char_traits {
        pub _address: u8,
    }
    impl Default for char_traits {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    // #[test]
    // fn __bindgen_test_layout_char_traits_open0_char_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::char_traits>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::char_traits)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::char_traits>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::char_traits)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout_char_traits_open0_wchar_t_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::char_traits>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::char_traits)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::char_traits>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::char_traits)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout_char_traits_open0_char16_t_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::char_traits>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::char_traits)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::char_traits>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::char_traits)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout_char_traits_open0_char32_t_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::char_traits>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::char_traits)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::char_traits>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::char_traits)
    //         )
    //     );
    // }
    pub type __c_locale = crate::core::midi::rtme::root::__locale_t;
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct codecvt_base {
        _unused: [u8; 0],
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct codecvt {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct codecvt_byname {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct time_base {
        _unused: [u8; 0],
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct time_put {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct time_put_byname {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct money_base {
        _unused: [u8; 0],
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct messages_base {
        _unused: [u8; 0],
    }
    pub type __allocator_base = crate::core::midi::rtme::root::__gnu_cxx::new_allocator;
    // #[test]
    // fn __bindgen_test_layout_allocator_open0_void_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::allocator>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::allocator)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::allocator>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::allocator)
    //         )
    //     );
    // }
    #[repr(C)]
    #[derive(Debug, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct allocator {
        pub _address: u8,
    }
    pub type allocator_size_type = usize;
    pub type allocator_difference_type = isize;
    pub type allocator_pointer<_Tp> = *mut _Tp;
    pub type allocator_const_pointer<_Tp> = *const _Tp;
    pub type allocator_reference<_Tp> = *mut _Tp;
    pub type allocator_const_reference<_Tp> = *const _Tp;
    pub type allocator_value_type<_Tp> = _Tp;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct allocator_rebind {
        pub _address: u8,
    }
    pub type allocator_rebind_other = crate::core::midi::rtme::root::std::allocator;
    pub type allocator_propagate_on_container_move_assignment =
        crate::core::midi::rtme::root::std::true_type;
    pub type allocator_is_always_equal = crate::core::midi::rtme::root::std::true_type;
    impl Default for allocator {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    // #[test]
    // fn __bindgen_test_layout_allocator_open0_char_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::allocator>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::allocator)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::allocator>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::allocator)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout_allocator_open0_wchar_t_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::allocator>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::allocator)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::allocator>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::allocator)
    //         )
    //     );
    // }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct unary_function {
        pub _address: u8,
    }
    pub type unary_function_argument_type<_Arg> = _Arg;
    pub type unary_function_result_type<_Result> = _Result;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct binary_function {
        pub _address: u8,
    }
    pub type binary_function_first_argument_type<_Arg1> = _Arg1;
    pub type binary_function_second_argument_type<_Arg2> = _Arg2;
    pub type binary_function_result_type<_Result> = _Result;
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct __is_transparent {
        _unused: [u8; 0],
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct plus {
        pub _address: u8,
    }
    impl Default for plus {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct minus {
        pub _address: u8,
    }
    impl Default for minus {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct multiplies {
        pub _address: u8,
    }
    impl Default for multiplies {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct divides {
        pub _address: u8,
    }
    impl Default for divides {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct modulus {
        pub _address: u8,
    }
    impl Default for modulus {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct negate {
        pub _address: u8,
    }
    impl Default for negate {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    // #[test]
    // fn __bindgen_test_layout_plus_open0_void_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::plus>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::plus)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::plus>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::plus)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout_minus_open0_void_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::minus>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::minus)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::minus>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::minus)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout_multiplies_open0_void_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::multiplies>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::multiplies)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::multiplies>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::multiplies)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout_divides_open0_void_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::divides>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::divides)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::divides>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::divides)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout_modulus_open0_void_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::modulus>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::modulus)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::modulus>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::modulus)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout_negate_open0_void_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::negate>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::negate)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::negate>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::negate)
    //         )
    //     );
    // }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct equal_to {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct not_equal_to {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct greater {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct less {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct greater_equal {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct less_equal {
        pub _address: u8,
    }
    // #[test]
    // fn __bindgen_test_layout_equal_to_open0_void_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::equal_to>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::equal_to)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::equal_to>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::equal_to)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout_not_equal_to_open0_void_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::not_equal_to>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::not_equal_to)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::not_equal_to>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::not_equal_to)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout_greater_open0_void_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::greater>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::greater)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::greater>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::greater)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout_less_open0_void_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::less>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::less)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::less>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::less)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout_greater_equal_open0_void_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::greater_equal>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::greater_equal)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::greater_equal>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::greater_equal)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout_less_equal_open0_void_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::less_equal>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::less_equal)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::less_equal>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::less_equal)
    //         )
    //     );
    // }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct logical_and {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct logical_or {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct logical_not {
        pub _address: u8,
    }
    // #[test]
    // fn __bindgen_test_layout_logical_and_open0_void_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::logical_and>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::logical_and)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::logical_and>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::logical_and)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout_logical_or_open0_void_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::logical_or>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::logical_or)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::logical_or>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::logical_or)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout_logical_not_open0_void_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::logical_not>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::logical_not)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::logical_not>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::logical_not)
    //         )
    //     );
    // }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct bit_and {
        pub _address: u8,
    }
    impl Default for bit_and {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct bit_or {
        pub _address: u8,
    }
    impl Default for bit_or {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct bit_xor {
        pub _address: u8,
    }
    impl Default for bit_xor {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct bit_not {
        pub _address: u8,
    }
    impl Default for bit_not {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    // #[test]
    // fn __bindgen_test_layout_bit_and_open0_void_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::bit_and>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::bit_and)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::bit_and>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::bit_and)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout_bit_or_open0_void_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::bit_or>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::bit_or)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::bit_or>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::bit_or)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout_bit_xor_open0_void_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::bit_xor>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::bit_xor)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::bit_xor>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::bit_xor)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout_bit_not_open0_void_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::bit_not>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::bit_not)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::bit_not>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::bit_not)
    //         )
    //     );
    // }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct unary_negate<_Predicate> {
        pub _M_pred: _Predicate,
        pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Predicate>>,
    }
    impl<_Predicate> Default for unary_negate<_Predicate> {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct binary_negate<_Predicate> {
        pub _M_pred: _Predicate,
        pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Predicate>>,
    }
    impl<_Predicate> Default for binary_negate<_Predicate> {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct pointer_to_unary_function<_Arg, _Result> {
        pub _M_ptr: ::std::option::Option<unsafe extern "C" fn(arg1: _Arg) -> _Result>,
        pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Arg>>,
        pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Result>>,
    }
    impl<_Arg, _Result> Default for pointer_to_unary_function<_Arg, _Result> {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct pointer_to_binary_function<_Arg1, _Arg2, _Result> {
        pub _M_ptr:
            ::std::option::Option<unsafe extern "C" fn(arg1: _Arg1, arg2: _Arg2) -> _Result>,
        pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Arg1>>,
        pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Arg2>>,
        pub _phantom_2: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Result>>,
    }
    impl<_Arg1, _Arg2, _Result> Default for pointer_to_binary_function<_Arg1, _Arg2, _Result> {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct _Identity {
        pub _address: u8,
    }
    impl Default for _Identity {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct _Select1st {
        pub _address: u8,
    }
    impl Default for _Select1st {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct _Select2nd {
        pub _address: u8,
    }
    impl Default for _Select2nd {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct mem_fun_t<_Ret> {
        pub _M_f: ::std::option::Option<unsafe extern "C" fn() -> _Ret>,
        pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Ret>>,
    }
    impl<_Ret> Default for mem_fun_t<_Ret> {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct const_mem_fun_t<_Ret> {
        pub _M_f: ::std::option::Option<unsafe extern "C" fn() -> _Ret>,
        pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Ret>>,
    }
    impl<_Ret> Default for const_mem_fun_t<_Ret> {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct mem_fun_ref_t<_Ret> {
        pub _M_f: ::std::option::Option<unsafe extern "C" fn() -> _Ret>,
        pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Ret>>,
    }
    impl<_Ret> Default for mem_fun_ref_t<_Ret> {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct const_mem_fun_ref_t<_Ret> {
        pub _M_f: ::std::option::Option<unsafe extern "C" fn() -> _Ret>,
        pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Ret>>,
    }
    impl<_Ret> Default for const_mem_fun_ref_t<_Ret> {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct mem_fun1_t<_Ret, _Arg> {
        pub _M_f: ::std::option::Option<unsafe extern "C" fn(arg1: _Arg) -> _Ret>,
        pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Ret>>,
        pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Arg>>,
    }
    impl<_Ret, _Arg> Default for mem_fun1_t<_Ret, _Arg> {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct const_mem_fun1_t<_Ret, _Arg> {
        pub _M_f: ::std::option::Option<unsafe extern "C" fn(arg1: _Arg) -> _Ret>,
        pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Ret>>,
        pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Arg>>,
    }
    impl<_Ret, _Arg> Default for const_mem_fun1_t<_Ret, _Arg> {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct mem_fun1_ref_t<_Ret, _Arg> {
        pub _M_f: ::std::option::Option<unsafe extern "C" fn(arg1: _Arg) -> _Ret>,
        pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Ret>>,
        pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Arg>>,
    }
    impl<_Ret, _Arg> Default for mem_fun1_ref_t<_Ret, _Arg> {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct const_mem_fun1_ref_t<_Ret, _Arg> {
        pub _M_f: ::std::option::Option<unsafe extern "C" fn(arg1: _Arg) -> _Ret>,
        pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Ret>>,
        pub _phantom_1: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Arg>>,
    }
    impl<_Ret, _Arg> Default for const_mem_fun1_ref_t<_Ret, _Arg> {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    #[repr(C)]
    pub struct binder1st<_Operation> {
        pub op: _Operation,
        pub value: [u8; 0usize],
        pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Operation>>,
    }
    impl<_Operation> Default for binder1st<_Operation> {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    impl<_Operation> ::std::fmt::Debug for binder1st<_Operation> {
        fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
            write!(f, "binder1st {{ op: Non-debuggable generic }}")
        }
    }
    impl<_Operation> PartialEq for binder1st<_Operation>
    where
        _Operation: PartialEq,
    {
        fn eq(&self, other: &binder1st<_Operation>) -> bool {
            self.op == other.op && self.value == other.value
        }
    }
    #[repr(C)]
    pub struct binder2nd<_Operation> {
        pub op: _Operation,
        pub value: [u8; 0usize],
        pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_Operation>>,
    }
    impl<_Operation> Default for binder2nd<_Operation> {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    impl<_Operation> ::std::fmt::Debug for binder2nd<_Operation> {
        fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
            write!(f, "binder2nd {{ op: Non-debuggable generic }}")
        }
    }
    impl<_Operation> PartialEq for binder2nd<_Operation>
    where
        _Operation: PartialEq,
    {
        fn eq(&self, other: &binder2nd<_Operation>) -> bool {
            self.op == other.op && self.value == other.value
        }
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct initializer_list<_E> {
        pub _M_array: crate::core::midi::rtme::root::std::initializer_list_iterator<_E>,
        pub _M_len: crate::core::midi::rtme::root::std::initializer_list_size_type,
        pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_E>>,
    }
    pub type initializer_list_value_type<_E> = _E;
    pub type initializer_list_reference<_E> = *const _E;
    pub type initializer_list_const_reference<_E> = *const _E;
    pub type initializer_list_size_type = usize;
    pub type initializer_list_iterator<_E> = *const _E;
    pub type initializer_list_const_iterator<_E> = *const _E;
    impl<_E> Default for initializer_list<_E> {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct valarray {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __allocator_traits_base {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __allocator_traits_base___rebind {
        pub _address: u8,
    }
    impl Default for __allocator_traits_base___rebind {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    pub type __allocator_traits_base___pointer = [u8; 0usize];
    pub type __allocator_traits_base___c_pointer = [u8; 0usize];
    pub type __allocator_traits_base___v_pointer = [u8; 0usize];
    pub type __allocator_traits_base___cv_pointer = [u8; 0usize];
    pub type __allocator_traits_base___pocca = [u8; 0usize];
    pub type __allocator_traits_base___pocma = [u8; 0usize];
    pub type __allocator_traits_base___pocs = [u8; 0usize];
    pub type __allocator_traits_base___equal = [u8; 0usize];
    // #[test]
    // fn bindgen_test_layout___allocator_traits_base() {
    //     assert_eq!(
    //         ::std::mem::size_of::<__allocator_traits_base>(),
    //         1usize,
    //         concat!("Size of: ", stringify!(__allocator_traits_base))
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<__allocator_traits_base>(),
    //         1usize,
    //         concat!("Alignment of ", stringify!(__allocator_traits_base))
    //     );
    // }
    pub type __alloc_rebind = crate::core::midi::rtme::root::std::__allocator_traits_base;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct allocator_traits {
        pub _address: u8,
    }
    pub type allocator_traits_allocator_type<_Alloc> = _Alloc;
    pub type allocator_traits_value_type = [u8; 0usize];
    pub type allocator_traits_pointer = crate::core::midi::rtme::root::std::__detected_or_t;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct allocator_traits__Ptr {
        pub _address: u8,
    }
    pub type allocator_traits__Ptr_type = [u8; 0usize];
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct allocator_traits__Diff {
        pub _address: u8,
    }
    pub type allocator_traits__Diff_type = crate::core::midi::rtme::root::std::pointer_traits;
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct allocator_traits__Size {
        pub _address: u8,
    }
    impl Default for allocator_traits__Size {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    pub type allocator_traits_const_pointer = [u8; 0usize];
    pub type allocator_traits_void_pointer =
        crate::core::midi::rtme::root::std::allocator_traits__Ptr;
    pub type allocator_traits_const_void_pointer =
        crate::core::midi::rtme::root::std::allocator_traits__Ptr;
    pub type allocator_traits_difference_type = [u8; 0usize];
    pub type allocator_traits_size_type = [u8; 0usize];
    pub type allocator_traits_propagate_on_container_copy_assignment =
        crate::core::midi::rtme::root::std::__detected_or_t;
    pub type allocator_traits_propagate_on_container_move_assignment =
        crate::core::midi::rtme::root::std::__detected_or_t;
    pub type allocator_traits_propagate_on_container_swap =
        crate::core::midi::rtme::root::std::__detected_or_t;
    pub type allocator_traits_is_always_equal = crate::core::midi::rtme::root::std::__detected_or_t;
    pub type allocator_traits_rebind_alloc = crate::core::midi::rtme::root::std::__alloc_rebind;
    pub type allocator_traits_rebind_traits = crate::core::midi::rtme::root::std::allocator_traits;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct allocator_traits___construct_helper {
        pub _address: u8,
    }
    pub type allocator_traits___construct_helper_type<_Alloc> = _Alloc;
    pub type allocator_traits___has_construct =
        crate::core::midi::rtme::root::std::allocator_traits___construct_helper;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __is_copy_insertable_impl {
        pub _address: u8,
    }
    pub type __is_copy_insertable_impl__Traits =
        crate::core::midi::rtme::root::std::allocator_traits;
    pub type __is_copy_insertable_impl_type<_Alloc> = _Alloc;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __is_copy_insertable {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __is_allocator {
        pub _base: crate::core::midi::rtme::root::std::false_type,
    }
    pub type _RequireAllocator = u8;
    pub const float_round_style_round_indeterminate:
        crate::core::midi::rtme::root::std::float_round_style = -1;
    pub const float_round_style_round_toward_zero:
        crate::core::midi::rtme::root::std::float_round_style = 0;
    pub const float_round_style_round_to_nearest:
        crate::core::midi::rtme::root::std::float_round_style = 1;
    pub const float_round_style_round_toward_infinity:
        crate::core::midi::rtme::root::std::float_round_style = 2;
    pub const float_round_style_round_toward_neg_infinity:
        crate::core::midi::rtme::root::std::float_round_style = 3;
    pub type float_round_style = i32;
    pub const float_denorm_style_denorm_indeterminate:
        crate::core::midi::rtme::root::std::float_denorm_style = -1;
    pub const float_denorm_style_denorm_absent:
        crate::core::midi::rtme::root::std::float_denorm_style = 0;
    pub const float_denorm_style_denorm_present:
        crate::core::midi::rtme::root::std::float_denorm_style = 1;
    pub type float_denorm_style = i32;
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __numeric_limits_base {
        pub _address: u8,
    }
    pub const __numeric_limits_base_is_specialized: bool = false;
    pub const __numeric_limits_base_digits: ::std::os::raw::c_int = 0;
    pub const __numeric_limits_base_digits10: ::std::os::raw::c_int = 0;
    pub const __numeric_limits_base_max_digits10: ::std::os::raw::c_int = 0;
    pub const __numeric_limits_base_is_signed: bool = false;
    pub const __numeric_limits_base_is_integer: bool = false;
    pub const __numeric_limits_base_is_exact: bool = false;
    pub const __numeric_limits_base_radix: ::std::os::raw::c_int = 0;
    pub const __numeric_limits_base_min_exponent: ::std::os::raw::c_int = 0;
    pub const __numeric_limits_base_min_exponent10: ::std::os::raw::c_int = 0;
    pub const __numeric_limits_base_max_exponent: ::std::os::raw::c_int = 0;
    pub const __numeric_limits_base_max_exponent10: ::std::os::raw::c_int = 0;
    pub const __numeric_limits_base_has_infinity: bool = false;
    pub const __numeric_limits_base_has_quiet_NaN: bool = false;
    pub const __numeric_limits_base_has_signaling_NaN: bool = false;
    extern "C" {
        #[link_name = "\u{1}has_denorm"]
        pub static __numeric_limits_base_has_denorm:
            crate::core::midi::rtme::root::std::float_denorm_style;
    }
    pub const __numeric_limits_base_has_denorm_loss: bool = false;
    pub const __numeric_limits_base_is_iec559: bool = false;
    pub const __numeric_limits_base_is_bounded: bool = false;
    pub const __numeric_limits_base_is_modulo: bool = false;
    pub const __numeric_limits_base_traps: bool = false;
    pub const __numeric_limits_base_tinyness_before: bool = false;
    extern "C" {
        #[link_name = "\u{1}round_style"]
        pub static __numeric_limits_base_round_style:
            crate::core::midi::rtme::root::std::float_round_style;
    }
    // #[test]
    // fn bindgen_test_layout___numeric_limits_base() {
    //     assert_eq!(
    //         ::std::mem::size_of::<__numeric_limits_base>(),
    //         1usize,
    //         concat!("Size of: ", stringify!(__numeric_limits_base))
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<__numeric_limits_base>(),
    //         1usize,
    //         concat!("Alignment of ", stringify!(__numeric_limits_base))
    //     );
    // }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct numeric_limits {
        pub _address: u8,
    }
    // #[test]
    // fn __bindgen_test_layout_numeric_limits_open0_bool__close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::numeric_limits>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::numeric_limits)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::numeric_limits>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::numeric_limits)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout_numeric_limits_open0_char_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::numeric_limits>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::numeric_limits)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::numeric_limits>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::numeric_limits)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout_numeric_limits_open0_signed_char_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::numeric_limits>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::numeric_limits)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::numeric_limits>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::numeric_limits)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout_numeric_limits_open0_unsigned_char_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::numeric_limits>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::numeric_limits)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::numeric_limits>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::numeric_limits)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout_numeric_limits_open0_wchar_t_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::numeric_limits>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::numeric_limits)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::numeric_limits>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::numeric_limits)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout_numeric_limits_open0_char16_t_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::numeric_limits>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::numeric_limits)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::numeric_limits>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::numeric_limits)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout_numeric_limits_open0_char32_t_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::numeric_limits>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::numeric_limits)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::numeric_limits>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::numeric_limits)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout_numeric_limits_open0_short_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::numeric_limits>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::numeric_limits)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::numeric_limits>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::numeric_limits)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout_numeric_limits_open0_unsigned_short_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::numeric_limits>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::numeric_limits)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::numeric_limits>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::numeric_limits)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout_numeric_limits_open0_int_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::numeric_limits>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::numeric_limits)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::numeric_limits>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::numeric_limits)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout_numeric_limits_open0_unsigned_int_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::numeric_limits>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::numeric_limits)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::numeric_limits>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::numeric_limits)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout_numeric_limits_open0_long_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::numeric_limits>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::numeric_limits)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::numeric_limits>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::numeric_limits)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout_numeric_limits_open0_unsigned_long_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::numeric_limits>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::numeric_limits)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::numeric_limits>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::numeric_limits)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout_numeric_limits_open0_long_long_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::numeric_limits>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::numeric_limits)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::numeric_limits>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::numeric_limits)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout_numeric_limits_open0_unsigned_long_long_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::numeric_limits>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::numeric_limits)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::numeric_limits>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::numeric_limits)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout_numeric_limits_open0_float_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::numeric_limits>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::numeric_limits)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::numeric_limits>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::numeric_limits)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout_numeric_limits_open0_double_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::numeric_limits>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::numeric_limits)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::numeric_limits>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::numeric_limits)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout_numeric_limits_open0_long_double_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::numeric_limits>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::numeric_limits)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::numeric_limits>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::numeric_limits)
    //         )
    //     );
    // }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __hash_base {
        pub _address: u8,
    }
    pub type __hash_base_result_type<_Result> = _Result;
    pub type __hash_base_argument_type<_Arg> = _Arg;
    #[repr(C)]
    #[derive(Debug, Default, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __poison_hash {
        pub _address: u8,
    }
    #[repr(C)]
    #[derive(Debug, Default, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct hash {
        pub _address: u8,
    }
    // #[test]
    // fn __bindgen_test_layout_hash_open0_bool__close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::hash>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::hash)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::hash>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::hash)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout_hash_open0_char_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::hash>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::hash)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::hash>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::hash)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout_hash_open0_signed_char_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::hash>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::hash)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::hash>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::hash)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout_hash_open0_unsigned_char_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::hash>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::hash)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::hash>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::hash)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout_hash_open0_wchar_t_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::hash>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::hash)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::hash>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::hash)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout_hash_open0_char16_t_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::hash>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::hash)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::hash>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::hash)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout_hash_open0_char32_t_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::hash>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::hash)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::hash>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::hash)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout_hash_open0_short_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::hash>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::hash)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::hash>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::hash)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout_hash_open0_int_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::hash>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::hash)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::hash>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::hash)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout_hash_open0_long_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::hash>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::hash)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::hash>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::hash)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout_hash_open0_long_long_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::hash>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::hash)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::hash>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::hash)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout_hash_open0_unsigned_short_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::hash>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::hash)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::hash>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::hash)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout_hash_open0_unsigned_int_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::hash>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::hash)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::hash>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::hash)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout_hash_open0_unsigned_long_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::hash>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::hash)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::hash>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::hash)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout_hash_open0_unsigned_long_long_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::hash>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::hash)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::hash>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::hash)
    //         )
    //     );
    // }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct _Hash_impl {
        pub _address: u8,
    }
    // #[test]
    // fn bindgen_test_layout__Hash_impl() {
    //     assert_eq!(
    //         ::std::mem::size_of::<_Hash_impl>(),
    //         1usize,
    //         concat!("Size of: ", stringify!(_Hash_impl))
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<_Hash_impl>(),
    //         1usize,
    //         concat!("Alignment of ", stringify!(_Hash_impl))
    //     );
    // }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct _Fnv_hash_impl {
        pub _address: u8,
    }
    // #[test]
    // fn bindgen_test_layout__Fnv_hash_impl() {
    //     assert_eq!(
    //         ::std::mem::size_of::<_Fnv_hash_impl>(),
    //         1usize,
    //         concat!("Size of: ", stringify!(_Fnv_hash_impl))
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<_Fnv_hash_impl>(),
    //         1usize,
    //         concat!("Alignment of ", stringify!(_Fnv_hash_impl))
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout_hash_open0_float_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::hash>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::hash)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::hash>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::hash)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout_hash_open0_double_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::hash>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::hash)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::hash>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::hash)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout_hash_open0_long_double_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::hash>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::hash)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::hash>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::hash)
    //         )
    //     );
    // }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct __is_fast_hash {
        pub _base: crate::core::midi::rtme::root::std::true_type,
    }
    // #[test]
    // fn __bindgen_test_layout___is_fast_hash_open0_hash_open1_long_double_close1_close0_instantiation(
    // ) {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__is_fast_hash>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__is_fast_hash)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__is_fast_hash>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__is_fast_hash)
    //         )
    //     );
    // }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct basic_string_view<_CharT> {
        pub _M_len: usize,
        pub _M_str: *const _CharT,
        pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<_CharT>>,
    }
    pub type basic_string_view_traits_type<_Traits> = _Traits;
    pub type basic_string_view_value_type<_CharT> = _CharT;
    pub type basic_string_view_pointer<_CharT> = *const _CharT;
    pub type basic_string_view_const_pointer<_CharT> = *const _CharT;
    pub type basic_string_view_reference<_CharT> = *const _CharT;
    pub type basic_string_view_const_reference<_CharT> = *const _CharT;
    pub type basic_string_view_const_iterator<_CharT> = *const _CharT;
    pub type basic_string_view_iterator<_CharT> =
        crate::core::midi::rtme::root::std::basic_string_view_const_iterator<_CharT>;
    pub type basic_string_view_const_reverse_iterator<_CharT> =
        crate::core::midi::rtme::root::std::reverse_iterator<
            root::std::basic_string_view_const_iterator<_CharT>,
        >;
    pub type basic_string_view_reverse_iterator<_CharT> =
        crate::core::midi::rtme::root::std::basic_string_view_const_reverse_iterator<_CharT>;
    pub type basic_string_view_size_type = usize;
    pub type basic_string_view_difference_type = isize;
    impl<_CharT> Default for basic_string_view<_CharT> {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    pub mod __detail {

        pub type __idt = crate::core::midi::rtme::root::std::common_type_t;
    }
    pub type string_view =
        crate::core::midi::rtme::root::std::basic_string_view<::std::os::raw::c_char>;
    pub type wstring_view = crate::core::midi::rtme::root::std::basic_string_view<u32>;
    pub type u16string_view = crate::core::midi::rtme::root::std::basic_string_view<u16>;
    pub type u32string_view = crate::core::midi::rtme::root::std::basic_string_view<u32>;
    // #[test]
    // fn __bindgen_test_layout_hash_open0_basic_string_view_open1_char_char_traits_open2_char_close2_close1_close0_instantiation(
    // ) {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::hash>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::hash)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::hash>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::hash)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout___is_fast_hash_open0_hash_open1_basic_string_view_open2_char_char_traits_open3_char_close3_close2_close1_close0_instantiation(
    // ) {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__is_fast_hash>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__is_fast_hash)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__is_fast_hash>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__is_fast_hash)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout_hash_open0_basic_string_view_open1_wchar_t_char_traits_open2_wchar_t_close2_close1_close0_instantiation(
    // ) {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::hash>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::hash)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::hash>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::hash)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout___is_fast_hash_open0_hash_open1_basic_string_view_open2_wchar_t_char_traits_open3_wchar_t_close3_close2_close1_close0_instantiation(
    // ) {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__is_fast_hash>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__is_fast_hash)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__is_fast_hash>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__is_fast_hash)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout_hash_open0_basic_string_view_open1_char16_t_char_traits_open2_char16_t_close2_close1_close0_instantiation(
    // ) {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::hash>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::hash)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::hash>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::hash)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout___is_fast_hash_open0_hash_open1_basic_string_view_open2_char16_t_char_traits_open3_char16_t_close3_close2_close1_close0_instantiation(
    // ) {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__is_fast_hash>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__is_fast_hash)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__is_fast_hash>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__is_fast_hash)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout_hash_open0_basic_string_view_open1_char32_t_char_traits_open2_char32_t_close2_close1_close0_instantiation(
    // ) {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::hash>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::hash)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::hash>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::hash)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout___is_fast_hash_open0_hash_open1_basic_string_view_open2_char32_t_char_traits_open3_char32_t_close3_close2_close1_close0_instantiation(
    // ) {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__is_fast_hash>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__is_fast_hash)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__is_fast_hash>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__is_fast_hash)
    //         )
    //     );
    // }
    pub mod literals {}
    extern "C" {
        pub fn getline(
            __in: *mut crate::core::midi::rtme::root::std::basic_istream<::std::os::raw::c_char>,
            __str: *mut crate::core::midi::rtme::root::std::__cxx11::basic_string<
                ::std::os::raw::c_char,
            >,
            __delim: ::std::os::raw::c_char,
        ) -> *mut crate::core::midi::rtme::root::std::basic_istream<::std::os::raw::c_char>;
    }
    // #[test]
    // fn __bindgen_test_layout_hash_open0_basic_string_open1_char_char_traits_open2_char_close2_allocator_open2_char_close2_close1_close0_instantiation(
    // ) {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::hash>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::hash)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::hash>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::hash)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout___is_fast_hash_open0_hash_open1_basic_string_open2_char_char_traits_open3_char_close3_allocator_open3_char_close3_close2_close1_close0_instantiation(
    // ) {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__is_fast_hash>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__is_fast_hash)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__is_fast_hash>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__is_fast_hash)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout_hash_open0_basic_string_open1_wchar_t_char_traits_open2_wchar_t_close2_allocator_open2_wchar_t_close2_close1_close0_instantiation(
    // ) {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::hash>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::hash)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::hash>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::hash)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout___is_fast_hash_open0_hash_open1_basic_string_open2_wchar_t_char_traits_open3_wchar_t_close3_allocator_open3_wchar_t_close3_close2_close1_close0_instantiation(
    // ) {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__is_fast_hash>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__is_fast_hash)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__is_fast_hash>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__is_fast_hash)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout_hash_open0_basic_string_open1_char16_t_char_traits_open2_char16_t_close2_allocator_open2_char16_t_close2_close1_close0_instantiation(
    // ) {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::hash>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::hash)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::hash>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::hash)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout___is_fast_hash_open0_hash_open1_basic_string_open2_char16_t_char_traits_open3_char16_t_close3_allocator_open3_char16_t_close3_close2_close1_close0_instantiation(
    // ) {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__is_fast_hash>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__is_fast_hash)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__is_fast_hash>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__is_fast_hash)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout_hash_open0_basic_string_open1_char32_t_char_traits_open2_char32_t_close2_allocator_open2_char32_t_close2_close1_close0_instantiation(
    // ) {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::hash>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::hash)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::hash>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::hash)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout___is_fast_hash_open0_hash_open1_basic_string_open2_char32_t_char_traits_open3_char32_t_close3_allocator_open3_char32_t_close3_close2_close1_close0_instantiation(
    // ) {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__is_fast_hash>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__is_fast_hash)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__is_fast_hash>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__is_fast_hash)
    //         )
    //     );
    // }
    extern "C" {
        pub static npos: crate::core::midi::rtme::root::std::__cxx11::basic_string_size_type;
    }
    #[repr(C)]
    #[derive(Debug, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct locale {
        pub _M_impl: *mut crate::core::midi::rtme::root::std::locale__Impl,
    }
    pub type locale_category = ::std::os::raw::c_int;
    pub const locale__S_categories_size: crate::core::midi::rtme::root::std::locale__bindgen_ty_1 =
        12;
    pub type locale__bindgen_ty_1 = u32;
    pub const locale_none: crate::core::midi::rtme::root::std::locale_category = 0;
    pub const locale_ctype: crate::core::midi::rtme::root::std::locale_category = 1;
    pub const locale_numeric: crate::core::midi::rtme::root::std::locale_category = 2;
    pub const locale_collate: crate::core::midi::rtme::root::std::locale_category = 4;
    pub const locale_time: crate::core::midi::rtme::root::std::locale_category = 8;
    pub const locale_monetary: crate::core::midi::rtme::root::std::locale_category = 16;
    pub const locale_messages: crate::core::midi::rtme::root::std::locale_category = 32;
    pub const locale_all: crate::core::midi::rtme::root::std::locale_category = 63;
    extern "C" {
        #[link_name = "\u{1}_S_classic"]
        pub static mut locale__S_classic: *mut crate::core::midi::rtme::root::std::locale__Impl;
    }
    extern "C" {
        #[link_name = "\u{1}_S_global"]
        pub static mut locale__S_global: *mut crate::core::midi::rtme::root::std::locale__Impl;
    }
    extern "C" {
        #[link_name = "\u{1}_S_categories"]
        pub static locale__S_categories: *const *const ::std::os::raw::c_char;
    }
    extern "C" {
        #[link_name = "\u{1}_S_once"]
        pub static mut locale__S_once: crate::core::midi::rtme::root::__gthread_once_t;
    }
    extern "C" {
        #[link_name = "\u{1}_S_twinned_facets"]
        pub static mut locale__S_twinned_facets:
            [*const crate::core::midi::rtme::root::std::locale_id; 0usize];
    }
    // #[test]
    // fn bindgen_test_layout_locale() {
    //     assert_eq!(
    //         ::std::mem::size_of::<locale>(),
    //         8usize,
    //         concat!("Size of: ", stringify!(locale))
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<locale>(),
    //         8usize,
    //         concat!("Alignment of ", stringify!(locale))
    //     );
    //     assert_eq!(
    //         unsafe { &(*(::std::ptr::null::<locale>()))._M_impl as *const _ as usize },
    //         0usize,
    //         concat!(
    //             "Offset of field: ",
    //             stringify!(locale),
    //             "::",
    //             stringify!(_M_impl)
    //         )
    //     );
    // }
    extern "C" {
        #[link_name = "\u{1}name"]
        pub fn locale_name(
            this: *const crate::core::midi::rtme::root::std::locale,
        ) -> crate::core::midi::rtme::root::std::__cxx11::string;
    }
    extern "C" {
        #[link_name = "\u{1}global"]
        pub fn locale_global(
            __loc: *const crate::core::midi::rtme::root::std::locale,
        ) -> crate::core::midi::rtme::root::std::locale;
    }
    extern "C" {
        #[link_name = "\u{1}classic"]
        pub fn locale_classic() -> *const crate::core::midi::rtme::root::std::locale;
    }
    extern "C" {
        #[link_name = "\u{1}locale"]
        pub fn locale_locale(this: *mut crate::core::midi::rtme::root::std::locale);
    }
    extern "C" {
        #[link_name = "\u{1}locale"]
        pub fn locale_locale1(
            this: *mut crate::core::midi::rtme::root::std::locale,
            __other: *const crate::core::midi::rtme::root::std::locale,
        );
    }
    extern "C" {
        #[link_name = "\u{1}locale"]
        pub fn locale_locale2(
            this: *mut crate::core::midi::rtme::root::std::locale,
            __s: *const ::std::os::raw::c_char,
        );
    }
    extern "C" {
        #[link_name = "\u{1}locale"]
        pub fn locale_locale3(
            this: *mut crate::core::midi::rtme::root::std::locale,
            __base: *const crate::core::midi::rtme::root::std::locale,
            __s: *const ::std::os::raw::c_char,
            __cat: crate::core::midi::rtme::root::std::locale_category,
        );
    }
    extern "C" {
        #[link_name = "\u{1}locale"]
        pub fn locale_locale4(
            this: *mut crate::core::midi::rtme::root::std::locale,
            __base: *const crate::core::midi::rtme::root::std::locale,
            __add: *const crate::core::midi::rtme::root::std::locale,
            __cat: crate::core::midi::rtme::root::std::locale_category,
        );
    }
    extern "C" {
        #[link_name = "\u{1}locale_destructor"]
        pub fn locale_locale_destructor(this: *mut crate::core::midi::rtme::root::std::locale);
    }
    impl Default for locale {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    impl locale {
        #[inline]
        pub unsafe fn name(&self) -> crate::core::midi::rtme::root::std::__cxx11::string {
            locale_name(self)
        }
        #[inline]
        pub unsafe fn global(
            __loc: *const crate::core::midi::rtme::root::std::locale,
        ) -> crate::core::midi::rtme::root::std::locale {
            locale_global(__loc)
        }
        #[inline]
        pub unsafe fn classic() -> *const crate::core::midi::rtme::root::std::locale {
            locale_classic()
        }
        #[inline]
        pub unsafe fn new() -> Self {
            let mut __bindgen_tmp = ::std::mem::uninitialized();
            locale_locale(&mut __bindgen_tmp);
            __bindgen_tmp
        }
        #[inline]
        pub unsafe fn new1(__other: *const crate::core::midi::rtme::root::std::locale) -> Self {
            let mut __bindgen_tmp = ::std::mem::uninitialized();
            locale_locale1(&mut __bindgen_tmp, __other);
            __bindgen_tmp
        }
        #[inline]
        pub unsafe fn new2(__s: *const ::std::os::raw::c_char) -> Self {
            let mut __bindgen_tmp = ::std::mem::uninitialized();
            locale_locale2(&mut __bindgen_tmp, __s);
            __bindgen_tmp
        }
        #[inline]
        pub unsafe fn new3(
            __base: *const crate::core::midi::rtme::root::std::locale,
            __s: *const ::std::os::raw::c_char,
            __cat: crate::core::midi::rtme::root::std::locale_category,
        ) -> Self {
            let mut __bindgen_tmp = ::std::mem::uninitialized();
            locale_locale3(&mut __bindgen_tmp, __base, __s, __cat);
            __bindgen_tmp
        }
        #[inline]
        pub unsafe fn new4(
            __base: *const crate::core::midi::rtme::root::std::locale,
            __add: *const crate::core::midi::rtme::root::std::locale,
            __cat: crate::core::midi::rtme::root::std::locale_category,
        ) -> Self {
            let mut __bindgen_tmp = ::std::mem::uninitialized();
            locale_locale4(&mut __bindgen_tmp, __base, __add, __cat);
            __bindgen_tmp
        }
        #[inline]
        pub unsafe fn destruct(&mut self) {
            locale_locale_destructor(self)
        }
    }
    #[repr(C)]
    pub struct locale_facet__bindgen_vtable(::std::os::raw::c_void);
    #[repr(C)]
    #[derive(Debug, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct locale_facet {
        pub vtable_: *const locale_facet__bindgen_vtable,
        pub _M_refcount: crate::core::midi::rtme::root::_Atomic_word,
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone)]
    pub struct locale_facet___shim {
        _unused: [u8; 0],
    }
    extern "C" {
        #[link_name = "\u{1}_S_c_locale"]
        pub static mut locale_facet__S_c_locale: crate::core::midi::rtme::root::std::__c_locale;
    }
    extern "C" {
        #[link_name = "\u{1}_S_c_name"]
        pub static mut locale_facet__S_c_name: [::std::os::raw::c_char; 2usize];
    }
    extern "C" {
        #[link_name = "\u{1}_S_once"]
        pub static mut locale_facet__S_once: crate::core::midi::rtme::root::__gthread_once_t;
    }
    // #[test]
    // fn bindgen_test_layout_locale_facet() {
    //     assert_eq!(
    //         ::std::mem::size_of::<locale_facet>(),
    //         16usize,
    //         concat!("Size of: ", stringify!(locale_facet))
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<locale_facet>(),
    //         8usize,
    //         concat!("Alignment of ", stringify!(locale_facet))
    //     );
    //     assert_eq!(
    //         unsafe {
    //             &(*(::std::ptr::null::<locale_facet>()))._M_refcount as *const _ as usize
    //         },
    //         8usize,
    //         concat!(
    //             "Offset of field: ",
    //             stringify!(locale_facet),
    //             "::",
    //             stringify!(_M_refcount)
    //         )
    //     );
    // }
    extern "C" {
        #[link_name = "\u{1}_S_create_c_locale"]
        pub fn locale_facet__S_create_c_locale(
            __cloc: *mut crate::core::midi::rtme::root::std::__c_locale,
            __s: *const ::std::os::raw::c_char,
            __old: crate::core::midi::rtme::root::std::__c_locale,
        );
    }
    extern "C" {
        #[link_name = "\u{1}_S_clone_c_locale"]
        pub fn locale_facet__S_clone_c_locale(
            __cloc: *mut crate::core::midi::rtme::root::std::__c_locale,
        ) -> crate::core::midi::rtme::root::std::__c_locale;
    }
    extern "C" {
        #[link_name = "\u{1}_S_destroy_c_locale"]
        pub fn locale_facet__S_destroy_c_locale(
            __cloc: *mut crate::core::midi::rtme::root::std::__c_locale,
        );
    }
    extern "C" {
        #[link_name = "\u{1}_S_lc_ctype_c_locale"]
        pub fn locale_facet__S_lc_ctype_c_locale(
            __cloc: crate::core::midi::rtme::root::std::__c_locale,
            __s: *const ::std::os::raw::c_char,
        ) -> crate::core::midi::rtme::root::std::__c_locale;
    }
    extern "C" {
        #[link_name = "\u{1}_S_get_c_locale"]
        pub fn locale_facet__S_get_c_locale() -> crate::core::midi::rtme::root::std::__c_locale;
    }
    extern "C" {
        #[link_name = "\u{1}_S_get_c_name"]
        pub fn locale_facet__S_get_c_name() -> *const ::std::os::raw::c_char;
    }
    impl Default for locale_facet {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    impl locale_facet {
        #[inline]
        pub unsafe fn _S_create_c_locale(
            __cloc: *mut crate::core::midi::rtme::root::std::__c_locale,
            __s: *const ::std::os::raw::c_char,
            __old: crate::core::midi::rtme::root::std::__c_locale,
        ) {
            locale_facet__S_create_c_locale(__cloc, __s, __old)
        }
        #[inline]
        pub unsafe fn _S_clone_c_locale(
            __cloc: *mut crate::core::midi::rtme::root::std::__c_locale,
        ) -> crate::core::midi::rtme::root::std::__c_locale {
            locale_facet__S_clone_c_locale(__cloc)
        }
        #[inline]
        pub unsafe fn _S_destroy_c_locale(
            __cloc: *mut crate::core::midi::rtme::root::std::__c_locale,
        ) {
            locale_facet__S_destroy_c_locale(__cloc)
        }
        #[inline]
        pub unsafe fn _S_lc_ctype_c_locale(
            __cloc: crate::core::midi::rtme::root::std::__c_locale,
            __s: *const ::std::os::raw::c_char,
        ) -> crate::core::midi::rtme::root::std::__c_locale {
            locale_facet__S_lc_ctype_c_locale(__cloc, __s)
        }
        #[inline]
        pub unsafe fn _S_get_c_locale() -> crate::core::midi::rtme::root::std::__c_locale {
            locale_facet__S_get_c_locale()
        }
        #[inline]
        pub unsafe fn _S_get_c_name() -> *const ::std::os::raw::c_char {
            locale_facet__S_get_c_name()
        }
    }
    extern "C" {
        #[link_name = "\u{1}facet_destructor"]
        pub fn locale_facet_facet_destructor(
            this: *mut crate::core::midi::rtme::root::std::locale_facet,
        );
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct locale_id {
        pub _M_index: usize,
    }
    extern "C" {
        #[link_name = "\u{1}_S_refcount"]
        pub static mut locale_id__S_refcount: crate::core::midi::rtme::root::_Atomic_word;
    }
    // #[test]
    // fn bindgen_test_layout_locale_id() {
    //     assert_eq!(
    //         ::std::mem::size_of::<locale_id>(),
    //         8usize,
    //         concat!("Size of: ", stringify!(locale_id))
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<locale_id>(),
    //         8usize,
    //         concat!("Alignment of ", stringify!(locale_id))
    //     );
    //     assert_eq!(
    //         unsafe { &(*(::std::ptr::null::<locale_id>()))._M_index as *const _ as usize },
    //         0usize,
    //         concat!(
    //             "Offset of field: ",
    //             stringify!(locale_id),
    //             "::",
    //             stringify!(_M_index)
    //         )
    //     );
    // }
    extern "C" {
        #[link_name = "\u{1}_M_id"]
        pub fn locale_id__M_id(this: *const crate::core::midi::rtme::root::std::locale_id)
            -> usize;
    }
    impl locale_id {
        #[inline]
        pub unsafe fn _M_id(&self) -> usize {
            locale_id__M_id(self)
        }
    }
    #[repr(C)]
    #[derive(Debug, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct locale__Impl {
        pub _M_refcount: crate::core::midi::rtme::root::_Atomic_word,
        pub _M_facets: *mut *const crate::core::midi::rtme::root::std::locale_facet,
        pub _M_facets_size: usize,
        pub _M_caches: *mut *const crate::core::midi::rtme::root::std::locale_facet,
        pub _M_names: *mut *mut ::std::os::raw::c_char,
    }
    extern "C" {
        #[link_name = "\u{1}_S_id_ctype"]
        pub static mut locale__Impl__S_id_ctype:
            [*const crate::core::midi::rtme::root::std::locale_id; 0usize];
    }
    extern "C" {
        #[link_name = "\u{1}_S_id_numeric"]
        pub static mut locale__Impl__S_id_numeric:
            [*const crate::core::midi::rtme::root::std::locale_id; 0usize];
    }
    extern "C" {
        #[link_name = "\u{1}_S_id_collate"]
        pub static mut locale__Impl__S_id_collate:
            [*const crate::core::midi::rtme::root::std::locale_id; 0usize];
    }
    extern "C" {
        #[link_name = "\u{1}_S_id_time"]
        pub static mut locale__Impl__S_id_time:
            [*const crate::core::midi::rtme::root::std::locale_id; 0usize];
    }
    extern "C" {
        #[link_name = "\u{1}_S_id_monetary"]
        pub static mut locale__Impl__S_id_monetary:
            [*const crate::core::midi::rtme::root::std::locale_id; 0usize];
    }
    extern "C" {
        #[link_name = "\u{1}_S_id_messages"]
        pub static mut locale__Impl__S_id_messages:
            [*const crate::core::midi::rtme::root::std::locale_id; 0usize];
    }
    extern "C" {
        #[link_name = "\u{1}_S_facet_categories"]
        pub static mut locale__Impl__S_facet_categories:
            [*const *const crate::core::midi::rtme::root::std::locale_id; 0usize];
    }
    // #[test]
    // fn bindgen_test_layout_locale__Impl() {
    //     assert_eq!(
    //         ::std::mem::size_of::<locale__Impl>(),
    //         40usize,
    //         concat!("Size of: ", stringify!(locale__Impl))
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<locale__Impl>(),
    //         8usize,
    //         concat!("Alignment of ", stringify!(locale__Impl))
    //     );
    //     assert_eq!(
    //         unsafe {
    //             &(*(::std::ptr::null::<locale__Impl>()))._M_refcount as *const _ as usize
    //         },
    //         0usize,
    //         concat!(
    //             "Offset of field: ",
    //             stringify!(locale__Impl),
    //             "::",
    //             stringify!(_M_refcount)
    //         )
    //     );
    //     assert_eq!(
    //         unsafe { &(*(::std::ptr::null::<locale__Impl>()))._M_facets as *const _ as usize },
    //         8usize,
    //         concat!(
    //             "Offset of field: ",
    //             stringify!(locale__Impl),
    //             "::",
    //             stringify!(_M_facets)
    //         )
    //     );
    //     assert_eq!(
    //         unsafe {
    //             &(*(::std::ptr::null::<locale__Impl>()))._M_facets_size as *const _ as usize
    //         },
    //         16usize,
    //         concat!(
    //             "Offset of field: ",
    //             stringify!(locale__Impl),
    //             "::",
    //             stringify!(_M_facets_size)
    //         )
    //     );
    //     assert_eq!(
    //         unsafe { &(*(::std::ptr::null::<locale__Impl>()))._M_caches as *const _ as usize },
    //         24usize,
    //         concat!(
    //             "Offset of field: ",
    //             stringify!(locale__Impl),
    //             "::",
    //             stringify!(_M_caches)
    //         )
    //     );
    //     assert_eq!(
    //         unsafe { &(*(::std::ptr::null::<locale__Impl>()))._M_names as *const _ as usize },
    //         32usize,
    //         concat!(
    //             "Offset of field: ",
    //             stringify!(locale__Impl),
    //             "::",
    //             stringify!(_M_names)
    //         )
    //     );
    // }
    impl Default for locale__Impl {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    pub type collate_char_type<_CharT> = _CharT;
    pub type collate_string_type =
        crate::core::midi::rtme::root::std::__cxx11::basic_string<_CharT>;
    extern "C" {
        pub static mut id: crate::core::midi::rtme::root::std::locale_id;
    }
    pub type collate_byname_char_type<_CharT> = _CharT;
    pub type collate_byname_string_type =
        crate::core::midi::rtme::root::std::__cxx11::basic_string<_CharT>;
    // #[test]
    // fn __bindgen_test_layout_collate_open0_char_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__cxx11::collate>(),
    //         24usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__cxx11::collate)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__cxx11::collate>(),
    //         8usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__cxx11::collate)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout_collate_byname_open0_char_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__cxx11::collate_byname>(),
    //         24usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__cxx11::collate_byname)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__cxx11::collate_byname>(),
    //         8usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__cxx11::collate_byname)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout_collate_open0_wchar_t_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__cxx11::collate>(),
    //         24usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__cxx11::collate)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__cxx11::collate>(),
    //         8usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__cxx11::collate)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout_collate_byname_open0_wchar_t_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::__cxx11::collate_byname>(),
    //         24usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::__cxx11::collate_byname)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::__cxx11::collate_byname>(),
    //         8usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::__cxx11::collate_byname)
    //         )
    //     );
    // }
    pub const errc_address_family_not_supported: crate::core::midi::rtme::root::std::errc = 97;
    pub const errc_address_in_use: crate::core::midi::rtme::root::std::errc = 98;
    pub const errc_address_not_available: crate::core::midi::rtme::root::std::errc = 99;
    pub const errc_already_connected: crate::core::midi::rtme::root::std::errc = 106;
    pub const errc_argument_list_too_long: crate::core::midi::rtme::root::std::errc = 7;
    pub const errc_argument_out_of_domain: crate::core::midi::rtme::root::std::errc = 33;
    pub const errc_bad_address: crate::core::midi::rtme::root::std::errc = 14;
    pub const errc_bad_file_descriptor: crate::core::midi::rtme::root::std::errc = 9;
    pub const errc_bad_message: crate::core::midi::rtme::root::std::errc = 74;
    pub const errc_broken_pipe: crate::core::midi::rtme::root::std::errc = 32;
    pub const errc_connection_aborted: crate::core::midi::rtme::root::std::errc = 103;
    pub const errc_connection_already_in_progress: crate::core::midi::rtme::root::std::errc = 114;
    pub const errc_connection_refused: crate::core::midi::rtme::root::std::errc = 111;
    pub const errc_connection_reset: crate::core::midi::rtme::root::std::errc = 104;
    pub const errc_cross_device_link: crate::core::midi::rtme::root::std::errc = 18;
    pub const errc_destination_address_required: crate::core::midi::rtme::root::std::errc = 89;
    pub const errc_device_or_resource_busy: crate::core::midi::rtme::root::std::errc = 16;
    pub const errc_directory_not_empty: crate::core::midi::rtme::root::std::errc = 39;
    pub const errc_executable_format_error: crate::core::midi::rtme::root::std::errc = 8;
    pub const errc_file_exists: crate::core::midi::rtme::root::std::errc = 17;
    pub const errc_file_too_large: crate::core::midi::rtme::root::std::errc = 27;
    pub const errc_filename_too_long: crate::core::midi::rtme::root::std::errc = 36;
    pub const errc_function_not_supported: crate::core::midi::rtme::root::std::errc = 38;
    pub const errc_host_unreachable: crate::core::midi::rtme::root::std::errc = 113;
    pub const errc_identifier_removed: crate::core::midi::rtme::root::std::errc = 43;
    pub const errc_illegal_byte_sequence: crate::core::midi::rtme::root::std::errc = 84;
    pub const errc_inappropriate_io_control_operation: crate::core::midi::rtme::root::std::errc =
        25;
    pub const errc_interrupted: crate::core::midi::rtme::root::std::errc = 4;
    pub const errc_invalid_argument: crate::core::midi::rtme::root::std::errc = 22;
    pub const errc_invalid_seek: crate::core::midi::rtme::root::std::errc = 29;
    pub const errc_io_error: crate::core::midi::rtme::root::std::errc = 5;
    pub const errc_is_a_directory: crate::core::midi::rtme::root::std::errc = 21;
    pub const errc_message_size: crate::core::midi::rtme::root::std::errc = 90;
    pub const errc_network_down: crate::core::midi::rtme::root::std::errc = 100;
    pub const errc_network_reset: crate::core::midi::rtme::root::std::errc = 102;
    pub const errc_network_unreachable: crate::core::midi::rtme::root::std::errc = 101;
    pub const errc_no_buffer_space: crate::core::midi::rtme::root::std::errc = 105;
    pub const errc_no_child_process: crate::core::midi::rtme::root::std::errc = 10;
    pub const errc_no_link: crate::core::midi::rtme::root::std::errc = 67;
    pub const errc_no_lock_available: crate::core::midi::rtme::root::std::errc = 37;
    pub const errc_no_message_available: crate::core::midi::rtme::root::std::errc = 61;
    pub const errc_no_message: crate::core::midi::rtme::root::std::errc = 42;
    pub const errc_no_protocol_option: crate::core::midi::rtme::root::std::errc = 92;
    pub const errc_no_space_on_device: crate::core::midi::rtme::root::std::errc = 28;
    pub const errc_no_stream_resources: crate::core::midi::rtme::root::std::errc = 63;
    pub const errc_no_such_device_or_address: crate::core::midi::rtme::root::std::errc = 6;
    pub const errc_no_such_device: crate::core::midi::rtme::root::std::errc = 19;
    pub const errc_no_such_file_or_directory: crate::core::midi::rtme::root::std::errc = 2;
    pub const errc_no_such_process: crate::core::midi::rtme::root::std::errc = 3;
    pub const errc_not_a_directory: crate::core::midi::rtme::root::std::errc = 20;
    pub const errc_not_a_socket: crate::core::midi::rtme::root::std::errc = 88;
    pub const errc_not_a_stream: crate::core::midi::rtme::root::std::errc = 60;
    pub const errc_not_connected: crate::core::midi::rtme::root::std::errc = 107;
    pub const errc_not_enough_memory: crate::core::midi::rtme::root::std::errc = 12;
    pub const errc_not_supported: crate::core::midi::rtme::root::std::errc = 95;
    pub const errc_operation_canceled: crate::core::midi::rtme::root::std::errc = 125;
    pub const errc_operation_in_progress: crate::core::midi::rtme::root::std::errc = 115;
    pub const errc_operation_not_permitted: crate::core::midi::rtme::root::std::errc = 1;
    pub const errc_operation_not_supported: crate::core::midi::rtme::root::std::errc = 95;
    pub const errc_operation_would_block: crate::core::midi::rtme::root::std::errc = 11;
    pub const errc_owner_dead: crate::core::midi::rtme::root::std::errc = 130;
    pub const errc_permission_denied: crate::core::midi::rtme::root::std::errc = 13;
    pub const errc_protocol_error: crate::core::midi::rtme::root::std::errc = 71;
    pub const errc_protocol_not_supported: crate::core::midi::rtme::root::std::errc = 93;
    pub const errc_read_only_file_system: crate::core::midi::rtme::root::std::errc = 30;
    pub const errc_resource_deadlock_would_occur: crate::core::midi::rtme::root::std::errc = 35;
    pub const errc_resource_unavailable_try_again: crate::core::midi::rtme::root::std::errc = 11;
    pub const errc_result_out_of_range: crate::core::midi::rtme::root::std::errc = 34;
    pub const errc_state_not_recoverable: crate::core::midi::rtme::root::std::errc = 131;
    pub const errc_stream_timeout: crate::core::midi::rtme::root::std::errc = 62;
    pub const errc_text_file_busy: crate::core::midi::rtme::root::std::errc = 26;
    pub const errc_timed_out: crate::core::midi::rtme::root::std::errc = 110;
    pub const errc_too_many_files_open_in_system: crate::core::midi::rtme::root::std::errc = 23;
    pub const errc_too_many_files_open: crate::core::midi::rtme::root::std::errc = 24;
    pub const errc_too_many_links: crate::core::midi::rtme::root::std::errc = 31;
    pub const errc_too_many_symbolic_link_levels: crate::core::midi::rtme::root::std::errc = 40;
    pub const errc_value_too_large: crate::core::midi::rtme::root::std::errc = 75;
    pub const errc_wrong_protocol_type: crate::core::midi::rtme::root::std::errc = 91;
    pub type errc = i32;
    #[repr(C)]
    pub struct __cow_string {
        pub __bindgen_anon_1: crate::core::midi::rtme::root::std::__cow_string__bindgen_ty_1,
    }
    #[repr(C)]
    #[derive(Copy, Clone)]
    pub union __cow_string__bindgen_ty_1 {
        pub _M_p: *const ::std::os::raw::c_char,
        pub _M_bytes: [::std::os::raw::c_char; 8usize],
        _bindgen_union_align: u64,
    }
    // #[test]
    // fn bindgen_test_layout___cow_string__bindgen_ty_1() {
    //     assert_eq!(
    //         ::std::mem::size_of::<__cow_string__bindgen_ty_1>(),
    //         8usize,
    //         concat!("Size of: ", stringify!(__cow_string__bindgen_ty_1))
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<__cow_string__bindgen_ty_1>(),
    //         8usize,
    //         concat!("Alignment of ", stringify!(__cow_string__bindgen_ty_1))
    //     );
    //     assert_eq!(
    //         unsafe {
    //             &(*(::std::ptr::null::<__cow_string__bindgen_ty_1>()))._M_p as *const _ as usize
    //         },
    //         0usize,
    //         concat!(
    //             "Offset of field: ",
    //             stringify!(__cow_string__bindgen_ty_1),
    //             "::",
    //             stringify!(_M_p)
    //         )
    //     );
    //     assert_eq!(
    //         unsafe {
    //             &(*(::std::ptr::null::<__cow_string__bindgen_ty_1>()))._M_bytes as *const _
    //                 as usize
    //         },
    //         0usize,
    //         concat!(
    //             "Offset of field: ",
    //             stringify!(__cow_string__bindgen_ty_1),
    //             "::",
    //             stringify!(_M_bytes)
    //         )
    //     );
    // }
    impl Default for __cow_string__bindgen_ty_1 {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    impl ::std::fmt::Debug for __cow_string__bindgen_ty_1 {
        fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
            write!(f, "__cow_string__bindgen_ty_1 {{ union }}")
        }
    }
    // #[test]
    // fn bindgen_test_layout___cow_string() {
    //     assert_eq!(
    //         ::std::mem::size_of::<__cow_string>(),
    //         8usize,
    //         concat!("Size of: ", stringify!(__cow_string))
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<__cow_string>(),
    //         8usize,
    //         concat!("Alignment of ", stringify!(__cow_string))
    //     );
    // }
    extern "C" {
        #[link_name = "\u{1}__cow_string"]
        pub fn __cow_string___cow_string(
            this: *mut crate::core::midi::rtme::root::std::__cow_string,
        );
    }
    extern "C" {
        #[link_name = "\u{1}__cow_string"]
        pub fn __cow_string___cow_string1(
            this: *mut crate::core::midi::rtme::root::std::__cow_string,
            arg1: *const crate::core::midi::rtme::root::std::__cxx11::string,
        );
    }
    extern "C" {
        #[link_name = "\u{1}__cow_string"]
        pub fn __cow_string___cow_string2(
            this: *mut crate::core::midi::rtme::root::std::__cow_string,
            arg1: *const ::std::os::raw::c_char,
            arg2: usize,
        );
    }
    extern "C" {
        #[link_name = "\u{1}__cow_string"]
        pub fn __cow_string___cow_string3(
            this: *mut crate::core::midi::rtme::root::std::__cow_string,
            arg1: *const crate::core::midi::rtme::root::std::__cow_string,
        );
    }
    extern "C" {
        #[link_name = "\u{1}__cow_string"]
        pub fn __cow_string___cow_string4(
            this: *mut crate::core::midi::rtme::root::std::__cow_string,
            arg1: *mut crate::core::midi::rtme::root::std::__cow_string,
        );
    }
    extern "C" {
        #[link_name = "\u{1}__cow_string_destructor"]
        pub fn __cow_string___cow_string_destructor(
            this: *mut crate::core::midi::rtme::root::std::__cow_string,
        );
    }
    impl Default for __cow_string {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    impl ::std::fmt::Debug for __cow_string {
        fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
            write!(
                f,
                "__cow_string {{ __bindgen_anon_1: {:?} }}",
                self.__bindgen_anon_1
            )
        }
    }
    impl __cow_string {
        #[inline]
        pub unsafe fn new() -> Self {
            let mut __bindgen_tmp = ::std::mem::uninitialized();
            __cow_string___cow_string(&mut __bindgen_tmp);
            __bindgen_tmp
        }
        #[inline]
        pub unsafe fn new1(
            arg1: *const crate::core::midi::rtme::root::std::__cxx11::string,
        ) -> Self {
            let mut __bindgen_tmp = ::std::mem::uninitialized();
            __cow_string___cow_string1(&mut __bindgen_tmp, arg1);
            __bindgen_tmp
        }
        #[inline]
        pub unsafe fn new2(arg1: *const ::std::os::raw::c_char, arg2: usize) -> Self {
            let mut __bindgen_tmp = ::std::mem::uninitialized();
            __cow_string___cow_string2(&mut __bindgen_tmp, arg1, arg2);
            __bindgen_tmp
        }
        #[inline]
        pub unsafe fn new3(arg1: *const crate::core::midi::rtme::root::std::__cow_string) -> Self {
            let mut __bindgen_tmp = ::std::mem::uninitialized();
            __cow_string___cow_string3(&mut __bindgen_tmp, arg1);
            __bindgen_tmp
        }
        #[inline]
        pub unsafe fn new4(arg1: *mut crate::core::midi::rtme::root::std::__cow_string) -> Self {
            let mut __bindgen_tmp = ::std::mem::uninitialized();
            __cow_string___cow_string4(&mut __bindgen_tmp, arg1);
            __bindgen_tmp
        }
        #[inline]
        pub unsafe fn destruct(&mut self) {
            __cow_string___cow_string_destructor(self)
        }
    }
    pub type __sso_string =
        crate::core::midi::rtme::root::std::__cxx11::basic_string<::std::os::raw::c_char>;
    #[repr(C)]
    pub struct logic_error {
        pub _base: crate::core::midi::rtme::root::std::exception,
        pub _M_msg: crate::core::midi::rtme::root::std::__cow_string,
    }
    // #[test]
    // fn bindgen_test_layout_logic_error() {
    //     assert_eq!(
    //         ::std::mem::size_of::<logic_error>(),
    //         16usize,
    //         concat!("Size of: ", stringify!(logic_error))
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<logic_error>(),
    //         8usize,
    //         concat!("Alignment of ", stringify!(logic_error))
    //     );
    //     assert_eq!(
    //         unsafe { &(*(::std::ptr::null::<logic_error>()))._M_msg as *const _ as usize },
    //         8usize,
    //         concat!(
    //             "Offset of field: ",
    //             stringify!(logic_error),
    //             "::",
    //             stringify!(_M_msg)
    //         )
    //     );
    // }
    extern "C" {
        #[link_name = "\u{1}logic_error"]
        pub fn logic_error_logic_error(
            this: *mut crate::core::midi::rtme::root::std::logic_error,
            __arg: *const crate::core::midi::rtme::root::std::__cxx11::string,
        );
    }
    extern "C" {
        #[link_name = "\u{1}logic_error"]
        pub fn logic_error_logic_error1(
            this: *mut crate::core::midi::rtme::root::std::logic_error,
            arg1: *const ::std::os::raw::c_char,
        );
    }
    extern "C" {
        #[link_name = "\u{1}logic_error"]
        pub fn logic_error_logic_error2(
            this: *mut crate::core::midi::rtme::root::std::logic_error,
            arg1: *const crate::core::midi::rtme::root::std::logic_error,
        );
    }
    impl Default for logic_error {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    impl ::std::fmt::Debug for logic_error {
        fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
            write!(f, "logic_error {{ _M_msg: {:?} }}", self._M_msg)
        }
    }
    impl logic_error {
        #[inline]
        pub unsafe fn new(
            __arg: *const crate::core::midi::rtme::root::std::__cxx11::string,
        ) -> Self {
            let mut __bindgen_tmp = ::std::mem::uninitialized();
            logic_error_logic_error(&mut __bindgen_tmp, __arg);
            __bindgen_tmp
        }
        #[inline]
        pub unsafe fn new1(arg1: *const ::std::os::raw::c_char) -> Self {
            let mut __bindgen_tmp = ::std::mem::uninitialized();
            logic_error_logic_error1(&mut __bindgen_tmp, arg1);
            __bindgen_tmp
        }
        #[inline]
        pub unsafe fn new2(arg1: *const crate::core::midi::rtme::root::std::logic_error) -> Self {
            let mut __bindgen_tmp = ::std::mem::uninitialized();
            logic_error_logic_error2(&mut __bindgen_tmp, arg1);
            __bindgen_tmp
        }
    }
    extern "C" {
        #[link_name = "\u{1}logic_error_destructor"]
        pub fn logic_error_logic_error_destructor(
            this: *mut crate::core::midi::rtme::root::std::logic_error,
        );
    }
    extern "C" {
        #[link_name = "\u{1}what"]
        pub fn logic_error_what(this: *mut ::std::os::raw::c_void)
            -> *const ::std::os::raw::c_char;
    }
    #[repr(C)]
    pub struct domain_error {
        pub _base: crate::core::midi::rtme::root::std::logic_error,
    }
    // #[test]
    // fn bindgen_test_layout_domain_error() {
    //     assert_eq!(
    //         ::std::mem::size_of::<domain_error>(),
    //         16usize,
    //         concat!("Size of: ", stringify!(domain_error))
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<domain_error>(),
    //         8usize,
    //         concat!("Alignment of ", stringify!(domain_error))
    //     );
    // }
    extern "C" {
        #[link_name = "\u{1}domain_error"]
        pub fn domain_error_domain_error(
            this: *mut crate::core::midi::rtme::root::std::domain_error,
            __arg: *const crate::core::midi::rtme::root::std::__cxx11::string,
        );
    }
    extern "C" {
        #[link_name = "\u{1}domain_error"]
        pub fn domain_error_domain_error1(
            this: *mut crate::core::midi::rtme::root::std::domain_error,
            arg1: *const ::std::os::raw::c_char,
        );
    }
    impl Default for domain_error {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    impl ::std::fmt::Debug for domain_error {
        fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
            write!(f, "domain_error {{  }}")
        }
    }
    impl domain_error {
        #[inline]
        pub unsafe fn new(
            __arg: *const crate::core::midi::rtme::root::std::__cxx11::string,
        ) -> Self {
            let mut __bindgen_tmp = ::std::mem::uninitialized();
            domain_error_domain_error(&mut __bindgen_tmp, __arg);
            __bindgen_tmp
        }
        #[inline]
        pub unsafe fn new1(arg1: *const ::std::os::raw::c_char) -> Self {
            let mut __bindgen_tmp = ::std::mem::uninitialized();
            domain_error_domain_error1(&mut __bindgen_tmp, arg1);
            __bindgen_tmp
        }
    }
    extern "C" {
        #[link_name = "\u{1}domain_error_destructor"]
        pub fn domain_error_domain_error_destructor(
            this: *mut crate::core::midi::rtme::root::std::domain_error,
        );
    }
    #[repr(C)]
    pub struct invalid_argument {
        pub _base: crate::core::midi::rtme::root::std::logic_error,
    }
    // #[test]
    // fn bindgen_test_layout_invalid_argument() {
    //     assert_eq!(
    //         ::std::mem::size_of::<invalid_argument>(),
    //         16usize,
    //         concat!("Size of: ", stringify!(invalid_argument))
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<invalid_argument>(),
    //         8usize,
    //         concat!("Alignment of ", stringify!(invalid_argument))
    //     );
    // }
    extern "C" {
        #[link_name = "\u{1}invalid_argument"]
        pub fn invalid_argument_invalid_argument(
            this: *mut crate::core::midi::rtme::root::std::invalid_argument,
            __arg: *const crate::core::midi::rtme::root::std::__cxx11::string,
        );
    }
    extern "C" {
        #[link_name = "\u{1}invalid_argument"]
        pub fn invalid_argument_invalid_argument1(
            this: *mut crate::core::midi::rtme::root::std::invalid_argument,
            arg1: *const ::std::os::raw::c_char,
        );
    }
    impl Default for invalid_argument {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    impl ::std::fmt::Debug for invalid_argument {
        fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
            write!(f, "invalid_argument {{  }}")
        }
    }
    impl invalid_argument {
        #[inline]
        pub unsafe fn new(
            __arg: *const crate::core::midi::rtme::root::std::__cxx11::string,
        ) -> Self {
            let mut __bindgen_tmp = ::std::mem::uninitialized();
            invalid_argument_invalid_argument(&mut __bindgen_tmp, __arg);
            __bindgen_tmp
        }
        #[inline]
        pub unsafe fn new1(arg1: *const ::std::os::raw::c_char) -> Self {
            let mut __bindgen_tmp = ::std::mem::uninitialized();
            invalid_argument_invalid_argument1(&mut __bindgen_tmp, arg1);
            __bindgen_tmp
        }
    }
    extern "C" {
        #[link_name = "\u{1}invalid_argument_destructor"]
        pub fn invalid_argument_invalid_argument_destructor(
            this: *mut crate::core::midi::rtme::root::std::invalid_argument,
        );
    }
    #[repr(C)]
    pub struct length_error {
        pub _base: crate::core::midi::rtme::root::std::logic_error,
    }
    // #[test]
    // fn bindgen_test_layout_length_error() {
    //     assert_eq!(
    //         ::std::mem::size_of::<length_error>(),
    //         16usize,
    //         concat!("Size of: ", stringify!(length_error))
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<length_error>(),
    //         8usize,
    //         concat!("Alignment of ", stringify!(length_error))
    //     );
    // }
    extern "C" {
        #[link_name = "\u{1}length_error"]
        pub fn length_error_length_error(
            this: *mut crate::core::midi::rtme::root::std::length_error,
            __arg: *const crate::core::midi::rtme::root::std::__cxx11::string,
        );
    }
    extern "C" {
        #[link_name = "\u{1}length_error"]
        pub fn length_error_length_error1(
            this: *mut crate::core::midi::rtme::root::std::length_error,
            arg1: *const ::std::os::raw::c_char,
        );
    }
    impl Default for length_error {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    impl ::std::fmt::Debug for length_error {
        fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
            write!(f, "length_error {{  }}")
        }
    }
    impl length_error {
        #[inline]
        pub unsafe fn new(
            __arg: *const crate::core::midi::rtme::root::std::__cxx11::string,
        ) -> Self {
            let mut __bindgen_tmp = ::std::mem::uninitialized();
            length_error_length_error(&mut __bindgen_tmp, __arg);
            __bindgen_tmp
        }
        #[inline]
        pub unsafe fn new1(arg1: *const ::std::os::raw::c_char) -> Self {
            let mut __bindgen_tmp = ::std::mem::uninitialized();
            length_error_length_error1(&mut __bindgen_tmp, arg1);
            __bindgen_tmp
        }
    }
    extern "C" {
        #[link_name = "\u{1}length_error_destructor"]
        pub fn length_error_length_error_destructor(
            this: *mut crate::core::midi::rtme::root::std::length_error,
        );
    }
    #[repr(C)]
    pub struct out_of_range {
        pub _base: crate::core::midi::rtme::root::std::logic_error,
    }
    // #[test]
    // fn bindgen_test_layout_out_of_range() {
    //     assert_eq!(
    //         ::std::mem::size_of::<out_of_range>(),
    //         16usize,
    //         concat!("Size of: ", stringify!(out_of_range))
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<out_of_range>(),
    //         8usize,
    //         concat!("Alignment of ", stringify!(out_of_range))
    //     );
    // }
    extern "C" {
        #[link_name = "\u{1}out_of_range"]
        pub fn out_of_range_out_of_range(
            this: *mut crate::core::midi::rtme::root::std::out_of_range,
            __arg: *const crate::core::midi::rtme::root::std::__cxx11::string,
        );
    }
    extern "C" {
        #[link_name = "\u{1}out_of_range"]
        pub fn out_of_range_out_of_range1(
            this: *mut crate::core::midi::rtme::root::std::out_of_range,
            arg1: *const ::std::os::raw::c_char,
        );
    }
    impl Default for out_of_range {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    impl ::std::fmt::Debug for out_of_range {
        fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
            write!(f, "out_of_range {{  }}")
        }
    }
    impl out_of_range {
        #[inline]
        pub unsafe fn new(
            __arg: *const crate::core::midi::rtme::root::std::__cxx11::string,
        ) -> Self {
            let mut __bindgen_tmp = ::std::mem::uninitialized();
            out_of_range_out_of_range(&mut __bindgen_tmp, __arg);
            __bindgen_tmp
        }
        #[inline]
        pub unsafe fn new1(arg1: *const ::std::os::raw::c_char) -> Self {
            let mut __bindgen_tmp = ::std::mem::uninitialized();
            out_of_range_out_of_range1(&mut __bindgen_tmp, arg1);
            __bindgen_tmp
        }
    }
    extern "C" {
        #[link_name = "\u{1}out_of_range_destructor"]
        pub fn out_of_range_out_of_range_destructor(
            this: *mut crate::core::midi::rtme::root::std::out_of_range,
        );
    }
    #[repr(C)]
    pub struct runtime_error {
        pub _base: crate::core::midi::rtme::root::std::exception,
        pub _M_msg: crate::core::midi::rtme::root::std::__cow_string,
    }
    // #[test]
    // fn bindgen_test_layout_runtime_error() {
    //     assert_eq!(
    //         ::std::mem::size_of::<runtime_error>(),
    //         16usize,
    //         concat!("Size of: ", stringify!(runtime_error))
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<runtime_error>(),
    //         8usize,
    //         concat!("Alignment of ", stringify!(runtime_error))
    //     );
    //     assert_eq!(
    //         unsafe { &(*(::std::ptr::null::<runtime_error>()))._M_msg as *const _ as usize },
    //         8usize,
    //         concat!(
    //             "Offset of field: ",
    //             stringify!(runtime_error),
    //             "::",
    //             stringify!(_M_msg)
    //         )
    //     );
    // }
    extern "C" {
        #[link_name = "\u{1}runtime_error"]
        pub fn runtime_error_runtime_error(
            this: *mut crate::core::midi::rtme::root::std::runtime_error,
            __arg: *const crate::core::midi::rtme::root::std::__cxx11::string,
        );
    }
    extern "C" {
        #[link_name = "\u{1}runtime_error"]
        pub fn runtime_error_runtime_error1(
            this: *mut crate::core::midi::rtme::root::std::runtime_error,
            arg1: *const ::std::os::raw::c_char,
        );
    }
    extern "C" {
        #[link_name = "\u{1}runtime_error"]
        pub fn runtime_error_runtime_error2(
            this: *mut crate::core::midi::rtme::root::std::runtime_error,
            arg1: *const crate::core::midi::rtme::root::std::runtime_error,
        );
    }
    impl Default for runtime_error {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    impl ::std::fmt::Debug for runtime_error {
        fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
            write!(f, "runtime_error {{ _M_msg: {:?} }}", self._M_msg)
        }
    }
    impl runtime_error {
        #[inline]
        pub unsafe fn new(
            __arg: *const crate::core::midi::rtme::root::std::__cxx11::string,
        ) -> Self {
            let mut __bindgen_tmp = ::std::mem::uninitialized();
            runtime_error_runtime_error(&mut __bindgen_tmp, __arg);
            __bindgen_tmp
        }
        #[inline]
        pub unsafe fn new1(arg1: *const ::std::os::raw::c_char) -> Self {
            let mut __bindgen_tmp = ::std::mem::uninitialized();
            runtime_error_runtime_error1(&mut __bindgen_tmp, arg1);
            __bindgen_tmp
        }
        #[inline]
        pub unsafe fn new2(arg1: *const crate::core::midi::rtme::root::std::runtime_error) -> Self {
            let mut __bindgen_tmp = ::std::mem::uninitialized();
            runtime_error_runtime_error2(&mut __bindgen_tmp, arg1);
            __bindgen_tmp
        }
    }
    extern "C" {
        #[link_name = "\u{1}runtime_error_destructor"]
        pub fn runtime_error_runtime_error_destructor(
            this: *mut crate::core::midi::rtme::root::std::runtime_error,
        );
    }
    extern "C" {
        #[link_name = "\u{1}what"]
        pub fn runtime_error_what(
            this: *mut ::std::os::raw::c_void,
        ) -> *const ::std::os::raw::c_char;
    }
    #[repr(C)]
    pub struct range_error {
        pub _base: crate::core::midi::rtme::root::std::runtime_error,
    }
    // #[test]
    // fn bindgen_test_layout_range_error() {
    //     assert_eq!(
    //         ::std::mem::size_of::<range_error>(),
    //         16usize,
    //         concat!("Size of: ", stringify!(range_error))
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<range_error>(),
    //         8usize,
    //         concat!("Alignment of ", stringify!(range_error))
    //     );
    // }
    extern "C" {
        #[link_name = "\u{1}range_error"]
        pub fn range_error_range_error(
            this: *mut crate::core::midi::rtme::root::std::range_error,
            __arg: *const crate::core::midi::rtme::root::std::__cxx11::string,
        );
    }
    extern "C" {
        #[link_name = "\u{1}range_error"]
        pub fn range_error_range_error1(
            this: *mut crate::core::midi::rtme::root::std::range_error,
            arg1: *const ::std::os::raw::c_char,
        );
    }
    impl Default for range_error {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    impl ::std::fmt::Debug for range_error {
        fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
            write!(f, "range_error {{  }}")
        }
    }
    impl range_error {
        #[inline]
        pub unsafe fn new(
            __arg: *const crate::core::midi::rtme::root::std::__cxx11::string,
        ) -> Self {
            let mut __bindgen_tmp = ::std::mem::uninitialized();
            range_error_range_error(&mut __bindgen_tmp, __arg);
            __bindgen_tmp
        }
        #[inline]
        pub unsafe fn new1(arg1: *const ::std::os::raw::c_char) -> Self {
            let mut __bindgen_tmp = ::std::mem::uninitialized();
            range_error_range_error1(&mut __bindgen_tmp, arg1);
            __bindgen_tmp
        }
    }
    extern "C" {
        #[link_name = "\u{1}range_error_destructor"]
        pub fn range_error_range_error_destructor(
            this: *mut crate::core::midi::rtme::root::std::range_error,
        );
    }
    #[repr(C)]
    pub struct overflow_error {
        pub _base: crate::core::midi::rtme::root::std::runtime_error,
    }
    // #[test]
    // fn bindgen_test_layout_overflow_error() {
    //     assert_eq!(
    //         ::std::mem::size_of::<overflow_error>(),
    //         16usize,
    //         concat!("Size of: ", stringify!(overflow_error))
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<overflow_error>(),
    //         8usize,
    //         concat!("Alignment of ", stringify!(overflow_error))
    //     );
    // }
    extern "C" {
        #[link_name = "\u{1}overflow_error"]
        pub fn overflow_error_overflow_error(
            this: *mut crate::core::midi::rtme::root::std::overflow_error,
            __arg: *const crate::core::midi::rtme::root::std::__cxx11::string,
        );
    }
    extern "C" {
        #[link_name = "\u{1}overflow_error"]
        pub fn overflow_error_overflow_error1(
            this: *mut crate::core::midi::rtme::root::std::overflow_error,
            arg1: *const ::std::os::raw::c_char,
        );
    }
    impl Default for overflow_error {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    impl ::std::fmt::Debug for overflow_error {
        fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
            write!(f, "overflow_error {{  }}")
        }
    }
    impl overflow_error {
        #[inline]
        pub unsafe fn new(
            __arg: *const crate::core::midi::rtme::root::std::__cxx11::string,
        ) -> Self {
            let mut __bindgen_tmp = ::std::mem::uninitialized();
            overflow_error_overflow_error(&mut __bindgen_tmp, __arg);
            __bindgen_tmp
        }
        #[inline]
        pub unsafe fn new1(arg1: *const ::std::os::raw::c_char) -> Self {
            let mut __bindgen_tmp = ::std::mem::uninitialized();
            overflow_error_overflow_error1(&mut __bindgen_tmp, arg1);
            __bindgen_tmp
        }
    }
    extern "C" {
        #[link_name = "\u{1}overflow_error_destructor"]
        pub fn overflow_error_overflow_error_destructor(
            this: *mut crate::core::midi::rtme::root::std::overflow_error,
        );
    }
    #[repr(C)]
    pub struct underflow_error {
        pub _base: crate::core::midi::rtme::root::std::runtime_error,
    }
    // #[test]
    // fn bindgen_test_layout_underflow_error() {
    //     assert_eq!(
    //         ::std::mem::size_of::<underflow_error>(),
    //         16usize,
    //         concat!("Size of: ", stringify!(underflow_error))
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<underflow_error>(),
    //         8usize,
    //         concat!("Alignment of ", stringify!(underflow_error))
    //     );
    // }
    extern "C" {
        #[link_name = "\u{1}underflow_error"]
        pub fn underflow_error_underflow_error(
            this: *mut crate::core::midi::rtme::root::std::underflow_error,
            __arg: *const crate::core::midi::rtme::root::std::__cxx11::string,
        );
    }
    extern "C" {
        #[link_name = "\u{1}underflow_error"]
        pub fn underflow_error_underflow_error1(
            this: *mut crate::core::midi::rtme::root::std::underflow_error,
            arg1: *const ::std::os::raw::c_char,
        );
    }
    impl Default for underflow_error {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    impl ::std::fmt::Debug for underflow_error {
        fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
            write!(f, "underflow_error {{  }}")
        }
    }
    impl underflow_error {
        #[inline]
        pub unsafe fn new(
            __arg: *const crate::core::midi::rtme::root::std::__cxx11::string,
        ) -> Self {
            let mut __bindgen_tmp = ::std::mem::uninitialized();
            underflow_error_underflow_error(&mut __bindgen_tmp, __arg);
            __bindgen_tmp
        }
        #[inline]
        pub unsafe fn new1(arg1: *const ::std::os::raw::c_char) -> Self {
            let mut __bindgen_tmp = ::std::mem::uninitialized();
            underflow_error_underflow_error1(&mut __bindgen_tmp, arg1);
            __bindgen_tmp
        }
    }
    extern "C" {
        #[link_name = "\u{1}underflow_error_destructor"]
        pub fn underflow_error_underflow_error_destructor(
            this: *mut crate::core::midi::rtme::root::std::underflow_error,
        );
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct is_error_code_enum {
        pub _base: crate::core::midi::rtme::root::std::false_type,
    }
    #[repr(C)]
    #[derive(Debug, Default, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct is_error_condition_enum {
        pub _base: crate::core::midi::rtme::root::std::false_type,
    }
    // #[test]
    // fn __bindgen_test_layout_is_error_condition_enum_open0_errc_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::is_error_condition_enum>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::is_error_condition_enum)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::is_error_condition_enum>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::is_error_condition_enum)
    //         )
    //     );
    // }
    pub mod _V2 {

        #[repr(C)]
        pub struct error_category__bindgen_vtable(::std::os::raw::c_void);
        #[repr(C)]
        #[derive(Debug, Hash, PartialOrd, Ord, PartialEq, Eq)]
        pub struct error_category {
            pub vtable_: *const error_category__bindgen_vtable,
        }
        // #[test]
        // fn bindgen_test_layout_error_category() {
        //     assert_eq!(
        //         ::std::mem::size_of::<error_category>(),
        //         8usize,
        //         concat!("Size of: ", stringify!(error_category))
        //     );
        //     assert_eq!(
        //         ::std::mem::align_of::<error_category>(),
        //         8usize,
        //         concat!("Alignment of ", stringify!(error_category))
        //     );
        // }
        impl Default for error_category {
            fn default() -> Self {
                unsafe { ::std::mem::zeroed() }
            }
        }
        extern "C" {
            #[link_name = "\u{1}error_category_destructor"]
            pub fn error_category_error_category_destructor(
                this: *mut crate::core::midi::rtme::root::std::_V2::error_category,
            );
        }
        extern "C" {
            #[link_name = "\u{1}default_error_condition"]
            pub fn error_category_default_error_condition(
                this: *mut ::std::os::raw::c_void,
                __i: ::std::os::raw::c_int,
            ) -> crate::core::midi::rtme::root::std::error_condition;
        }
        extern "C" {
            #[link_name = "\u{1}equivalent"]
            pub fn error_category_equivalent(
                this: *mut ::std::os::raw::c_void,
                __i: ::std::os::raw::c_int,
                __cond: *const crate::core::midi::rtme::root::std::error_condition,
            ) -> bool;
        }
        extern "C" {
            #[link_name = "\u{1}equivalent"]
            pub fn error_category_equivalent1(
                this: *mut ::std::os::raw::c_void,
                __code: *const crate::core::midi::rtme::root::std::error_code,
                __i: ::std::os::raw::c_int,
            ) -> bool;
        }
        extern "C" {
            pub fn system_category(
            ) -> *const crate::core::midi::rtme::root::std::_V2::error_category;
        }
        extern "C" {
            pub fn generic_category(
            ) -> *const crate::core::midi::rtme::root::std::_V2::error_category;
        }
    }
    extern "C" {
        pub fn make_error_code(
            arg1: crate::core::midi::rtme::root::std::errc,
        ) -> crate::core::midi::rtme::root::std::error_code;
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct error_code {
        pub _M_value: ::std::os::raw::c_int,
        pub _M_cat: *const crate::core::midi::rtme::root::std::_V2::error_category,
    }
    // #[test]
    // fn bindgen_test_layout_error_code() {
    //     assert_eq!(
    //         ::std::mem::size_of::<error_code>(),
    //         16usize,
    //         concat!("Size of: ", stringify!(error_code))
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<error_code>(),
    //         8usize,
    //         concat!("Alignment of ", stringify!(error_code))
    //     );
    //     assert_eq!(
    //         unsafe { &(*(::std::ptr::null::<error_code>()))._M_value as *const _ as usize },
    //         0usize,
    //         concat!(
    //             "Offset of field: ",
    //             stringify!(error_code),
    //             "::",
    //             stringify!(_M_value)
    //         )
    //     );
    //     assert_eq!(
    //         unsafe { &(*(::std::ptr::null::<error_code>()))._M_cat as *const _ as usize },
    //         8usize,
    //         concat!(
    //             "Offset of field: ",
    //             stringify!(error_code),
    //             "::",
    //             stringify!(_M_cat)
    //         )
    //     );
    // }
    extern "C" {
        #[link_name = "\u{1}default_error_condition"]
        pub fn error_code_default_error_condition(
            this: *const crate::core::midi::rtme::root::std::error_code,
        ) -> crate::core::midi::rtme::root::std::error_condition;
    }
    impl Default for error_code {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    impl error_code {
        #[inline]
        pub unsafe fn default_error_condition(
            &self,
        ) -> crate::core::midi::rtme::root::std::error_condition {
            error_code_default_error_condition(self)
        }
    }
    extern "C" {
        pub fn make_error_condition(
            arg1: crate::core::midi::rtme::root::std::errc,
        ) -> crate::core::midi::rtme::root::std::error_condition;
    }
    #[repr(C)]
    #[derive(Debug, Copy, Clone, Hash, PartialOrd, Ord, PartialEq, Eq)]
    pub struct error_condition {
        pub _M_value: ::std::os::raw::c_int,
        pub _M_cat: *const crate::core::midi::rtme::root::std::_V2::error_category,
    }
    // #[test]
    // fn bindgen_test_layout_error_condition() {
    //     assert_eq!(
    //         ::std::mem::size_of::<error_condition>(),
    //         16usize,
    //         concat!("Size of: ", stringify!(error_condition))
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<error_condition>(),
    //         8usize,
    //         concat!("Alignment of ", stringify!(error_condition))
    //     );
    //     assert_eq!(
    //         unsafe {
    //             &(*(::std::ptr::null::<error_condition>()))._M_value as *const _ as usize
    //         },
    //         0usize,
    //         concat!(
    //             "Offset of field: ",
    //             stringify!(error_condition),
    //             "::",
    //             stringify!(_M_value)
    //         )
    //     );
    //     assert_eq!(
    //         unsafe { &(*(::std::ptr::null::<error_condition>()))._M_cat as *const _ as usize },
    //         8usize,
    //         concat!(
    //             "Offset of field: ",
    //             stringify!(error_condition),
    //             "::",
    //             stringify!(_M_cat)
    //         )
    //     );
    // }
    impl Default for error_condition {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    #[repr(C)]
    pub struct system_error {
        pub _base: crate::core::midi::rtme::root::std::runtime_error,
        pub _M_code: crate::core::midi::rtme::root::std::error_code,
    }
    // #[test]
    // fn bindgen_test_layout_system_error() {
    //     assert_eq!(
    //         ::std::mem::size_of::<system_error>(),
    //         32usize,
    //         concat!("Size of: ", stringify!(system_error))
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<system_error>(),
    //         8usize,
    //         concat!("Alignment of ", stringify!(system_error))
    //     );
    //     assert_eq!(
    //         unsafe { &(*(::std::ptr::null::<system_error>()))._M_code as *const _ as usize },
    //         16usize,
    //         concat!(
    //             "Offset of field: ",
    //             stringify!(system_error),
    //             "::",
    //             stringify!(_M_code)
    //         )
    //     );
    // }
    impl Default for system_error {
        fn default() -> Self {
            unsafe { ::std::mem::zeroed() }
        }
    }
    impl ::std::fmt::Debug for system_error {
        fn fmt(&self, f: &mut ::std::fmt::Formatter<'_>) -> ::std::fmt::Result {
            write!(f, "system_error {{ _M_code: {:?} }}", self._M_code)
        }
    }
    extern "C" {
        #[link_name = "\u{1}system_error_destructor"]
        pub fn system_error_system_error_destructor(
            this: *mut crate::core::midi::rtme::root::std::system_error,
        );
    }
    // #[test]
    // fn __bindgen_test_layout_hash_open0_error_code_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::hash>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::hash)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::hash>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::hash)
    //         )
    //     );
    // }
    // #[test]
    // fn __bindgen_test_layout_hash_open0_error_condition_close0_instantiation() {
    //     assert_eq!(
    //         ::std::mem::size_of::<root::std::hash>(),
    //         1usize,
    //         concat!(
    //             "Size of template specialization: ",
    //             stringify!(root::std::hash)
    //         )
    //     );
    //     assert_eq!(
    //         ::std::mem::align_of::<root::std::hash>(),
    //         1usize,
    //         concat!(
    //             "Alignment of template specialization: ",
    //             stringify!(root::std::hash)
    //         )
    //     );
    // }
    pub const _Ios_Fmtflags__S_boolalpha: crate::core::midi::rtme::root::std::_Ios_Fmtflags = 1;
    pub const _Ios_Fmtflags__S_dec: crate::core::midi::rtme::root::std::_Ios_Fmtflags = 2;
    pub const _Ios_Fmtflags__S_fixed: crate::core::midi::rtme::root::std::_Ios_Fmtflags = 4;
    pub const _Ios_Fmtflags__S_hex: crate::core::midi::rtme::root::std::_Ios_Fmtflags = 8;
    pub const _Ios_Fmtflags__S_internal: crate::core::midi::rtme::root::std::_Ios_Fmtflags = 16;
    pub const _Ios_Fmtflags__S_left: crate::core::midi::rtme::root::std::_Ios_Fmtflags = 32;
    pub const _Ios_Fmtflags__S_oct: crate::core::midi::rtme::root::std::_Ios_Fmtflags = 64;
    pub const _Ios_Fmtflags__S_right: crate::core::midi::rtme::root::std::_Ios_Fmtflags = 128;
    pub const _Ios_Fmtflags__S_scientific: crate::core::midi::rtme::root::std::_Ios_Fmtflags = 256;
    pub const _Ios_Fmtflags__S_showbase: crate::core::midi::rtme::root::std::_Ios_Fmtflags = 512;
    pub const _Ios_Fmtflags__S_showpoint: crate::core::midi::rtme::root::std::_Ios_Fmtflags = 1024;
    pub const _Ios_Fmtflags__S_showpos: crate::core::midi::rtme::root::std::_Ios_Fmtflags = 2048;
    pub const _Ios_Fmtflags__S_skipws: crate::core::midi::rtme::root::std::_Ios_Fmtflags = 4096;
    pub const _Ios_Fmtflags__S_unitbuf: crate::core::midi::rtme::root::std::_Ios_Fmtflags = 8192;
